*******************************************************************************
*
* Program: XCB63P0
*
* Purpose: This program does a bunch of PERFORM paragraph statements,
*          including nested PERFORMs where a paragraph PERFORMs another
*          paragraph which PERFORMs another paragraph...
*
* NOTE:  This program is identical to XCB62P0 except that it is constructed
*        using ?SOURCE statements as opposed to being a single monolithic
*        source file.
*
?symbols

?SOURCE scb0063a(main-program-sec)
