 IDENTIFICATION DIVISION.

 PROGRAM-ID.   B30DIRb.
 AUTHOR.       JCW.
 INSTALLATION. TANDEM SOFTWARE DEPARTMENT.
 DATE-WRITTEN. 10/04/85.
 DATE-COMPILED.

* The IF, ENDIF, IFNOT, SETTOG, RESETTOG directives.
*
* Note that this test is supposed to compile and execute correctly
* in Tandem COBOL74 or Tandem COBOL85.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SOURCE-COMPUTER.  TANDEM/16.
 OBJECT-COMPUTER.  TANDEM/16.
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
?NOLIST
     COPY COPYLIB-PRINT-FILE IN B30QALIB.
?LIST

?HEADING "FILE SECTION"
/
 DATA DIVISION.
 FILE SECTION.
?NOLIST
     COPY COPYLIB-STANDARD-FILE IN B30QALIB.
?LIST

 WORKING-STORAGE SECTION.

?SETTOG 1, 5, 6
* Nested IF, both IF-TEST-1 and IF-TEST-2 paragraphs should be performed
?IF 1
     01 TEST-RESULTS-MAIN1.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.

?IF 2
     01 TEST-RESULTS-MAIN2.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?ENDIF 2
?IFNOT 5
     01 TEST-RESULTS-MAIN51.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?ENDIF 5
?ENDIF 1

?IF 6
?SOURCE B30DIRb1.cob(Source-Data1) 
?ENDIF 6

?NOLIST
?IF 1
    COPY COPYLIB-PROG-ID IN B30QALIB. 
?ENDIF 1
?LIST

?SYMBOLS; IF 1; TANDEM
    01 TEST-RESULTS-MAIN53. 
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?TANDEM; ENDIF 1

?RESETTOG 1, 5, 6

?SETTOG
?IF 7
     01 TEST-RESULTS-MAIN7.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?ENDIF 7
?RESETTOG

?IFNOT 3
     01 TEST-RESULTS-MAIN3.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?ENDIF 3

?IFNOT 5
     01 TEST-RESULTS-MAIN52.
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?ENDIF 5

?IFNOT 6
?SOURCE B30DIRb1.cob(Source-Data2) 
?ENDIF 6

?NOLIST;IFNOT 1
    COPY COPYLIB-PROG-ID IN B30QALIB. 
?ENDIF 1
?LIST

?SYMBOLS; IF 1; TANDEM
    01 TEST-RESULTS-MAIN54. 
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?TANDEM; ENDIF 1

?SYMBOLS; IF 1
    01 TEST-RESULTS-MAIN55. 
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 FEATURE                       PICTURE X(20).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 P-OR-F                        PICTURE X(5).
      05 FILLER                        PICTURE X   VALUE SPACE.
      05 PAR-NAME.
         10 FILLER                     PICTURE X(20).
      05 FILLER                        PICTURE X(3) VALUE SPACE.
      05 COMPUTED-A                    PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 CORRECT-A                     PICTURE X(12)   JUSTIFIED RIGHT.
      05 FILLER                        PICTURE X(8) VALUE SPACES.
      05 RE-MARK                       PICTURE X(29)   VALUE SPACES.
?TANDEM; ENDIF 1

?NOLIST
     COPY COPYLIB-STANDARD-DATA IN B30QALIB REPLACING "MMMA" BY "OCT "
           "YYYA" BY "1985" "MMMB" BY "OCT " "YYYB" BY "1985".
     COPY COPYLIB-PROG-ID IN B30QALIB REPLACING "XXXXXXX" BY "B30DIRb".
?LIST

?HEADING "MAIN SECTION"
/
 PROCEDURE DIVISION.
 MAIN SECTION.

     PERFORM COPYLIB-OPEN-FILE
?SETTOG 1, 5
* Nested IF, both IF-TEST-1 and IF-TEST-2 paragraphs should be performed
?IF 1
     PERFORM IF-TEST-1
?IF 5
     PERFORM IF-TEST-2
?IF 2
     PERFORM IF-TEST-2
?ENDIF 2
?ENDIF 5
?ENDIF 1

?IFNOT 1
    PERFORM IF-TEST-1
?ENDIF 1
?RESETTOG 1, 5

?IF 1
     PERFORM IF-TEST-1
?IF 5
     PERFORM IF-TEST-2
?ENDIF 5
?ENDIF 1

?IFNOT 1
    PERFORM IF-TEST-1
?ENDIF 1

?SETTOG
?IF 6
    PERFORM IF-TEST-6
?ENDIF 6
?RESETTOG

?SETTOG 1
?IF 1
?SOURCE B30DIRb1.cob(Source1)
?ENDIF 1
?RESETTOG 1

?SETTOG 10

* Nested IF, only IF-TEST-3 should be performed
?IF 10
     PERFORM IF-TEST-3
?IF 15
     PERFORM IF-TEST-FAIL-1
?ENDIF 15
?ENDIF 10

?IFNOT 15
     PERFORM IF-TEST-4
?ENDIF 15

?RESETTOG 10
?IFNOT 10
     PERFORM IF-TEST-5
?ENDIF 10
     PERFORM COPYLIB-CLOSE-FILE
     STOP     RUN
 .
?HEADING "IF-TEST-1 SECTION"
/
 IF-TEST-1 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-1"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
?HEADING "IF-TEST-2 SECTION"
/
 IF-TEST-2 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-2"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
?HEADING "IF-TEST-3 SECTION"
/
 IF-TEST-3 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-3"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
?HEADING "IF-TEST-4 SECTION"
/
 IF-TEST-4 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-4"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
?HEADING "IF-TEST-5 SECTION"
/
 IF-TEST-5 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-5"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-6 SECTION"
/
 IF-TEST-6 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-6"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-7 SECTION"
/
 IF-TEST-7 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-7"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-8 SECTION"
/
 IF-TEST-8 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-8"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-9 SECTION"
/
 IF-TEST-9 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-9"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-10 SECTION"
/
 IF-TEST-10 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-10"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-11 SECTION"
/
 IF-TEST-11 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-11"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-12 SECTION"
/
 IF-TEST-12 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-12"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-13 SECTION"
/
 IF-TEST-13 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-13"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-14 SECTION"
/
 IF-TEST-14 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-14"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
 ?HEADING "IF-TEST-15 SECTION"
/
 IF-TEST-15 SECTION.

     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-15"    TO PAR-NAME
     PERFORM PASS
     PERFORM PRINT-DETAIL
 .
?HEADING "IF-TEST-FAIL-1 SECTION"
/
 IF-TEST-FAIL-1 SECTION.

* IF-TEST-FAIL-1 should not be called because TOGGLE 15 is supposed to be OFF
     PERFORM COPYLIB-TEST-INIT
     MOVE "IF DIRECTIVE" TO FEATURE
     MOVE "IF-TEST-FAIL-1" TO PAR-NAME
     PERFORM FAIL
     PERFORM PRINT-DETAIL
 .
?NOLIST
     COPY COPYLIB-OPEN-FILE  IN B30QALIB.
     COPY COPYLIB-TEST-INIT  IN B30QALIB.
     COPY COPYLIB-CLOSE-FILE IN B30QALIB.
     COPY COPYLIB-GENERAL-UTILITIES IN B30QALIB.
?LIST
