 IDENTIFICATION DIVISION.
 PROGRAM-ID. main.
 DATA DIVISION.
 FILE SECTION.
 WORKING-STORAGE SECTION.

   01  glob  NATIVE-2 VALUE 30 GLOBAL.

 PROCEDURE DIVISION.
 start-main.

   Display "In main".
   Call "Dog".

 IDENTIFICATION DIVISION.
 PROGRAM-ID.  dog.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

 PROCEDURE DIVISION.
 Start-Dog.

   Move 17 to glob.

 END PROGRAM dog.
 END PROGRAM main.
