 IDENTIFICATION DIVISION.
 PROGRAM-ID. main.
 DATA DIVISION.
 WORKING-STORAGE SECTION.

*******************************************************************************
* Level 88
*******************************************************************************
  01 level88-9-is5 PIC 9 VALUE 5.
     88 condition-9-is1 VALUE 1.
     88 condition-9-is5 VALUE 5.
     88 condition-9-isAlso5 VALUE 5.
     88 condition-9-isOdd VALUE 1, 3, 5, 7, 9.
     88 condition-9-isEven VALUE 0, 2, 4, 6, 8.
     88 condition-9-is3Thru7 VALUE 3 THRU 7.

  01 level88-x-is1 PIC X VALUE "1".
     88 condition-x-is1 VALUE "1".

  01 level88-x3-isOne PIC X(3) VALUE "one".
     88 condition-x3-isOne VALUE "One", "ONE", "one".
     88 condition-x3-isTwo VALUE "Two", "TWO", "two".

  01 level88-x-is5 PIC X VALUE "5".
     88 condition-x-AThruZ  VALUE "A" THRU "Z".
     88 condition-x-0Thru9  VALUE "0" THRU "9".

  01 level88-99-is2 PIC 9 VALUE 2.
     88 condition-9-Lt4 VALUE 0 THRU 4.

  01 FILLER PIC X VALUE "T".
     88 condition-filler-x-IsTrue  VALUE "T".
     88 condition-filler-x-IsFalse VALUE "F".

  01 level88-99-is3 PIC 99 VALUE 3.
     88 condition-99-isLegal VALUES ARE 0, 3, 7 THROUGH 11.

  01 level88-native2-is22 NATIVE-2 VALUE 22.
     88 condition-native2-is11 VALUE 11.
     88 condition-native2-is22 VALUE 22.

  01 level88-native4-is2147483647 NATIVE-4 VALUE 2147483647.
     88 condition-native4-isMax VALUE 2147483647.

  01 level88-native8-is2147483647 NATIVE-8 VALUE 2147483647.
     88 condition-native8-isMax VALUE 922337203685401580.

  01 level88-S99-is-38 PIC S99 VALUE -38.
      88 condition-S99-is22     VALUE 22.
      88 condition-S99-is-38    VALUE -38.

  01 level88-S99-TS-is-23 DISPLAY PIC S99 SIGN IS Trailing Separate VALUE -23.
      88 condition-S99-TS-is-23  VALUE -23.

  01 level88-S99-LE-is-59 DISPLAY PIC S99   SIGN IS Leading VALUE -59.
      88 condition-S99-LE-is593   VALUE 59.
      88 condition-S99-LE-is-593  VALUE -59.

  01 level88-S99-LS-is-33 DISPLAY PIC S99   SIGN LEADING Separate VALUE -33.
      88 condition-S99-LS-is33    VALUE 33.
      88 condition-S99-LS-is-33   VALUE -33.

  01 level88-S99-comp3-is-17 COMP-3 PIC S99  VALUE -17.
      88 condition-S99-comp3-is-17  VALUE -17.
      88 condition-S99-comp3-is17   VALUE 17.
      88 condition-S99-comp3-is20   VALUE 20.

  01 level88-99-comp3-is88 COMP-3 PIC 99  VALUE 88.
      88 condition-99-comp3-is88   VALUE 88.
      88 condition-99-comp3-is87   VALUE 87.

  01  nat  NATIVE-2 VALUE  1.
      88 nata       VALUE  1.
      88 nataa      VALUE  -1.
      88 natb       VALUE  2.
      88 natc       VALUE  3 thru 4.
      88 natd       VALUE  5 6.
      88 nate       VALUE  100 thru 104 17000 thru 22000.


* PCI: these constants are described as PDT^DESC^char.
* char is XX and constants like "CD" are described as have len = 2
* in PCI's storage^info.  Even though the parent
* is XX, the constant generated by COBOL85 and NMCOBOL for cha is "A"
* with len = 1.  I have no idea how VI/Inspect was supposed to compare that
* value with an XX variable.  The stmt Move "A" to char pads a space, "A ".
* DWARF:  DW_ATE_unsigned_char but actual constant data shows "(null)"

  01  char  PIC XX  VALUE  "EM".
      88 cha        VALUE  "A".
      88 chb        VALUE  "B".
      88 chc        VALUE  "CD" thru "EF".
      88 chd        VALUE  "GH" "JK".
      88 che        VALUE  "LM" thru "NP" "RS" thru "TU".

* PCI: these constants are in binary, they are not "2" as in memory.

  01  nu PIC 99  VALUE  17.
      88 nua     VALUE  1.
      88 nub     VALUE  2.
      88 nuc     VALUE  22 thru 47.
      88 nud     VALUE  55 66.
      88 nue     VALUE  10 thru 14 88 thru 99.


* signed trailing embedded
* PCI describes the 88 constants as PDT^DESC^bin^sign

  01  te PIC S99 VALUE 17.
      88 tea     VALUE 22.


* signed trailing separate
* PCI describes the 88 contants as PDT^DESC^bin^sign

  01  ts Display  Pic S99   Sign is Trailing Separate VALUE 18.
      88 tsa     VALUE 23.


* signed leading embedded
* PCI describes the 88 contants as PDT^DESC^bin^sign

  01  le Display  Pic S99   Sign is Leading VALUE  2.
      88 lea     VALUE 24.


* signed leading separate
* PCI describes the 88 contants as PDT^DESC^bin^sign

  01  ls Display Pic S99   Sign is Leading Separate VALUE 19.
      88 lsa     VALUE 25.

* packed signed
* PCI describes the 88 contants as PDT^DESC^bin^sign
  01  ps PIC S99 COMP-3   VALUE 17.
      88 psa     VALUE 26.

* packed unsigned
* PCI describes the 88 contants as PDT^DESC^bin^sign
  01  pu PIC  99 COMP-3 VALUE 18.
      88 pua     VALUE 27.

 PROCEDURE DIVISION.
 main-start.

   Display "Start main".
   Move "A" to char.
   Move 2  to nat.
   Move 22 to nu.
   Move "23" to nu.
   Display "End main".

 END PROGRAM main.

