?save STARTUP
 IDENTIFICATION DIVISION.
 PROGRAM-ID. BPTEST2.
  DATA DIVISION.
  WORKING-STORAGE SECTION.

  01 MY-ALPHA-FIELD PIC XXXXXXXXXX VALUE "AB".

  PROCEDURE DIVISION.
    MAIN-LOGIC SECTION.
    MAIN-LOGIC-IN.
    PERFORM CHAPTER-A
  STOP RUN.


  CHAPTER-A.
    DISPLAY "I'm now in CHAPTER-A"
    DISPLAY  MY-ALPHA-FIELD
    .
