?INSPECT
?SYMBOLS
?SAVEABEND
?CONSULT =COBOLEX0;NOBLANK;SAVE STARTUP;OPTIMIZE 2
?PORT
* MEASTCM T6042H01^ABC (29FEB12)
* Copyright Notice:  HP CONFIDENTIAL: NEED TO KNOW ONLY
*
*  @ @ @ START COPYRIGHT @ @ @
*
*  Copyright 2003
*  Hewlett Packard Development Company, L.P.
*
*  Copyright 2001
*  Compaq Computer Corporation
*  Protected as an unpublished work.
*  All rights reserved.
*
*  The computer program listings, specifications and
*  documentation herein are the property of Compaq Computer
*  Corporation and successor entities such as Hewlett Packard
*  Development Company, L.P., or a third party supplier and
*  shall not be reproduced, copied, disclosed, or used in whole
*  or in part for any reason without the prior express written
*  permission of Hewlett Packard Development Company, L.P.
*
*  @ @ @ END COPYRIGHT @ @ @
*
*****************************************************************************
*
*                    MeasTCM (MEASURE to TCM interface)
*                    ----------------------------------
*
* MeasTCM is the software component of the TCM                       )
* toolkit that provides the interface between measurement data on the
* HP host and the capacity planning tool TCM on the workstation.
*
* For more information, refer to the "TCM User's Guide and Reference
* Manual" (P/N 065084).
*
*
* History
* -------
*
* 13MAR92 > C31 NPV, first version written in COBOL85.
*           This version runs on Guardian 90 C20 or higher and supports
*           measurement data files with versions C10 (unofficialy), C20,
*           C30, D00, D10.
*
* 30OCT92   AAA IPM.
*
*         > Para 1000-INITIALIZE: the sort parameter NOWAIT-IO is now
*           specified.
*
*         > W08, W09, W13, and W14 didn't include internal disc activity;
*           this has been corrected.
*
*         > W13 and W14 didn't include explicit seek activity; this has
*           been corrected.
*
*         > During report print, when the first item on a new page happened
*           to be a category total, it was omitted. Also, the cpu busy
*           counter would not be reset to zero before starting with a new
*           category.
*
*         > The limit of 256 occurences of the same PID has been raised to
*           32768.
*
*         > The limit of 5000 processes per system has been raised to 20000.
*
*         > The sort of SYSTEM-TABLE has been removed. This is because the
*           sort processes messes up the link between the index into this
*           table and MEASURE-SYSTEM-NUMBER. This should be redesigned
*           eventually.
*
*         > A new control file parameter CPUPOWER has been added. It allows
*           to override the default CPU power values in CPU-TYPE-POWER.
*           This also resulted in the addition of two new messages,
*           77 and 78.
*
* 01JUN93 > Support for generation of multiple CSV data files included.
*           3000-CORE-PROCESSING loops through the entire process of CSV
*           generation for the number of CSV files. Opening the Spooler file
*           if specified, is done before this loop, and closed at the end
*           along with the Measure files.
*
*         > A new control file parameter NUMCSVS is added. This allows the
*           user to specify the number of CSV data files to be generated.
*           If it is not possible to generate the user specified number of
*           CSV data files, the maximum possible are generated.
*
*         > MEASURE-TABLE now includes the start and stop times and the
*           collection interval of the file.
*
*         > Validation of Measure data files to check if their time ranges
*           overlap has been included. If the Measure data file does not
*           have a specified collection interval, it is set as the
*           difference between the stop and start times of the file.
*
*         > CSVHI and CSVLO parameters are now optional. The time window of
*           each CSV data file produced is the "actual" time, i.e., the
*           start time is max(CSVLO, earliest start time) and stop time is
*           min(CSVHI, latest stop time). As far as is possible, CSV data
*           file with all zeroes will not be generated.
*
*         > Fixed algorithm to calculate the number of drives.
*
*         > Fixed the method by which the physical count of CPUs was being
*           calculated. This was not a reported problem.
*
*         > Support for D20 version of Measure data included. This program
*           also runs on D20 CISC and D20 RISC versions of Guardian 90.
*
*         > The audit report now prints out the details of each of the CSV
*           data files produced. The name of the CSV data file is also
*           printed in the heading.
*
*         > A "Run Summary" is also generated by this program. It is
*           displayed at the end of the run, and also at the end of the
*           audit report, if specified.
*
*         > The CSVDATA keyword in the control file is now used differently.
*           A maximum of five characters of the file name specified is used
*           to prefix the CSV data file. For eg., if the parameter is ABCDE
*           or ABCDEF, the CSV data file will be named ABCDE001, and so on.
*           If the parameter is ABCD, the CSV data file will be ABCD001.
*
* 15OCT93 IPM AAB - for Himalaya - altered the cpu-type-power table so that
*           NSR-N is found before NSR-M - both are type 7.  It is expected
*           that NSR-M types will not be released.
*           Chris Narrows.
*
* 17DEC93 IPM AAC - Chris Barrows.
*
*         > Added two new fields to the process workload CSV records.
*           TNSR-BUSY-TIME (secs) and ACCEL-BUSY-TIME (secs).
*           Columns 22 and 23.  These fields only applied to D20 so
*           considerable source restructoring was performed to allow
*           exception processing for each OS version.  The longest CSV
*           record was increased from 116 to 138 bytes.  For pre-D20
*           releases the two new fields will be empty (spaces).  For
*           data from multiple systems with mixed OS versions where one
*           is from D20 then the fields will be present or zero.
*
*           The increased record size of 138 exceeds the IXF default size
*           of 132, this means that (REC 138) must be included on all
*           uses of IXF if these new fields are not empty.  If this
*           IXF option is not included then TCM will be able to detect
*           the truncated data and issue and error message.
*
*         > Corrected a problem with NUMCSVS.  When * was specified and the
*           measurement was slightly longer than a multiple of intervals
*           then a final CSV file could be generated that was so small
*           that COBOL arithmetic overflow errors would occur.  The fix
*           was to ignore the residual time and set maximum CSVs to the
*           maximum number of whole intervals.
*
*         > Source re-structured in preparation for converting MEASTCM
*           to a TPDC client.  Changes gave 20% performance improvement.
*           Changes included -
*
*           1. Adding white space (blank lines) between comment lines
*              and source to make source more readable.
*
*           2. Upshifting all source statements excepts comments or literals.
*
*           3. Introduced block structuring, e.g.
*                  Removed all GO TO constructs.
*                  Removed all PERFORM ... THRU... constructs.
*                  Removed all complex nested IF statements and replaced
*                      with simple EVALUATE Statements.
*
*           4. Removed all complex and long in line PERFORM and IF constructs
*                  and replaced with performed paragraphs.
*
*           5. Included consistency with scope terminators. e.g. END-IF.
*
*           6. Added hyphen lines to seperate paragraphs (readability).
*
*           7. Added index to paragrpahs.
*
*         > Code added to support NSR-M processor type.  This was type 7
*           subtype 1.  Because of the use of subtypes nearly the whole
*           mechanism for assigning CPU POWER values was re-written.
*           Essentially the CPU-POWER table was ammended to include
*           subtypes for all CPU types.  This enabled a simplification
*           for dealing with CLX cpu types.  The CLXTYPE parameter now
*           simply establishes the appropriate subtype, so that all
*           remaining code simply uses the power table but specifies both
*           type and subtype. A new paragraph 3137-GET-CPU-TYPE-SUBTYPE
*           assigns the correct type and subtype to any cpu from any OS
*           version.
*
*         > CPU power conversion factor for NSR-N changed from 9.6 to 15.6,
*           NSR-L (C release) changed from 5.3 to 5.6.
*
*         > Fix for TPR 931026-1911-717 Incorrect VPROC.
*
*         > Fix for TPR 931025-1738-717 No SAVEABEND on object.
*
*         > Earliest START-TIME was not calculated correctly.  It was always
*           set to the START TIME of the first measure file.  It is now
*           set to the lowest start time of all measure files.
*
*         > re-wrote the mechanism for dealing with the CPU POWER
*           table.  This had to be changed to include D series
*           performance values as well as C series.  All references
*           now need to know the Guardian release before access.
*
*         > The CPUFACTOR command was changed to allow a reference
*           to the Guardian release.
*
*         > The CONVERTTO command was altered to allow conversion to
*           C or D specifically.  This is undocumented and will only
*           operate under debug-mode (SWITCH-15 ON).
*
*         > Introduced new completion message 86.  Generated if not
*           all CPUs have been measured and CONVERTTO is used.
*
*         > Added new flag - ABEND-REQUIRED-FLAG.  The default value
*           is zero (do not abend).  This is set to 1 prior to calling
*           9000-COMPLETION, when a saveabend file is required.  The
*           will now always terminate with a 0 termination status unless
*           a SAVEABEND file is required.
*
*         > Corrected spelling of tabel to table in COMPLETION msg 54.
*
* 15AUG94 IPM AAD - Jack Driscoll.
*
*         > Fix for TPR 94XXXX-XXXX-18106 does not work with measure d25
*           due to increased lengths of CPU and PROCESS entity records.
*           The D25 Measure was part of the D20.02 release and found
*           a gaping hole in our procedures.
*
* 12SEP94 IPM AAE - Chris Barrows.
*
*         > Included support for D30.
*
* 24FEB95 IPM AAF - Chris Barrows
*
*         > Increased variable TEMP-COLL-INT from Z(4) to Z(5).
*           The preceding filler loses its trailing space to compensate.
*           The is to correct the TPR S940830-1539-1980 Arith Overflow.
*
*         > Changed the version of C31 in the completion info to D30.
*           See TPR 941011-1514-717.
*
*         > Arithmetic overflow has been reported several times when
*           the DISC-TO-DOPN-READ-RATIO or DISC-TO-DOPN-WRITE-RATIO
*           exceeded their maximum values of 9(4).9(5).
*           These two fields have been increased in size to 9(9).9(5)
*           and ON SIZE ERROR clauses added to their source calculations.
*           If a size error occurs then the maximum value is used.
*           These fields affect the results of the process category
*           fields: W13 and W08 (for physical disc reads) and
*           W14 and W09 (for physical disc writes).
*
*         > Added new processor types to CPU POWER table.  These
*           are for the NSR-P and NSR-K.
*
*         > Increased the PROCESS-CEILING value from 20000 to 90000.
*
* 09OCT95 IPM AAG - Chris Barrows.
*
*         > Included support for D40.
*
* 20DEC95 IPM AAH - Chris Barrows. This IPM was never released.
*
*         > Included support for the Q (query) transaction type.
*           Only changed the VALID-TRANSACTION-TYPES values to include Q.
*
* 15APR96 NPV D40 - Chris Barrows.
*
*         > An NPV release for the aborted D20 AAH IPM.
*           Renamed the source file MEASTCMS to SOURCE1.
*           Added 3 more spare source modules Source2, 3, and 4.
*
* 21OCT96 IPM AAH - Guy Groulx.
*
*         > Fix for TPR 960517-1024-3333.  Overflow on LCM.
*         > Fix for TPR 930323-1200-10543.  Don't abend on entity errors,
*              an overflow count is now kept instead and warning displayed
*              on termination.
*         > Modified to not be version dependent anymore.
*         > Only create the number of CSVs required when a higher number
*           is specified in the control file.
*         > Support for Whitney, also support for G01 measure.
*         > Modified ENTITY-LENGTH to have a big buffer area.
*         > Trap non-existing input file and give out a message.
*
* 29APR97 IPM AAI - Guy Groulx.
*         > Fix for TPR 961009-1300-3333.  Arith overflow on measure file with
*             error 45.  Problem is really a measure problem, but this version
*             works around by declaring the measure file invalid.
*         > Fix problem with percentage linked/unlinked which were not being
*             reset for each CSV data file.
*         > MEASURE-TABLE now contains the external file name.
*         > Added Neveda numbers.
*         > ALLOW "G" as valid Guardian-type.
*
* 13Aug98 IPM AAJ - Guy Groulx.
*         > Fix for Whitney type.   8, 0 is actually what was released.
*         > Proper fix for DISK entries.   Use READ-QBUSY-TIME and
*           WRITE-QBUSY-TIME when available.
*         > Do not validate CPU type, subtype if CONVERTTO is not used.
*         > Eventhough MeasTCM was YEAR 2000 compliant, removed call to ACCEPT
*           from DATE and replaced with CURRENT-DATE.
*
* 23Nov98 IPM AAK - Guy Groulx.    Not yet released.
*         > Changed check for LCM >= 0 to > 0 so that div by 0 does not occur.
* 29Jun99 > Added NSR-T for S72000 cpus.   9,1 is the type, subtype.
*         > Will now have a buffer for new cpu types.
*         > DiskModel lines will now be written to CSV file.
*
* 04Nov01 IPM AAL
*         > Soln 10-001227-8157.
*           Added NSR-V for S74000 cpus. 9,2 is the type, subtype.
*           Added NSR-D for S7400 cpus.  9,10 is the type, subtype.
*         > Fix for Soln 10-000518-8168. Abnormal termination (error 87) with
*           record allocation error for large measure data files, when number
*           of CSVs created much less than the number possible. Added check for
*           counter overflow. Use 64-bit counters when 32-bit counters overflow.
*         > Fix for Soln 10-000602-8415. MeasTCM now correctly reports the NSK
*           version of the measured system in the CSV file. Earlier, it used
*           to report the MEASURE version of the data file.
*         > Fix for Soln 10-000925-0463. Inserted check for a blank volume
*           name in FILE-NAME of DISCOPEN-DEFINITION, to prevent Volume-Link
*           error.
*         > Fix for Soln 10-001222-8124. Blank spaces before the keywords in
*           the Control file are now ignored.
*         > Fix for Soln 10-001226-8148. Incorrect write activity was being
*           reported as the value of Volume-read-busy-time used to change
*           before computation of Volume-write-busy-time.
*         > Fix for Soln 10-010627-1347. Support for Virtual Disks.
*         > Fix for Soln 10-011016-3820.  MeasTCM Abends with Cobol85 Library
*           Error 121, Arithmetic overflow, when a Measure data file contains
*           more than 16383 PROCESS records.
*
* 10Jan03 SPR AAM
*         > Soln 10-021028-2764.
*           CSV files not created on G06.17 and G06.18 giving
*           error in purging CSV file.
*
* 25Jul03 SPR AAN
*         > Soln 10-030328-5170.
*           MEASTCM: Arithmetic overflow at MEASTCM-AAM.#7111(SOURCE1).
*           W08 and W08 size is changed to 9(15).9(3).
*           W13 and W14 size is changed to 9(15).
*           W03, W04, W06 and W07 size is changed to 9(10).
*           CSV-FILE-RECORD size changed to 172.
*         > Soln 10-030429-5986.
*           MEASTCM: arithmetic overflow #T6042D40-10JAN03-MEASTCM-AAM.#7108.
*         > Soln 10-030502-6113.
*           MEASTCM: Arithmetic overflow at T6042AAM.#7114.
*         > Soln 10-020717-0465.
*           Meastcm cannot support 76K and 86K CPU factors having power-values
*           > 99.99.
*
* 21Nov03 SPR AAO
*         > Soln 10-020415-8203.
*           DISKCONVERTTO, ACTUALDISK42, ACTUALDISK43,  ACTUALDISK44,DISKFACTOR
*           keywords are introduced, which enables disk scaling.
*
* 09JUL04 SPR AAP
*         > Soln 10-040510-5889.
*           Measure Data File from a mixed Disk System now displays
*           the correct number of disks.
*
* 01MAY05 T6042H01
*         > An IPV(Initial Product Version) Release, MeasTCM (T6042 H01)
*           has been enhanced to support the new MEASURE YOSEMITE External
*           Record Format. New ZMS-<Entity>-Definitions for the Entities
*           CPU, DISC, PROCESS, DISCOPEN have been added to the COPYLIB File
*           to access YOSEMITE Entity Records.
*           New Procedures have been added to SOURCE1 File for
*           supporting YOSEMITE.
*           Support to NSE-A CPU.
*           Support to JBOD Disks(BF07255B2C,BF0725754B,BF07258243,BF14658244).
*           Support to FCSA (Fibre Channel ServerNet Adapter).
*
* 01MAY06 T6042AAQ
*         > Soln 10-060403-5541.
*           MeasTCM now supports NSR-Z(S88000) and NSR-H(S78000) processors,
*           and generates CSV files with correct CPU time with CONVERTTO NSE-A
*           directive.
*
* 24MAY06 T6042AAR
*         > Soln 10-060505-6280.
*           The Interrupt processes busy time is no more accounted in the
*           CPU-BUSY-TIME of the System cateagory.
* 1SEP06  T6042AAS
*         > Soln 10-060830-8685
*           Added NSE-P for NS1000 cpus. 10,0 is the type, subtype.
*           Added NSE-D for NS14000 cpus.10,2 is the type, subtype.
* 2JAN07  T6042AAU
*         > Soln 10-060926-9325.
*           Support for the JBOD discs(BF07255B2C,BF0725754B,BF07258243,BF14658244).
*           Support to FCSA (Fibre Channel ServerNet Adapter).
*           Support for 46144 disc.
*           Support for 4638 disc.
*           Support for NSR-Z(S88000) and NSR-H(S78000) processors.
*
*         > Soln 10-061115-0524.
*           The Disk scaling workflow in MeasTCM has been modified to treat
*           the scaling of each disk individually. Unlike the previous approach,
*           the disk measurements( read-busy-time, write-busy-time, etc.) are now
*           scaled before being populated in the arrays( like volume-read-busy-time,
*           volume-write-busy-time, etc.). Thus, the inaccuracy which arises out of
*           cumulative addition of disk-power-value has been done away with.
*           The Physical disk reads and writes have been made non scalable.
* 2MAY08  T6042AAW
*         > Soln 10-080208-0419
*           Added NSE-Q for NS1200 cpus. 10,91 is the type, subtype.
*           Added NSE-T for NS16200 cpus. 10,83 is the type, subtype.
* 19APR10 T6042AAZ
*         > Soln 10-100304-8526
*           Support for H02,H03,H04,H05 version of measure files are added.
*           Added NSE-T and NSE-Q CPUs to Table of CPU-types.
*           Modified 'H-CPU-NUM' for available number of H-CPUs.
* 30AUG10 T6042ABA
*         > Added  support for J-Series Blades.
*         > Added NSE-M for NB50000 cpus. 10,71 is the type, subtype.
* 10NOV10 T6042ABA
*         > Soln 10-080623-4041
*         > Modified paragraph 3510-READ-DISCOPEN-TOTALS-CONT,3515-TREAT-DISCOPEN-T-INFO
*         > to read individual discopen entities to get virtual disk read/write time.
*         > Added paragraph 3411-TREAT-DISCOPEN-T-ENTITY
*         > Added paragraphs 3520-VOLUME-DOPN-UPDAT,3520-VOLUME-DOPN-UPDAT-Y with binary search
*         > to accomodate virtual disks for SMF.
* 23NOV10 T6042ABA
*         > Soln 10-090116-8480
*         > No more zero values for disc read/write counts in csv file.
* 23NOV10 T6042ABA
*         > Added support for latest JBOD disks.
* 29NOV11 T6042ABC
*         >Capacity Enhancements Program
*         >Added support for NSR-E,NSR-J,NSE-K,NSE-I,NSE-S and NSE-B CPUs.
*         >Removed old C-series and D-series CPUs.
*         >Added support for multi-core CPUs-NSE-M,NSE-W,NSE-AD and NSE-AB.
*         >Added support for SAS disks (subtype 51).
*         >Added support for Write Cache feature for SAS disks.
*         >Added partial support for XP disk configurations-XP24KRG5A and XP24KRG5B
*         >Added support for H06 version of Measure.
*         >Added support for CLIM controller.
*         >Modified the disk algorithm to include read ans write seek times to calculate diskspeedup.
*         >Added a new keyword NUMTMFTRAILS to support multiple auxilary TMF audit trails.
*         >As object file reached maximum possible size, disk related paragraphs are moved
*         >into sub program "SPDISKINFO" and Eroorhandling/termination routines are
*         >moved into sub program "SPCOMPLETION".
*****************************************************************************
*
* Index to paragraphs - (only major paragraphs included here)
*
*      100-ENTRY.                          Main control.
*      1000-INITIALIZE.                    Initialization.
*      2000-CONTROL-FILE-PROCESSING.       Process control file.
*      2400-MEASURE-TABLE-SCAN.            Validate Measure files.
*
*      3000-CORE-PROCESSING.               Main loop.
*      3100-READ-CPU-INFO.                 Read CPU data and process.
*      3200-READ-DISC-INFO.                Read DISC data and process.
*      3300-READ-PROCESS-INFO.             Read PROCESS data and process.
*      3400-READ-DISCOPEN-INFO.            Read DISCOPEN data and process.
*
*      4000-PRINT-REPORT.                  Produce audit reports.
*      5000-CLOSE-MEASDATA.                Close Measure files.
*      6000-WRITE-CSV.                     Write CSV file.
*      7000-DISPLAY-SUMMARY.               Display run statistics.
*      9000-COMPLETION.                    Shutdown processing.
*      9980-COMPUTE-INTR-AUX.              To find the cpu busy time of prior  ity 255 processes.
*      9990-ADD-AUX-TO-CAT.                Modify the cpu busy counter of $    system cateagory.
*****************************************************************************
*----------------------------------------------------------------------------
?MAIN MEASTCM
 IDENTIFICATION DIVISION.
* >>>>> Version dependent field <<<<<
*PROGRAM-ID. T6042C31-30OCT92.
*PROGRAM-ID. T6042D20-01JUN93.
*PROGRAM-ID. T6042D20-15OCT93.
*PROGRAM-ID. T6042D20-17DEC93-MEASTCM-AAC.
*PROGRAM-ID. T6042D20-15AUG94-MEASTCM-AAD.
*PROGRAM-ID. T6042D20-12SEP94-MEASTCM-AAE.
*PROGRAM-ID. T6042D20-24FEB95-MEASTCM-AAF.
*PROGRAM-ID. T6042D20-09OCT95-MEASTCM-AAG.
*PROGRAM-ID. T6042D20-20DEC95-MEASTCM-AAH.
*PROGRAM-ID. T6042D40-15APR96-MEASTCM.
*PROGRAM-ID. T6042D40-21OCT96-MEASTCM-AAH.
*PROGRAM-ID. T6042D40-29APR97-MEASTCM-AAI.
*PROGRAM-ID. T6042D40-21AUG98-MEASTCM-AAJ.
*PROGRAM-ID. T6042D40-09AUG99-MEASTCM-AAK.
*PROGRAM-ID. T6042D40-15NOV01-MEASTCM-AAL.
*PROGRAM-ID. T6042D40-10JAN03-MEASTCM-AAM.
*PROGRAM-ID. T6042D40-25JUL03-MEASTCM-AAN.
*PROGRAM-ID. T6042D40-21NOV03-MEASTCM-AAO.
*PROGRAM-ID. T6042D40-09JUL04-MEASTCM-AAP.
*PROGRAM-ID. T6042H01-01MAY05-MEASTCM.
*PROGRAM-ID. T6042H01-01MAY06-MEASTCM-AAQ.
*PROGRAM-ID. T6042H01-24MAY06-MEASTCM-AAR.
*PROGRAM-ID. T6042H01-25OCT06-MEASTCM-AAS.
*PROGRAM-ID. T6042H01-02JAN07-MEASTCM-AAU.
*PROGRAM-ID. T6042H01-02MAY08-MEASTCM-AAW.
*PROGRAM-ID. T6042H01-19APR10-MEASTCM-AAZ.
*PROGRAM-ID. T6042H01-30AUG10-MEASTCM-ABA.
 PROGRAM-ID. MEASTCM.
 AUTHOR. Jos Marchand, Chris Barrows, Guy Groulx
 INSTALLATION. HP NonStop Systems.
*----------------------------------------------------------------------------
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
* If SWITCH-15 is set (using a PARAM command), additional information will
* be displayed. This is used for debugging by SSG and development.
     SWITCH-15 SWITCH15 ON DEBUG-MODE
     FILE "=COBOLLIB" COBOLLIB
     FILE "=CBL85UTL" CBL85UTL
     FILE "OTALNAME"  OTALNAME
     SYMBOLIC HEX-FE 255
     CLASS COMMENT-CHARS           " !\"
     CLASS WC-FILENAME             " $*?" "0" THRU "9" "A" THRU "Z"
     CLASS NODE-NAME               " \"   "0" THRU "9" "A" THRU "Z"
     CLASS VALID-CATEGORY-TYPES    "DFLORSTZ"
     CLASS VALID-TRANSACTION-TYPES "BXQ".
*----------------------------------------------------------------------------
 INPUT-OUTPUT SECTION.
 FILE-CONTROL.
     SELECT OPTIONAL CONTROL-FILE ASSIGN #DYNAMIC
            RESERVE 8
            FILE STATUS IS CONTROL-FILE-STATUS.
     SELECT CSV-FILE     ASSIGN #DYNAMIC.
* The RESERVE cluase is not specified in this case since it is ignored for
* EDIT files (Don Nelson).
     SELECT SORT-FILE    ASSIGN #TEMP.
     SELECT SPOOLER-FILE ASSIGN #DYNAMIC.
 I-O-CONTROL.
     SAME CONTROL-FILE CSV-FILE SPOOLER-FILE.
*----------------------------------------------------------------------------
 DATA DIVISION.
 REPLACE ==BODY==                BY ==60==
*        Current Version is D40.
         ==CURRENTVERSION==      BY ==17448==
*------------MeasTCM Yosemite Change----Start-----------
*        Current Version is Yosemite.
         ==CURRENTVERSION-YOSEMITE==      BY ==18433==
*        Yosemite H01 Version (Known as YSM in Measure).
         ==H01==   BY ==18433==
* Start of code change for Soln:10-100304-8526
*        ==H02==   BY ==18434==
*        ==H03==   BY ==18435==
*        ==H04==   BY ==18436==
*        ==H05==   BY ==18437==
         ==H06==   BY ==18438==
* End of code change for Soln:10-100304-8526
*------------MeasTCM Yosemite Change-----End------------
*        Minimum allowed Measure file is C10.
*         ==C10==                 BY ==17162==
*        Minimum allowed Measure file is G02.
          ==G02==                 BY ==18178==
*         ==C30==                 BY ==17182==
*        Minimum version for D versus C.  Needed because of RICS vs CICS.
*         ==D00==                 BY ==17408==
*        Minimum Guardian version allowed is C20 which = TOSVERSION M20.
*         ==M20==                 BY ==19732==
*        Minimum Guardian version allowed is G02 which = TOSVERSION Q02.
          ==Q02==                 BY ==20738==
* Below 1 line commented for Soln 10-001227-8157.
*        ==CPU-CEILING==         BY ==17==
*        ==CPU-CEILING==         BY ==19==
* Soln 10-020717-0465
*        ==CPU-CEILING==         BY ==21==
*------------MeasTCM Yosemite Change----Start-----------
*        ==CPU-CEILING==         BY ==22==
*         ==CPU-CEILING==        BY ==24==
         ==CPU-CEILING==         BY ==23==
*------------MeasTCM Yosemite Change-----End------------
         ==CPU-POWER-COLUMNS==   BY ==3==
         ==CPU-POWER-ROWS==      BY ==6==
         ==MEASURE-CEILING==     BY ==99==
         ==SYSTEM-CEILING==      BY ==10==
         ==PROCESS-CEILING==     BY ==90000==
         ==TITLE-CEILING==       BY ==100==
         ==TXN-CEILING==         BY ==40==
         ==VERSION-CEILING==     BY ==5==
         ==VOLUME-CEILING==      BY ==1000==
         ==WKLD-CEILING==        BY ==500==
*------------MeasTCM Yosemite Change----Start-----------
* Soln 10-090630-2710 : start
*         ==NO-DISK-TYPES==       BY ==27==
*         ==MAX-DISK-TYPES==      BY ==32==
*         ==NO-CONTROLLER-TYPES== BY ==4==
* Soln 10-090630-2710 : end
          ==NO-DISK-TYPES==       BY ==95==
          ==MAX-DISK-TYPES==      BY ==100==
          ==NO-CONTROLLER-TYPES== BY ==5==
*------------MeasTCM Yosemite Change-----End------------
*        Make sure to update the next 2 lines together.  Add 5 to get line 2.
*          ==NO-PROCESSOR-TYPES==  BY ==24==
*          ==MAX-PROCESSOR-TYPES== BY ==29==
          ==NO-PROCESSOR-TYPES==  BY ==23==
          ==MAX-PROCESSOR-TYPES== BY ==28==
*------------MeasTCM Yosemite Change-----End------------
         ==NO-DEV-TYPE-ENTRIES== BY ==11==
         ==ENT-BUF-LEN==         BY ==50==
         ==IPM-NPV-VERSION==     BY =="ABC"==
         ==IPM-NPV-DATE==        BY =="29FEB12"==
         ==USEC-MINUTE==         BY ==60000000==
* SOLN 10-000602-8415. The constants below, are the number of valid CPU-types
* for each OS-type. The value is equal to the number of elements in that OS
* table. Make sure to add a constant when a new OS-type is supported and to
* increment the constant when a CPU-type is added to an existing OS-table.
*        ==CXX-CPU-NUM==         BY ==8==
*        ==DXX-CPU-NUM==         BY ==6==
*        ==D3X-CPU-NUM==         BY ==6==
*        ==D4X-CPU-NUM==         BY ==3==
         ==G-CPU-NUM==           BY ==2==
*        ==G06-CPU-NUM==        BY ==8==
         ==G06-CPU-NUM==         BY ==10==
*------------MeasTCM Yosemite Change----Start-----------
* Start of code change for Soln:10-100304-8526
*        ==H-CPU-NUM==         BY ==1==
*        ==H-CPU-NUM==         BY ==5==
         ==H-CPU-NUM==         BY ==8==
* End of code change for Soln:10-100304-8526
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for J-Series Blades
*         ==J-CPU-NUM==         BY ==1==
         ==J-CPU-NUM==         BY ==4==
* End of code change for J-Series Blades
* Start of code change for multiple TMF audit trails
         ==TRAIL-MIN==          BY ==1==
         ==TRAIL-MAX==          BY ==16==
* End of code change for multiple TMF audit trails
* Added for XP disk support.
        ==NO-XPDISK-TYPES==     BY ==2==
        ==MAX-XPDISK-TYPES==    BY ==7==
* SOLN 10-021028-2764. The constant below is added for MAX^T + 1
* which is a literal of Measure. The value of the below constant
* is to be checked and updated for new Measure releases.
         ==ENTITY-NUM==         BY ==25==.
*----------------------------------------------------------------------------
 FILE SECTION.
 FD CONTROL-FILE IS GLOBAL.
 01 CONTROL-FILE-RECORD                PIC X(80) GLOBAL.
 FD CSV-FILE IS GLOBAL.
*01 CSV-FILE-RECORD                    PIC X(116).
*01 CSV-FILE-RECORD                    PIC X(138).
*------------MeasTCM Yosemite Change----Start-----------
* Soln 10-030328-5170
*01 CSV-FILE-RECORD                    PIC X(172).
 01 CSV-FILE-RECORD                    PIC X(220) GLOBAL.
*------------MeasTCM Yosemite Change-----End------------
 FD SPOOLER-FILE IS GLOBAL
     LINAGE BODY FOOTING 56 TOP 3 BOTTOM 3.
 01 SPOOLER-FILE-RECORD                PIC X(80) GLOBAL.
 SD SORT-FILE.
 01 SORT-FILE-RECORD.
     05 SORT-WKLD-NAME                 PIC X(8).
     05 SORT-SYSTEM-NAME               PIC X(8).
     05 SORT-PROGRAM-FILE-NAME.
         10 SORT-VOLUME                PIC X(8).
         10 SORT-SUBVOLUME             PIC X(8).
         10 SORT-FILE-NAME             PIC X(8).
     05 SORT-PROCESS-NAME              PIC X(8).
     05 SORT-CPU-NUM                   NATIVE-2.
     05 SORT-PIN                       NATIVE-4.
     05 SORT-PIN-X                     REDEFINES SORT-PIN PIC X(2).
     05 SORT-CPU-BUSY-TIME             NATIVE-8.
     05 SORT-DELTA-TIME                NATIVE-8.
*----------------------------------------------------------------------------
 WORKING-STORAGE SECTION.
 01 CONTROL-FILE-FIELDS GLOBAL.
     05 CSVDATA                        PIC X(35) VALUE LOW-VALUES.
     05 CSVHI                          NATIVE-8 VALUE ZERO.
     05 CSVLO                          NATIVE-8 VALUE ZERO.
     05 INPUT-FIELDS.
* Soln 10-020415-8203
*        10 KEYWORD                    PIC X(9).
         10 KEYWORD                    PIC X(13).
         10 PARAMETER1                 PIC X(35) SYNC.
         10 PARAMETER2                 PIC X(35) SYNC.
         10 PARAMETER3                 PIC X(26).
         10 PARAMETER4                 PIC X(7).
         10 PARAMETER5                 PIC X(7).
         10 PARAMETER6                 PIC X(7).
     05 REPORT-LOCATION                PIC X(35).
* Soln 10-020415-8203 : start
 01 CASE-KEYWORD                       PIC X(13).
 77 SYSTEM-FOUND-FLAG                  PIC 9 COMP.
    88 SYSTEM-FOUND                    VALUE 1.
 01 CPU-TABLE-01.
     05 CPU-TABLE                      OCCURS 0 TO CPU-CEILING
                                       DEPENDING CPU-MAX
                                       ASCENDING CPU-NUM OF CPU-TABLE
                                       INDEXED CPU-INDEX CPU-INDEX-2.
         10 CPU-NUM                    NATIVE-2.
*Soln 10-020717-0465
*        10 CPU-POWER                  PIC S9(2)V9(2) COMP.
         10 CPU-POWER                  PIC S9(4)V9(2) COMP.
         10 CPU-IPUCOUNT               NATIVE-2.
         10 CPU-SYSTEM-NUMBER          NATIVE-2.
         10 CPU-LETTER                 PIC X.
 77 ERROR-86-NUM                       PIC 99.
 01 CPU-TYPE-POWER GLOBAL.
* Soln 10-020717-0465:    For every processor in CPU-TYPE-POWER-VALUES table,
*            C-series and D-series CPU factor size is changed to S9(4)V9(2).
     05 CPU-TYPE-POWER-VALUES.
*                                      S7000, Type 8,0.
         10 FILLER                     PIC X(8) VALUE "NSR-W".
         10 FILLER                     NATIVE-2 VALUE 8.
         10 FILLER                     NATIVE-2 VALUE 0.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 20.7.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 20.7.
*                                      S70000, Type 9,0.
         10 FILLER                     PIC X(8) VALUE "NSR-G".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 0.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 43.6.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 43.6.
* Gag IPM AAK                          S72000, Type 9,1.
         10 FILLER                     PIC X(8) VALUE "NSR-T".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 51.88.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 51.88.
* Soln 10-001227-8157                  S74000, Type 9,2.
         10 FILLER                     PIC X(8) VALUE "NSR-V".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 2.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 66.42.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 67.12.
* Soln 10-001227-8157                  S7400, Type 9,10.
         10 FILLER                     PIC X(8) VALUE "NSR-D".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 40.07.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 40.07.
* Soln 10-020717-0465: Added NSR-X     S76000, Type 9,3.
         10 FILLER                     PIC X(8) VALUE "NSR-X".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 3.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 99.46.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 106.12.
* Soln 10-020717-0465: Added NSR-Y     S86000, Type 9,4.
         10 FILLER                     PIC X(8) VALUE "NSR-Y".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 4.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 121.49.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 122.44.
* MeasTCM Yosemite Change: Added       NSE-A, Type 10,1.
         10 FILLER                     PIC X(8) VALUE "NSE-A".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 355.47.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 319.93.
* S88000, Type 9,5.
         10 FILLER                     PIC X(8) VALUE "NSR-Z".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 5.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 152.35.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 147.66.
* S78000, Type 9,13.
         10 FILLER                     PIC X(8) VALUE "NSR-H".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 13.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 113.58.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 113.58.
* Soln 10-060830-8685:Added NSE-D      NS14000, Type 10,2.
         10 FILLER                     PIC X(8) VALUE "NSE-D".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 2.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 278.20.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 259.40.
* Soln 10-080208-0419:Added NSE-Q      NS1200,  Type 10,91.
         10 FILLER                     PIC X(8) VALUE "NSE-Q".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 91.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 270.36.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 270.36.
* Soln 10-080208-0419:Added NSE-T      NS16200,  Type 10,83.
         10 FILLER                     PIC X(8) VALUE "NSE-T".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 83.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 417.30.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 383.91.
* Code change-start for CEP RFE:Added NSR-E    s76c,  Type 9,11.
         10 FILLER                     PIC X(8) VALUE "NSR-E".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 11.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 63.77.
* Added NSR-J    s78c,  Type 9,14.
         10 FILLER                     PIC X(8) VALUE "NSR-J".
         10 FILLER                     NATIVE-2 VALUE 9.
         10 FILLER                     NATIVE-2 VALUE 14.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 82.38.
* Added NSE-K    ,  Type 10,63.
         10 FILLER                     PIC X(8) VALUE "NSE-K".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 63.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 231.06.
* Added NSE-I    ,  Type 10,51.
         10 FILLER                     PIC X(8) VALUE "NSE-I".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 51.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 319.93.
* Added NSE-S    ns14.2K,  Type 10,82.
         10 FILLER                     PIC X(8) VALUE "NSE-S".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 82.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 299.93.
* Added NSE-B    ns1000,  Type 10,11.
         10 FILLER                     PIC X(8) VALUE "NSE-B".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 11.
         10 FILLER                     NATIVE-2 VALUE 1.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 242.98.
* Added NSE-W    NB54000,  Type 10,67.
         10 FILLER                     PIC X(8) VALUE "NSE-W".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 67.
         10 FILLER                     NATIVE-2 VALUE 2.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 533.21.
* Support for J-Series :Added NSE-M    NB50000,  Type 10,71.
         10 FILLER                     PIC X(8) VALUE "NSE-M".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 71.
         10 FILLER                     NATIVE-2 VALUE 2.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 685.56.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 685.56.
* Soln 10-100326-9111:Added NSE-AB    NB54000,  Type 10,112.
         10 FILLER                     PIC X(8) VALUE "NSE-AB".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 112.
         10 FILLER                     NATIVE-2 VALUE 4.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 1279.71.
*        10 FILLER                     PIC S9(4)V9(2) COMP VALUE 1279.71.
* Added NSE-AD    NB54000,  Type 10,100.
         10 FILLER                     PIC X(8) VALUE "NSE-AD".
         10 FILLER                     NATIVE-2 VALUE 10.
         10 FILLER                     NATIVE-2 VALUE 121.
         10 FILLER                     NATIVE-2 VALUE 2.
         10 FILLER                     PIC S9(4)V9(2) COMP VALUE 619.21.
* Code change-end for CEP RFE
* Gag IPM AAK                          EXTRA TYPES.
         10 EXTRA-TYPES                OCCURS 5 TIMES.
            15 FILLER                     PIC X(8) VALUE "      ".
            15 FILLER                     NATIVE-2 VALUE -1.
            15 FILLER                     NATIVE-2 VALUE -1.
            15 FILLER                     NATIVE-2 VALUE -1.
            15 FILLER                     PIC S9(4)V9(2) COMP VALUE 1.
*           15 FILLER                     PIC S9(4)V9(2) COMP VALUE 1.
        05 CPU-TYPE-POWER-TABLE           REDEFINES CPU-TYPE-POWER-VALUES
                                          OCCURS MAX-PROCESSOR-TYPES
                                          INDEXED CPU-TYPE-POWER-INDEX
                                          CPU-TYPE-POWER-CONVERTTO.
              10 CPU-TYPE-ALFA            PIC X(8).
         10 CPU-TYPE-SUBTYPE.
            15 CPU-TYPE-NUMBER         NATIVE-2.
            15 CPU-SUBTYPE-NUMBER      NATIVE-2.
            15 CPU-IPUCOUNT-NUMBER     NATIVE-2.
*Soln 10-020717-0465
*   10 CPU-POWER-VALUE-CNN        PIC S9(2)V9(2) COMP.
*   10 CPU-POWER-VALUE-DNN        PIC S9(2)V9(2) COMP.
*   10 CPU-POWER-VALUE-CNN        PIC S9(4)V9(2) COMP.
*   10 CPU-POWER-VALUE-DNN        PIC S9(4)V9(2) COMP.
    10 CPU-POWER-VALUE-GNN        PIC S9(4)V9(2) COMP.
 77 CPU-POWER-VALUE                    PIC S9(4)V9(2) COMP VALUE 0001.00.
 77 CONVERTTO-IPU-VALUE                PIC 99 VALUE 1.
 01 CPU-POWER-SEARCH-KEY.
    03  CPU-POWER-SEARCH-TYPE          NATIVE-2.
    03  CPU-POWER-SEARCH-SUBTYPE       NATIVE-2.
    03  CPU-POWER-SEARCH-IPUCOUNT      NATIVE-2 VALUE 1.
* Soln 10-020415-8203 :start
 01 CONTROLLER-TYPE-POWER GLOBAL.
        05 CONTROLLER-TYPE-POWER-VALUES.
             10 FILLER                     PIC X(4) VALUE "EXT".
             10 FILLER                     PIC S9(2)V9(2) COMP VALUE 00.87.
             10 FILLER                     PIC X(4) VALUE "MFC".
             10 FILLER                     PIC S9(2)V9(2) COMP VALUE 00.56.
             10 FILLER                     PIC X(4) VALUE "SNET".
             10 FILLER                     PIC S9(2)V9(2) COMP VALUE 01.00.
* MeasTCM Yosemite Change: Added Fibre Channel ServerNet Adapter(FCSA).
             10 FILLER                     PIC X(4) VALUE "FCSA".
             10 FILLER                     PIC S9(2)V9(2) COMP VALUE 01.00.
* CEP RFE Change: Added CLIM (Cluster I/O Module) Adapter.
            10 FILLER                     PIC X(4) VALUE "CLIM".
            10 FILLER                     PIC S9(2)V9(2) COMP VALUE 00.93.
        05 CONTROLLER-TYPE-POWER-TABLE   REDEFINES CONTROLLER-TYPE-POWER-VALUES
                                         OCCURS NO-CONTROLLER-TYPES
                                         INDEXED CNT-TYPE-POWER-INDEX.
             10 CNT-TYPE-ALFA              PIC X(4).
             10 CNT-POWER                  PIC S9(2)V9(2) COMP.
* MeasTCM Yosemite Change : Size of DISK-TYPE-ALFA changed from 5 to 10.
 01 DISK-TYPE-POWER GLOBAL.
      05 DISK-TYPE-POWER-VALUES.
          10 FILLER                    PIC X(16) VALUE "4160".
          10 FILLER                    NATIVE-2 VALUE 16.
          10 FILLER                    PIC S9(5) COMP VALUE 3600.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 3.8.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 3.8.
          10 FILLER                    PIC X(16) VALUE "4170".
          10 FILLER                    NATIVE-2 VALUE 18.
          10 FILLER                    PIC S9(5) COMP VALUE 3600.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4230".
          10 FILLER                    NATIVE-2 VALUE 21.
          10 FILLER                    PIC S9(5) COMP VALUE 3600.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4240".
          10 FILLER                    NATIVE-2 VALUE 23.
          10 FILLER                    PIC S9(5) COMP VALUE 3600.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4250".
          10 FILLER                    NATIVE-2 VALUE 29.
          10 FILLER                    PIC S9(5) COMP VALUE 5400.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4255".
          10 FILLER                    NATIVE-2 VALUE 34.
          10 FILLER                    PIC S9(5) COMP VALUE 5400.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4260".
          10 FILLER                    NATIVE-2 VALUE 30.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4265".
          10 FILLER                    NATIVE-2 VALUE 35.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "MFC".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4330".
          10 FILLER                    NATIVE-2 VALUE 26.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4500".
          10 FILLER                    NATIVE-2 VALUE 22.
          10 FILLER                    PIC S9(5) COMP VALUE 3600.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4510".
          10 FILLER                    NATIVE-2 VALUE 31.
          10 FILLER                    PIC S9(5) COMP VALUE 5400.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4560".
          10 FILLER                    NATIVE-2 VALUE 38.
          10 FILLER                    PIC S9(5) COMP VALUE 5400.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4570".
          10 FILLER                    NATIVE-2 VALUE 39.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4580".
          10 FILLER                    NATIVE-2 VALUE 20.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4590".
          10 FILLER                    NATIVE-2 VALUE 48.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "EXT".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4604".
          10 FILLER                    NATIVE-2 VALUE 41.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4608".
          10 FILLER                    NATIVE-2 VALUE 42.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4609".
          10 FILLER                    NATIVE-2 VALUE 42.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4618".
          10 FILLER                    NATIVE-2 VALUE 43.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4619".
          10 FILLER                    NATIVE-2 VALUE 43.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4636".
          10 FILLER                    NATIVE-2 VALUE 44.
          10 FILLER                    PIC S9(5) COMP VALUE 7200.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4637".
          10 FILLER                    NATIVE-2 VALUE 44.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4638".
          10 FILLER                    NATIVE-2 VALUE 44.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC X(16) VALUE "4672".
          10 FILLER                    NATIVE-2 VALUE 45.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-020415-9325 Change: Added 46144 Disk.
          10 FILLER                    PIC X(16) VALUE "46144".
          10 FILLER                    NATIVE-2 VALUE 46.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "SNET".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* MeasTCM Yosemite Change: Added JBOD Disk (BF07255B2C).
          10 FILLER                    PIC X(16) VALUE "BF07255B2C".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* MeasTCM Yosemite Change: Added JBOD Disk (BF0725754B).
          10 FILLER                    PIC X(16) VALUE "BF0725754B".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* MeasTCM Yosemite Change: Added JBOD Disk (BF07258243).
          10 FILLER                    PIC X(16) VALUE "BF07258243".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* MeasTCM Yosemite Change: Added JBOD Disk (BF14658244).
          10 FILLER                    PIC X(16) VALUE "BF14658244".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF0725A476).
          10 FILLER                    PIC X(16) VALUE "BF0725A476".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF1465A477).
          10 FILLER                    PIC X(16) VALUE "BF1465A477".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF3005A478).
          10 FILLER                    PIC X(16) VALUE "BF3005A478".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF072D6186).
          10 FILLER                    PIC X(16) VALUE "BF072D6186".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF146DA47C).
          10 FILLER                    PIC X(16) VALUE "BF146DA47C".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF300DA482).
          10 FILLER                    PIC X(16) VALUE "BF300DA482".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF450DA483).
          10 FILLER                    PIC X(16) VALUE "BF450DA483".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF072DAJZN).
          10 FILLER                    PIC X(16) VALUE "BF072DAJZN".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF146DAJZP).
          10 FILLER                    PIC X(16) VALUE "BF146DAJZP".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF300DAJZQ).
          10 FILLER                    PIC X(16) VALUE "BF300DAJZQ".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF450DAJZR).
          10 FILLER                    PIC X(16) VALUE "BF450DAJZR".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF600DAJZT).
          10 FILLER                    PIC X(16) VALUE "BF600DAJZT".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF036574C9).
          10 FILLER                    PIC X(16) VALUE "BF036574C9".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF07258222).
          10 FILLER                    PIC X(16) VALUE "BF07258222".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF14658227).
          10 FILLER                    PIC X(16) VALUE "BF14658227".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF0725A692).
          10 FILLER                    PIC X(16) VALUE "BF0725A692".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF1465A693).
          10 FILLER                    PIC X(16) VALUE "BF1465A693".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF146DA47A).
          10 FILLER                    PIC X(16) VALUE "BF146DA47A".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF300DA47B).
          10 FILLER                    PIC X(16) VALUE "BF300DA47B".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF300D6188).
          10 FILLER                    PIC X(16) VALUE "BF300D6188".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF450D6189).
          10 FILLER                    PIC X(16) VALUE "BF450D6189".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF300DASTH).
          10 FILLER                    PIC X(16) VALUE "BF300DASTH".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF450DASTK).
          10 FILLER                    PIC X(16) VALUE "BF450DASTK".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Soln 10-090630-2710 Change: Added JBOD Disk (BF600DASTL).
          10 FILLER                    PIC X(16) VALUE "BF600DASTL".
          10 FILLER                    NATIVE-2 VALUE 53.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "FCSA".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.80.
* Start of code change for CEP RFE: Added SAS Disk (DG072BB975).
          10 FILLER                    PIC X(16) VALUE "DG072BB975".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG146BB976).
          10 FILLER                    PIC X(16) VALUE "DG146BB976".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DH072BB978).
          10 FILLER                    PIC X(16) VALUE "DH072BB978".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DG0146BAHZP).
          10 FILLER                    PIC X(16) VALUE "DG0146BAHZP".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300BAHZQ).
          10 FILLER                    PIC X(16) VALUE "DG0300BAHZQ".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0146BALVN).
          10 FILLER                    PIC X(16) VALUE "DG0146BALVN".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300BALVP).
          10 FILLER                    PIC X(16) VALUE "DG0300BALVP".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0146FAMWL).
          10 FILLER                    PIC X(16) VALUE "DG0146FAMWL".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0146FAWHU).
          10 FILLER                    PIC X(16) VALUE "EG0146FAWHU".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300FAMWN).
          10 FILLER                    PIC X(16) VALUE "DG0300FAMWN".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0300FAWHV).
          10 FILLER                    PIC X(16) VALUE "EG0300FAWHV".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DH0072BALWL).
          10 FILLER                    PIC X(16) VALUE "DH0072BALWL".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DH0146BALWN).
          10 FILLER                    PIC X(16) VALUE "DG072BB975".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DH0072FAQRD).
          10 FILLER                    PIC X(16) VALUE "DH0072FAQRD".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EH0072FAWJA).
          10 FILLER                    PIC X(16) VALUE "EH0072FAWJA".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DH0146FAQRE).
          10 FILLER                    PIC X(16) VALUE "DH0146FAQRE".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EH0146FAWJB).
          10 FILLER                    PIC X(16) VALUE "EH0146FAWJB".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DG072BAAJA).
          10 FILLER                    PIC X(16) VALUE "DG072BAAJA".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG146BAAJB).
          10 FILLER                    PIC X(16) VALUE "DG146BAAJB".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0146BAMYQ).
          10 FILLER                    PIC X(16) VALUE "DG0146BAMYQ".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300BAMYR).
          10 FILLER                    PIC X(16) VALUE "DG0300BAMYR".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0146FARVU).
          10 FILLER                    PIC X(16) VALUE "DG0146FARVU".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300FARVV).
          10 FILLER                    PIC X(16) VALUE "DG0300FARVV".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0146FAWJC).
          10 FILLER                    PIC X(16) VALUE "EG0146FAWJC".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0300FAWJD).
          10 FILLER                    PIC X(16) VALUE "EG0300FAWJD".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EH0072FARWC).
          10 FILLER                    PIC X(16) VALUE "EH0072FARWC".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EH0146FARWD).
          10 FILLER                    PIC X(16) VALUE "EH0146FARWD".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EG0300FBDBR).
          10 FILLER                    PIC X(16) VALUE "EG0300FBDBR".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0600FBDBU).
          10 FILLER                    PIC X(16) VALUE "EG0600FBDBU".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DH072BAAKN).
          10 FILLER                    PIC X(16) VALUE "DH072BAAKN".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (DG072BABCE).
          10 FILLER                    PIC X(16) VALUE "DG072BABCE".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG146BABCF).
          10 FILLER                    PIC X(16) VALUE "DG146BABCF".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0146BARTP).
          10 FILLER                    PIC X(16) VALUE "DG0146BARTP".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (DG0300BARTQ).
          10 FILLER                    PIC X(16) VALUE "DG0300BARTQ".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0146FARTR).
          10 FILLER                    PIC X(16) VALUE "EG0146FARTR".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0300FARTT).
          10 FILLER                    PIC X(16) VALUE "EG0300FARTT".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EH0072FARUA).
          10 FILLER                    PIC X(16) VALUE "EH0072FARUA".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EH0146FARUB).
          10 FILLER                    PIC X(16) VALUE "EH0146FARUB".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added SAS Disk (EG0300FBDSP).
          10 FILLER                    PIC X(16) VALUE "EG0300FBDSP".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added SAS Disk (EG0600FBDSR).
          10 FILLER                    PIC X(16) VALUE "EG0600FBDSR".
          10 FILLER                    NATIVE-2 VALUE 51.
          10 FILLER                    PIC S9(5) COMP VALUE 10000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.00.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 04.40.
* Added XP disk XP24KRG5A (XP24K, RAID5 (3D+1P))
          10 FILLER                    PIC X(16) VALUE "XP24KRG5A".
          10 FILLER                    NATIVE-2 VALUE 52.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
* Added XP disk XP24KRG5B (XP24K, RAID5 (7D+1P))
          10 FILLER                    PIC X(16) VALUE "XP24KRG5B".
          10 FILLER                    NATIVE-2 VALUE 52.
          10 FILLER                    PIC S9(5) COMP VALUE 15000.
          10 FILLER                    PIC X(4) VALUE "CLIM".
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 02.58.
          10 FILLER                    PIC S9(2)V9(2) COMP VALUE 03.01.
*End of code change for CEP RFE.
         10 EXTRA-TYPES                OCCURS 5 TIMES.
             15 FILLER                     PIC X(16) VALUE "      ".
             15 FILLER                     NATIVE-2 VALUE -1.
             15 FILLER                     PIC S9(5) COMP.
             15 FILLER                     PIC X(4) VALUE "    ".
             15 FILLER                     PIC S9(2)V9(2) COMP VALUE 01.00.
             15 FILLER                     PIC S9(2)V9(2) COMP VALUE 01.00.
* MeasTCM Yosemite Change : Size of DISK-TYPE-ALFA changed from 5 to 10.
   05 DISK-TYPE-POWER-TABLE          REDEFINES DISK-TYPE-POWER-VALUES
                                     OCCURS MAX-DISK-TYPES
                                     INDEXED DISK-SUBTYPE-INDEX
                                      DISK-TYPE-POWER-CONVERTTO.
           10 DISK-TYPE-ALFA             PIC X(16).
           10 DISK-SUBTYPE-NUMBER        NATIVE-2.
           10 DISK-RPM                   PIC S9(5) COMP.
           10 DISK-CONTROLLER            PIC X(4).
           10 DISK-READSEEK            PIC S9(2)V9(2) COMP.
           10 DISK-WRITESEEK           PIC S9(2)V9(2) COMP.
 01 DISKTO-CNT-VALUE                   PIC X(4) GLOBAL VALUE "    ".
 01 ACTUAL-DISK-CNT                    PIC X(4) GLOBAL VALUE "    ".
 01 DISKTO-RPM-VALUE                   PIC S9(5) GLOBAL COMP.
 01 ACTUAL-DISK-RPM                    PIC S9(5) GLOBAL COMP.
 01 DISK-RPM-RATIO                     PIC S9(5)V9(2) GLOBAL COMP.
 01 DISKTO-CNT-POWER-VALUE             PIC S9(2)V9(2) GLOBAL COMP.
 01 ACTUAL-CNT-POWER-VALUE             PIC S9(2)V9(2) GLOBAL COMP.
 01 DISK-CNT-POWER-RATIO               PIC S9(2)V9(2) GLOBAL COMP.
* Below line removed as part of CEP RFE.
* 77 DISK-POWER-VALUE                   PIC S9(9)V9(2) GLOBAL VALUE 000000000.00.
 01 DISK-SUBTYPE-SEARCH-KEY            NATIVE-2 GLOBAL.
* MeasTCM Yosemite Change : Size of ACTUAL-DISK-MODEL-NAME &
* DISKTO-DISK-MODEL-NAME changed from 5 to 10.
 01 ACTUAL-DISK-MODEL-NAME             PIC X(16) GLOBAL.
 01 DISKTO-DISK-MODEL-NAME             PIC X(16) GLOBAL.
* Start of code change for CEP RFE.
  01 DISKTO-READ-SEEK-VALUE            PIC S9(2)V9(2) GLOBAL.
  01 DISKTO-WRITE-SEEK-VALUE           PIC S9(2)V9(2) GLOBAL.
  01 ACTUAL-READ-SEEK-VALUE            PIC S9(2)V9(2) GLOBAL.
  01 ACTUAL-WRITE-SEEK-VALUE           PIC S9(2)V9(2) GLOBAL.
  01 DISK-READSEEK-RATIO               PIC S9(5)V9(2) GLOBAL.
  01 DISK-WRITESEEK-RATIO              PIC S9(5)V9(2) GLOBAL.
  01 DISK-READPOWER-VALUE              PIC S9(9)V9(2) GLOBAL VALUE 000000000.00.
  01 DISK-WRITEPOWER-VALUE             PIC S9(9)V9(2) GLOBAL VALUE 000000000.00.
  01 XPDISK-POWER-VALUE                PIC S9(9)V9(2) GLOBAL VALUE 000000000.00.
  01 XPDISK-POWER-TYPE-MAX             NATIVE-2 VALUE NO-XPDISK-TYPES.
  77 WCE-STATUS                         PIC X(3).
     88 VALID-WCE-STATUS                VALUES  "ON" "on" "OFF" "off".
  01 ACTUAL-DISK-WCE                   PIC X(3) GLOBAL VALUE "OFF".
  01 DISKTO-DISK-WCE                   PIC X(3) GLOBAL VALUE "OFF".
* XP diskfactor table added for XP disk (subtype =52) support
 01 XPDISK-POWER GLOBAL.
      05 XPDISK-POWER-VALUES.
           10 FILLER                    PIC X(16) VALUE "XP24KRG5A".
           10 FILLER                    PIC S9(2)V9(2) COMP VALUE 00.59.
           10 FILLER                    PIC X(16) VALUE "XP24KRG5B".
           10 FILLER                    PIC S9(2)V9(2) COMP VALUE 00.40.
           10 EXTRA-TYPES               OCCURS 5 TIMES.
               15 FILLER                PIC X(16) VALUE "      ".
               15 FILLER                PIC S9(2)V9(2) COMP VALUE 01.00.
     05 XPDISK-POWER-TABLE           REDEFINES XPDISK-POWER-VALUES
                                     OCCURS MAX-XPDISK-TYPES
                                     INDEXED XPDISK-TYPE-INDEX.
           10 XPDISK-TYPE-ALFA          PIC X(16).
           10 XPDISK-FACTOR             PIC S9(2)V9(2) COMP.
* End of  code change for CEP RFE.
* Soln 10-020415-8203 :end
* J-Series Blades Change: "J" "j" Guardian-Type added.
* MeasTCM Yosemite Change: "H" "h" Guardian-Type added.
 77 GUARDIAN-TYPE                      PIC X.
*    88 VALID-GUARDIAN-TYPE    VALUES "C" "c" "D" "d" "G" "g" "H" "h" "J" "j".
    88 VALID-GUARDIAN-TYPE    VALUES "G" "g" "H" "h" "J" "j".
* Soln 10-000602-8415. Table of CPU-types compatible with G02, G03 and G05 NSK.
  01 G-CPUS.
    05  G-CPU-NAMES.
        10 FILLER                     PIC X(8) VALUE "NSR-W".
        10 FILLER                     PIC X(8) VALUE "NSR-G".
    05 G-CPU-TYPE-TABLE             REDEFINES G-CPU-NAMES
                                        OCCURS  G-CPU-NUM
                                        INDEXED G-INDEX.
          10 G-CPU-TYPE               PIC X(8).
* Soln 10-000602-8415. Table of CPU-types compatible with G06 NSK.
  01 G06-CPUS.
    05  G06-CPU-NAMES.
        10 FILLER                     PIC X(8) VALUE "NSR-G".
        10 FILLER                     PIC X(8) VALUE "NSR-T".
        10 FILLER                     PIC X(8) VALUE "NSR-V".
        10 FILLER                     PIC X(8) VALUE "NSR-D".
* Soln 10-020717-0465
        10 FILLER                     PIC X(8) VALUE "NSR-X".
* Soln 10-020717-0465
        10 FILLER                     PIC X(8) VALUE "NSR-Y".
        10 FILLER                     PIC X(8) VALUE "NSR-H".
        10 FILLER                     PIC X(8) VALUE "NSR-Z".
        10 FILLER                     PIC X(8) VALUE "NSR-E".
        10 FILLER                     PIC X(8) VALUE "NSR-J".
    05 G06-CPU-TYPE-TABLE             REDEFINES G06-CPU-NAMES
                                        OCCURS  G06-CPU-NUM
                                        INDEXED G06-INDEX.
          10 G06-CPU-TYPE               PIC X(8).
*------------MeasTCM Yosemite Change----Start-----------
* Table of CPU-types compatible with H01 NSK.
* Added NSE-T, NSE-Q type of CPUs for Soln:10-100304-8526
  01 H-CPUS.
    05  H-CPU-NAMES.
        10 FILLER                     PIC X(8) VALUE "NSE-T".
        10 FILLER                     PIC X(8) VALUE "NSE-Q".
        10 FILLER                     PIC X(8) VALUE "NSE-A".
        10 FILLER                     PIC X(8) VALUE "NSE-D".
*       10 FILLER                     PIC X(8) VALUE "NSE-P".
        10 FILLER                     PIC X(8) VALUE "NSE-K".
        10 FILLER                     PIC X(8) VALUE "NSE-I".
        10 FILLER                     PIC X(8) VALUE "NSE-S".
        10 FILLER                     PIC X(8) VALUE "NSE-B".
    05 H-CPU-TYPE-TABLE               REDEFINES H-CPU-NAMES
                                        OCCURS  H-CPU-NUM
                                        INDEXED H-INDEX.
          10 H-CPU-TYPE               PIC X(8).
*------------MeasTCM Yosemite Change----End-------------
* Start of code change for J-Series Blades
* Table of CPU-types compatible with J06 NSK.
* Added NSE-M type of CPU for J-Series Blades
  01 J-CPUS.
    05  J-CPU-NAMES.
        10 FILLER                     PIC X(8) VALUE "NSE-M".
        10 FILLER                     PIC X(8) VALUE "NSE-AB".
        10 FILLER                     PIC X(8) VALUE "NSE-W".
        10 FILLER                     PIC X(8) VALUE "NSE-AD".
    05 J-CPU-TYPE-TABLE               REDEFINES J-CPU-NAMES
                                        OCCURS  J-CPU-NUM
                                        INDEXED J-INDEX.
          10 J-CPU-TYPE               PIC X(8).
* End of code change for J-Series Blades
 01 CSV-C-BINARY.
     05 C02                            NATIVE-8 VALUE ZERO.
     05 C03                            NATIVE-8 VALUE ZERO.
 01 CSV-C-DATA.
     05 FILLER                         PIC X VALUE ",".
* CPU interrupt seconds
     05 C02                            PIC 9(8).9(3).
     05 FILLER                         PIC X VALUE ",".
* CPU process-overhead seconds
     05 C03                            PIC 9(8).9(3).
 01 CSV-D-DATA.
* MeasTCM Yosemite Change : Size of D03 changed from 5 to 10.
* Soln 10-020415-8203 : start :count should be increased, hence csv file width
* Disc volume count
     05 D01                            PIC 9(5).
     05 FILLER                         PIC X VALUE ",".
* Disc device count
     05 D02                            PIC 9(5).
* Disc Model Name
     05 FILLER                         PIC X VALUE ",".
     05 D03                            PIC 9(16).
* Soln 10-020415-8203 : end
* Below 2 lines added CEP RFE
* Disc WCE Status
     05 FILLER                         PIC X VALUE ",".
     05 D04                            PIC X(3).
* Disc TMF trail count
     05 FILLER                         PIC X VALUE ",".
     05 D05                            PIC 9(2).
 01 CSV-F-COMP.
     05 F03                            PIC S9(3)V9(3) COMP VALUE ZERO.
 01 CSV-I-HEADER.
     05 FILLER                         PIC X(8) VALUE "NodeName".
 01 CSV-F-DATA.
* Output CPU type
     05 F01                            PIC X(8).
     05 FILLER                         PIC X VALUE ",".
* Physical CPU count
     05 F02                            PIC 9(3) VALUE ZERO.
     05 FILLER                         PIC X VALUE ",".
* Logical CPU count
     05 F03                            PIC 9(3).9(3).
     05 FILLER                         PIC X VALUE ",".
* IPU Count for J-series system
     05 F04                            PIC X(2).
 01 CSV-I-DATA.
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
* Application name
     05 i03                            PIC X(20) VALUE LOW-VALUES.
     05 FILLER                         PIC X VALUE ",".
* From date (MM/DD/YYYY)
     05 I04.
         10 MONTH                      PIC 9(2).
         10 FILLER                     PIC X VALUE "/".
         10 DDAY                       PIC 9(2).
         10 FILLER                     PIC X VALUE "/".
         10 YEAR                       PIC 9(4).
     05 FILLER                         PIC X VALUE ",".
* From time (HH:MM:SS)
     05 I05.
         10 HOURS                      PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 MINUTES                    PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 SECONDS                    PIC 9(2).
     05 FILLER                         PIC X VALUE ",".
* To date (MM/DD/YYYY)
     05 I06.
         10 MONTH                      PIC 9(2).
         10 FILLER                     PIC X VALUE "/".
         10 DDAY                       PIC 9(2).
         10 FILLER                     PIC X VALUE "/".
         10 YEAR                       PIC 9(4).
     05 FILLER                         PIC X VALUE ",".
* To time (HH:MM:SS)
     05 I07.
         10 HOURS                      PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 MINUTES                    PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 SECONDS                    PIC 9(2).
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
* Measurement data file version
     05 I10.
         10 VERSION-LETTER             PIC X.
         10 VERSION-NUMBER             PIC X(2) JUST.
     05 FILLER                         PIC X VALUE ",".
* MEASTCM version
     05 I11                            PIC X(3).
     05 FILLER                         PIC X VALUE ",".
* MEASTCM vproc
* >>>>> Version dependent field <<<<<
     05 I12                            PIC X(42) VALUE
*        "_VPROC:T6042D20^01JUN93^MEASTCMD20:VPROC_".
*        "_VPROC:T6042D20^15OCT93^MEASTCMD20:VPROC_".
*        "_VPROC:T6042D20^17DEC93^MEASTCM^AAC:VPROC_".
*        "_VPROC:T6042D20^15AUG94^MEASTCM^AAD:VPROC_".
*        "_VPROC:T6042D20^12SEP94^MEASTCM^AAE:VPROC_".
*        "_VPROC:T6042D20^24FEB95^MEASTCM^AAF:VPROC_".
*        "_VPROC:T6042D20^09OCT95^MEASTCM^AAG:VPROC_".
*        "_VPROC:T6042D20^20DEC95^MEASTCM^AAH:VPROC_".
*        "_VPROC:T6042D40^15APR96^MEASTCM:VPROC_".
*        "_VPROC:T6042D40^21OCT96^MEASTCM^AAH:VPROC_".
*        "_VPROC:T6042D40^29APR97^MEASTCM^AAI:VPROC_".
*        "_VPROC:T6042D40^21AUG98^MEASTCM^AAJ:VPROC_".
*        "_VPROC:T6042D40^09AUG99^MEASTCM^AAK:VPROC_".
*        "_VPROC:T6042D40^15NOV01^MEASTCM^AAL:VPROC_".
*        "_VPROC:T6042D40^10JAN03^MEASTCM^AAM:VPROC_".
*        "_VPROC:T6042D40^25JUL03^MEASTCM^AAN:VPROC_".
*        "_VPROC:T6042D40^21NOV03^MEASTCM^AAO:VPROC_".
*        "_VPROC:T6042D40^09JUL04^MEASTCM^AAP:VPROC_".
*        "_VPROC:T6042H01^01MAY05^MEASTCM:VPROC_".
*        "_VPROC:T6042H01^01MAY06^MEASTCM^AAQ:VPROC_".
*        "_VPROC:T6042H01^24MAY06^MEASTCM^AAR:VPROC_".
*        "_VPROC:T6042H01^25OCT06^MEASTCM^AAS:VPROC_".
*        "_VPROC:T6042H01^02JAN07^MEASTCM^AAU:VPROC_".
*        "_VPROC:T6042H01^02MAY08^MEASTCM^AAW:VPROC_".
*        "_VPROC:T6042H01^19APR10^MEASTCM^AAZ:VPROC_".
*        "_VPROC:T6042H01^30AUG10^MEASTCM^ABA:VPROC_".
         "_VPROC:T6042H01^29FEB12^MEASTCM^ABC:VPROC_".
*   GAG IPM AAK.    New Volume line.
 01 CSV-V-DATA.
     05 FILLER                         PIC X(8) VALUE "DiskType".
     05 CSV-V-TYPE-ENTRIES             OCCURS NO-DEV-TYPE-ENTRIES TIMES.
        10 V01-COMMA1                  PIC X.
        10 V02-SUBTYPE                 PIC 9(4).
        10 V03-COMMA2                  PIC X.
        10 V04-COUNT                   PIC 9(5).
 01 CSV-T-HEADER.
     05 FILLER                         PIC X(7) VALUE "TxnName".
 01 CSV-T-DATA.
* Transaction name
     05 T01                            PIC X(20).
     05 FILLER                         PIC X VALUE ",".
* Transaction type
     05 T02                            PIC X.
 01 CSV-W-DATA.
* MeasTCM Yosemite Change: Size of W03,W04,W05,W06,W07 & W21 is changed.
* MeasTCM Yosemite Change: W03-19, W04-19, W06-19, W07-19 Added to Store
*                          the 19th most significant digit, if any.
* Soln 10-030328-5170: Size of W03,W04,W06,W07,W08,W09,W13 and W14 is changed.
* This is the longest CSV record (215 bytes)
* W01    Process category name
* W02    Process category type
* W03-19 Stores the 19th most significant digit of W03 OF CSV-W-BINARY, if any.
* W03    Process category messages received
* W04-19 Stores the 19th most significant digit of W04 OF CSV-W-BINARY, if any.
* W04    Process category messages sent
* W05    Process category CPU busy seconds
* W06-19 Stores the 19th most significant digit of W06 OF CSV-W-BINARY, if any.
* W06    Process category cache hits
* W07-19 Stores the 19th most significant digit of W07 OF CSV-W-BINARY, if any.
* W07    Process category cache misses
* W08    Process category physical disc READ (including SEEK) seconds
* W09    Process category physical disc WRITE (including SEEK) seconds
* W13    Process category physical disc READs
* W14    Process category physical disc WRITEs
* W21    Process category weighted average priority
* W22    Process category TNSR CPU(NATIVE-BUSY-TIME in YOSEMITE) busy seconds
* W23    Process category ACCEL CPU busy seconds
     05 W01                            PIC X(8).
     05 FILLER                         PIC X VALUE ",".
     05 W02                            PIC X.
     05 FILLER                         PIC X VALUE ",".
     05 W03-19                         PIC 9(1) VALUE 0.
     05 W03                            PIC 9(18).
     05 FILLER                         PIC X VALUE ",".
     05 W04-19                         PIC 9(1) VALUE 0.
     05 W04                            PIC 9(18).
     05 FILLER                         PIC X VALUE ",".
     05 W05                            PIC 9(14).9(4).
     05 FILLER                         PIC X VALUE ",".
     05 W06-19                         PIC 9(1) VALUE 0.
     05 W06                            PIC 9(18).
     05 FILLER                         PIC X VALUE ",".
     05 W07-19                         PIC 9(1) VALUE 0.
     05 W07                            PIC 9(18).
     05 FILLER                         PIC X VALUE ",".
     05 W08                            PIC 9(15).9(3).
     05 FILLER                         PIC X VALUE ",".
     05 W09                            PIC 9(15).9(3).
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 W13                            PIC 9(15).
     05 FILLER                         PIC X VALUE ",".
     05 W14                            PIC 9(15).
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 FILLER                         PIC X VALUE ",".
     05 W21                            PIC 9(6).
     05 FILLER                         PIC X VALUE ",".
     05 W22                            PIC 9(6).9(3).
     05 W22-NULL REDEFINES W22         PIC X(8).
     05 FILLER                         PIC X VALUE ",".
     05 W23                            PIC 9(6).9(3).
     05 W23-NULL REDEFINES W23         PIC X(8).
 77 RISC-DATA-PRESENT-FLAG             PIC 9 COMP VALUE ZERO.
    88 RISC-DATA-PRESENT               VALUE 1.
 01 CSV-W-HEADER GLOBAL.
     05 FILLER                         PIC X(7) VALUE "CatName".
 01 DEPENDING-VARIABLES GLOBAL.
     05 CPU-MAX                        NATIVE-2.
     05 CPU-POWER-TYPE-MAX             NATIVE-2 VALUE NO-PROCESSOR-TYPES.
     05 MEASURE-MAX                    NATIVE-2 VALUE ZERO.
     05 PROCESS-MAX                    NATIVE-4.
     05 SYSTEM-MAX                     NATIVE-2 VALUE ZERO.
     05 TITLE-MAX                      NATIVE-2 VALUE ZERO.
     05 TXN-MAX                        NATIVE-2 VALUE ZERO.
     05 VERSION-MAX                    NATIVE-2 VALUE ZERO.
     05 VOLUME-MAX                     NATIVE-2 VALUE ZERO.
     05 WKLD-MAX                       NATIVE-2 VALUE ZERO.
* Soln 10-020415-8203 :start
     05 DISK-POWER-TYPE-MAX             NATIVE-2 VALUE NO-DISK-TYPES.
* Soln 10-020415-8203 : end
 01 DESCRIPTORS GLOBAL.
     05 ALL-CPUS.
* Using MEASDECS template CPU^DESC
         10 FILLER                     PIC S9(4) COMP VALUE 1.
         10 FILLER                     PIC S9(4) COMP VALUE 6.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
     05 ALL-DISCS.
* Using MEASDECS template DEVICE^DESC
         10 FILLER                     PIC S9(4) COMP VALUE 7.
         10 FILLER                     PIC S9(4) COMP VALUE 36.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC X(24) VALUE "$*".
         10 FILLER                     PIC S9(4) COMP VALUE -1.
     05 ALL-PROCESSES.
* Using MEASDECS template PROCESS^DESC
         10 FILLER                     PIC S9(4) COMP VALUE 2.
         10 FILLER                     PIC S9(4) COMP VALUE 40.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC X(8) VALUE "$*".
         10 FILLER                     PIC X(24) VALUE "$*      *       *".
     05 ALL-DISCOPENS.
* Using MEASDECS template FILE^OPEN^DESC
         10 FILLER                     PIC S9(4) COMP VALUE 6.
         10 FILLER                     PIC S9(4) COMP VALUE 46.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILE-NAME                  PIC X(24) VALUE "$*      *       *".
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC S9(4) COMP VALUE -1.
         10 FILLER                     PIC X(8) VALUE "\*".
 01 ENTITY-LENGTH-BUFFER GLOBAL.
     05 ENTITY-LENGTH-FILLER           PIC X(ENT-BUF-LEN).
     05 ENTITY-LENGTHS REDEFINES ENTITY-LENGTH-FILLER.
        10 FILLER                         PIC S9(4) COMP.
        10 CPU-ENTITY-LENGTH              PIC S9(4) COMP.
        10 PROCESS-ENTITY-LENGTH          PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 DISCOPEN-ENTITY-LENGTH         PIC S9(4) COMP.
        10 DISC-ENTITY-LENGTH             PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
        10 FILLER                         PIC S9(4) COMP.
 01 MEASURE-TABLE-01 GLOBAL.
     05 MEASURE-TABLE                  OCCURS 0 TO MEASURE-CEILING
                                       DEPENDING MEASURE-MAX
                                       INDEXED MEASURE-INDEX, MEASURE-INDEX-2.
         10 MEASURE-START              NATIVE-8.
         10 MEASURE-STOP               NATIVE-8.
         10 MEASURE-INT                NATIVE-8.
         10 MEASURE-DATAFILE           PIC X(24).
         10 MEASURE-EXTERNAL-NAME      PIC X(36).
         10 MEASURE-DFNUM              PIC S9(4) COMP.
         10 MEASURE-MEASFH             PIC X(24).
         10 MEASURE-SYSTEM-NUMBER      NATIVE-2.
         10 MEASURE-VALID-FILE         PIC X(01).
 01 MESSAGES-TABLE GLOBAL.
     COPY COMPLETION-MESSAGES.
     COPY INFO-MESSAGES.
 01 MISCELLANEOUS GLOBAL.
     05 ABEND-OR-STOP                  PIC S9(4) COMP.
*    GAG  IPM AAJ.  21AUG98.    New definiton for CURRENT-DATE.
     05 ACCEPT-DATE-TIME.
        10  ACCEPT-YEAR                PIC 9(4).
        10  ACCEPT-MONTH               PIC 9(2).
        10  ACCEPT-DAY                 PIC 9(2).
        10  ACCEPT-HOUR                PIC 9(2).
        10  ACCEPT-MINUTE              PIC 9(2).
        10  ACCEPT-SECOND              PIC 9(2).
        10  ACCEPT-HUNDREDTH           PIC 9(2).
        10  ACCEPT-DIFFERENCE          PIC X(1).
        10  ACCEPT-DIFF-HOURS          PIC 9(2).
        10  ACCEPT-DIFF-MINUTES        PIC 9(2).
     05 ADVANCING-LINES                NATIVE-2 VALUE ZERO.
     05 AUDIT-REPORT-SELECTION         PIC 9 VALUE ZERO.
         88 AUDIT-REPORT-YES           VALUE 1.
     05 BUFLEN                         NATIVE-2 VALUE 68.
     05 BYTESRET                       NATIVE-2.
     05 COMPLETION-CODE                NATIVE-2.
     05 ABEND-REQUIRED-FLAG            PIC 9 COMP VALUE ZERO.
        88 ABEND-REQUIRED              VALUE 1.
     05 COMPLETION-MESSAGE.
* Soln 10-020415-8203
*        10 TERMINATION-INFO-D         PIC 9(2).
         10 TERMINATION-INFO-D         PIC 9(3).
         10 TERMINATION-TEXT           PIC X(80) VALUE SPACES.
     05 CONTROL-FILE-OPEN-STATUS       PIC 9 VALUE ZERO.
         88 CONTROL-FILE-CLOSED        VALUE ZERO.
         88 NO-CONTROL-FILE-EOF        VALUE 1.
         88 CONTROL-FILE-EOF           VALUE 2.
     05 CONTROL-FILE-STATUS            PIC X(2).
         88 CONTROL-FILE-NOT-FOUND     VALUE "05".
     05 CONVERTTO-FLAG                 PIC 9 VALUE ZERO.
         88 CONVERTTO-PRESENT          VALUE 1.
* Soln 10-020415-8203: START
     05 DISKCONVERTTO-FLAG             PIC 9 VALUE ZERO.
         88 DISKCONVERTTO-PRESENT      VALUE 1.
     05 ACTUALDISK42-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK42-PRESENT      VALUE 1.
     05 ACTUALDISK43-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK43-PRESENT      VALUE 1.
     05 ACTUALDISK44-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK44-PRESENT      VALUE 1.
* Soln 10-020415-8203: END
*------------MeasTCM Yosemite Change----Start-----------
* Added for JBOD Disks (Subtype = 53).
     05 ACTUALDISK53-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK53-PRESENT      VALUE 1.
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for CEP RFE.
* Added for SAS disks (Subtype = 51)
     05 ACTUALDISK51-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK51-PRESENT      VALUE 1.
* Added for XP disks (Subtype = 52)
     05 ACTUALDISK52-FLAG             PIC 9 VALUE ZERO.
         88 ACTUALDISK52-PRESENT      VALUE 1.
     05 XPDISKFACTOR-FLAG             PIC 9 VALUE ZERO.
         88 XPDISKFACTOR-PRESENT      VALUE 1.
* Added for multiple TMF audit taril support
     05 NUMTMFTRAIL-FLAG              PIC 9 VALUE ZERO.
         88 NUMTMFTRAIL-PRESENT       VALUE 1.
* End of code change for CEP RFE.
     05 COPYRIGHT                      PIC X(64) VALUE
         "(C)1992 Tandem (C)2005 Hewlett Packard Development Company, L.P.".
*    GAG   21AUG98  IPM AAJ.   Used for PROC error status.
     05 WS-CHECK-ERROR                 NATIVE-2 VALUE ZERO.
*    GAG   21AUG98  IPM AAJ.   This keeps the CPU ALPHA TYPE if CONVERTO is not used.
     05 CPU-TYPE-ALPHA-SAVE            PIC X(8) VALUE SPACES.
     05 CPU-TYPE-ALPHA-SAVE-LEN        NATIVE-2 VALUE 8.
     05 CPU-TYPE-SUBTYPE-SAVE.
        10 CPU-TYPE-SAVE               NATIVE-2 VALUE ZERO.
        10 CPU-SUBTYPE-SAVE            NATIVE-2 VALUE ZERO.
        10 CPU-IPUNUM-SAVE             NATIVE-2 VALUE 1.
* Soln Soln 10-020717-0465
*    05 CPUPOWER-ENTERED               PIC X(6).
*    05 CPUPOWER-ENTERED-RED           REDEFINES CPUPOWER-ENTERED
*                                      PIC 9(2).9(2).
     05 CPUPOWER-ENTERED               PIC X(7).
     05 CPUPOWER-ENTERED-RED           REDEFINES CPUPOWER-ENTERED
                                       PIC 9(4).9(2).
     05 CPU-TYPE-ENTERED               PIC X(2).
     05 CPU-TYPE-ENTERED-RED           REDEFINES CPU-TYPE-ENTERED
                                       PIC 9(2).
     05 CPU-SUBTYPE-ENTERED            PIC X(4).
     05 CPU-SUBTYPE-ENTERED-RED        REDEFINES CPU-SUBTYPE-ENTERED
                                       PIC 9(4).
     05 CPU-IPUCOUNT-ENTERED           PIC X(2).
     05 CPU-IPUCOUNT-ENTERED-RED       REDEFINES CPU-IPUCOUNT-ENTERED
                                       PIC 9(2).
* Soln 10-020415-8203 : start
     05 DISK-SUBTYPE-SAVE              NATIVE-2 VALUE ZERO.
     05 DISK-SUBTYPE-ENTERED           PIC X(2).
     05 DISK-SUBTYPE-ENTERED-RED       REDEFINES DISK-SUBTYPE-ENTERED
                                       PIC 9(2).
*Start of Change-Declarations for Validation check
     05 APPL-INPUT-T1                  PIC X(21) JUSTIFIED RIGHT.
*End of Change-Declarations for Validation check
     05 DISK-RPM-ENTERED               PIC X(5).
     05 DISK-RPM-ENTERED-RED           REDEFINES DISK-RPM-ENTERED
                                       PIC 9(5).
     05 DISK-CNT-ENTERED               PIC X(4).
     05 DISK-READSEEK-ENTERED          PIC X(5).
     05 DISK-READSEEK-ENTERED-RED      REDEFINES DISK-READSEEK-ENTERED
                                       PIC 9(2).9(2).
     05 DISK-WRITESEEK-ENTERED         PIC X(5).
     05 DISK-WRITESEEK-ENTERED-RED     REDEFINES DISK-WRITESEEK-ENTERED
                                       PIC 9(2).9(2).
     05 XPDISKFACTOR-ENTERED           PIC X(5).
     05 XPDISKFACTOR-ENTERED-RED       REDEFINES XPDISKFACTOR-ENTERED
                                       PIC 9(2).9(2).
* MeasTCM Yosemite Change : Size of ACTUALDISK42-ENTERED,
* ACTUALDISK43-ENTERED,ACTUALDISK44-ENTERED changed from 5 to 10.
     05 ACTUALDISK42-ENTERED           PIC X(16).
     05 ACTUALDISK43-ENTERED           PIC X(16).
     05 ACTUALDISK44-ENTERED           PIC X(16).
* Soln 10-020415-8203 : end
*------------MeasTCM Yosemite Change----Start-----------
* Added for JBOD Disks (Subtype = 53).
     05 ACTUALDISK53-ENTERED           PIC X(16).
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for CEP RFE.
* Added for SAS disks (Subtype = 51)
     05 ACTUALDISK51-ENTERED           PIC X(16).
* Added for XP disks (Subtype = 52)
     05 ACTUALDISK52-ENTERED           PIC X(16).
     05 XPDISK-ENTERED           PIC X(16).
* Added for multiple TMF audit trail support.
     05 NUMTRAILS-ENTERED-RED           PIC 9(2).
     05 NUMTRAILS                       PIC 9(2).
* End of code change for CEP RFE.
     05 CSVTIME.
         10 YEAR                       PIC 9(4).
         10 FILLER                     PIC X VALUE "/".
         10 MONTH                      PIC 9(2).
         10 FILLER                     PIC X VALUE "/".
         10 DDAY                       PIC 9(2).
         10 FILLER                     PIC X VALUE ";".
         10 HOURS                      PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 MINUTES                    PIC 9(2).
         10 FILLER                     PIC X VALUE ":".
         10 SECONDS                    PIC 9(2).
     05 CTRSPACE.
*  SOLN 10-021028-2764
*       10 CTRSPACE-ARR                NATIVE-4 OCCURS 17.
        10 CTRSPACE-ARR                NATIVE-4 OCCURS ENTITY-NUM.
     05 DATE-N-TIME.
         10 YEAR                       PIC S9(4) COMP.
         10 MONTH                      PIC S9(4) COMP.
         10 DDAY                       PIC S9(4) COMP.
         10 HOURS                      PIC S9(4) COMP.
         10 MINUTES                    PIC S9(4) COMP.
         10 SECONDS                    PIC S9(4) COMP.
         10 FILLER                     PIC S9(4) COMP VALUE ZERO.
         10 FILLER                     PIC S9(4) COMP VALUE ZERO.
     05 DEFAULT-NAMES.
         10 DEFAULT-VOLUME             PIC X(8).
         10 DEFAULT-SUBVOLUME          PIC X(8).
     05 DEFAULT-SYSTEM                 PIC X(8).
     05 DFVERSION                      NATIVE-2.
     05 DFVERSION-SAVE                 NATIVE-2 VALUE 32767.
     05 DFVERSION-SAVE-RED             REDEFINES DFVERSION-SAVE.
         10 VERSION-LETTER             PIC X.
         10 VERSION-NUMBER             PIC X.
     05 CONVERT-GUARDIAN-SAVE          PIC X.
     05 CONVERT-GUARDIAN-VERSION       PIC X VALUE "C".
     05 EARLIEST-START-TIME            NATIVE-8 VALUE ZERO.
     05 ENTITIES .
*  SOLN 10-021028-2764
*       10 ENTITY-ARR                  NATIVE-4 OCCURS 17.
        10 ENTITY-ARR                  NATIVE-4 OCCURS ENTITY-NUM.
     05 EOP-STATUS                     PIC 9 VALUE ZERO.
         88 EOP-DETECTED               VALUE 1.
         88 NO-EOP-DETECTED            VALUE ZERO.
     05 EXIT-GCD                       PIC X  VALUE "N".
        88 C-EXIT-GCD                  VALUE "Y".
     05 EXIT-PROGRAM                   PIC X  VALUE "N".
        88 C-EXIT-PROGRAM              VALUE "Y".
     05 FIRSTCALL                      NATIVE-8.
     05 FOUR-SPACES                    PIC X(4) VALUE SPACES.
     05 FULL-LINE-STATUS               PIC 9 VALUE ZERO.
         88 FORCE-FULL-LINE            VALUE 1.
         88 NO-FULL-LINE-REQUIRED      VALUE ZERO.
     05 GROUP-DEFINED                  PIC X VALUE "G".
* Soln 10-011016-3820. Altered the next four variables from NATIVE-2 to
* NATIVE-4.
*    05 HEAP-I                         NATIVE-2.
*    05 HEAP-IR                        NATIVE-2.
*    05 HEAP-J                         NATIVE-2.
*    05 HEAP-L                         NATIVE-2.
     05 HEAP-I                         NATIVE-4.
     05 HEAP-IR                        NATIVE-4.
     05 HEAP-J                         NATIVE-4.
     05 HEAP-L                         NATIVE-4.
     05 INTERNAL-FILENAME.
         10 PART1                      PIC X(8).
         10 QUALIFIERS.
             15 PART2                  PIC X(8).
             15 PART3                  PIC X(8).
     05 IN-FILE-COUNT                  PIC X(13) VALUE "in-file-count".
     05 L-TITLE                        PIC X(8).
*Start of Change-Declarations for Validation check
     05 TEMP-L-TITLE                   PIC X(9).
*End of Change-Declarations for Validation check
     05 LAST-RECORD-TEST               PIC 9 VALUE ZERO.
         88 LAST-RECORD-RETURNED       VALUE 1.
     05 LATEST-STOP-TIME               NATIVE-8 VALUE ZERO.
     05 LCM-VARIABLES.
        10 DENOMINATOR                 NATIVE-8 VALUE ZERO.
        10 FACTOR-1                    NATIVE-8 VALUE ZERO.
        10 FACTOR-2                    NATIVE-8 VALUE ZERO.
        10 GCD                         NATIVE-8 VALUE ZERO.
        10 LCM                         NATIVE-8 VALUE ZERO.
        10 NUM-OF-LCMS                 PIC 9(03) VALUE ZERO.
        10 NUMERATOR                   NATIVE-8 VALUE ZERO.
        10 QUOTIENT                    NATIVE-8 VALUE ZERO.
        10 REM                         NATIVE-8 VALUE ZERO.
        10 TEMP-STORE                  NATIVE-8 VALUE ZERO.
        10 TEMP-START                  NATIVE-8 VALUE ZERO.
     05 LINE-CNT                       PIC 9(02) VALUE ZERO.
     05 MEASREAD-BUFFER-LENGTH         NATIVE-2 VALUE 32000.
     05 MINTIME                        PIC X(7) VALUE "mintime".
     05 NOWAIT-IO                      PIC X(9) VALUE "nowait-io".
     05 NUM-VALID-FILES                PIC 9(03) VALUE ZERO.
     05 NUMBER-DISPLAY                 PIC -Z(5).
     05 NUMBER-DISPLAY-2               PIC -Z(5).
     05 NUMBER-LINKED-DISCOPENS        NATIVE-4 VALUE ZERO.
     05 NUMBER-UNLINKED-DISCOPENS      NATIVE-4 VALUE ZERO.
     05 NUMBER-UNLINKED-DISCOPENS-R    NATIVE-4 VALUE ZERO.
     05 NUM-CSVS-VARIABLES.
       10 FILE-NUM                     PIC 9(03).
       10 LOC1                         PIC 9(2).
       10 LOC2                         PIC 9(2) VALUE ZERO.
       10 LOC-DIFF                     PIC 9(2).
       10 LOC-INDEX                    PIC 9(2).
       10 MAX-CSVS-POSSIBLE            PIC 9(03) VALUE 999.
       10 MEAS-START                   NATIVE-8 VALUE ZERO.
       10 MEAS-STOP                    NATIVE-8 VALUE ZERO.
       10 CPU-MEAS-START               NATIVE-8 VALUE ZERO.
       10 CPU-MEAS-STOP                NATIVE-8 VALUE -1.
       10 NUM-CSVS-FLAG                PIC X(01) VALUE "N".
          88 C-NUM-CSVS-DETECTED       VALUE "Y".
       10 NUMBER-CSVS-ALPHA            PIC X(03) VALUE SPACES.
          88 C-MAX-CSVS                VALUE "*", "ALL".
          88 C-DEFAULT-CSVS            VALUE " ".
       10 NUMBER-CSVS                  PIC 9(3) VALUE ZERO.
       10 NUM-CSVS-INDX                PIC 9 VALUE ZERO.
       10 NUM-CSVS-POSSIBLE            PIC 9(18) VALUE ZERO.
       10 NUM-CSVS-ACTUAL              PIC 9(18) VALUE ZERO.
       10 POS                          PIC 9(3).
     05 OFFSET                         NATIVE-2.
     05 ORDINAL                        NATIVE-2.
     05 OSVERSION                      NATIVE-2.
     05 PAGE-NUMBER                    NATIVE-2 VALUE ZERO.
     05 PERCENTAGE-LINKED-DISCOPENS    PIC ZZZ.99.
     05 PERCENT-LINKED                 PIC 9(3)V99.
     05 PID-SAVE                       PIC X(4).
     05 RESULT                         NATIVE-2.
     05 RESULT-4                       NATIVE-4 VALUE ZERO.
     05 SCRATCH-99                     PIC 9(2).
     05 SCRATCH-999                    PIC 9(3).
     05 SCRATCH-99999                  PIC 9(5).
     05 SCRATCH-NATIVE2                NATIVE-2.
     05 SCRATCH-X2                     REDEFINES SCRATCH-NATIVE2.
         10 FILLER                     PIC X.
         10 SCRATCH-X                  PIC X.
     05 SCRATCH-Z9                     PIC Z9.
     05 SCRATCH-ZZZZ9                  PIC Z(4)9.
     05 SECOND-BUFFER                  PIC X(13) VALUE "second-buffer".
     05 SPOOL-FILE-STATUS              PIC X(01) VALUE "N".
        88 C-SPOOL-FILE-OPEN           VALUE "Y".
     05 STARTUP-PORTION-STRING         PIC X(6) VALUE "STRING".
     05 STARTUP-PORTION-VOLUME         PIC X(6) VALUE "VOLUME".
     05 STARTUP-TEXT                   PIC X(35).
     05 SYSNAME                        PIC X(8).
     05 TEMP-INDEX                     PIC 9(03) VALUE ZERO.
     05 TEMP-TIMESTAMP                 NATIVE-8 VALUE ZERO.
     05 TERMINATION-INFO               PIC S9(4) COMP.
     05 TITLE-KEYWORD-INPUT            PIC 9 VALUE ZERO.
         88 TITLE-DETECTED             VALUE 1.
     05 TOTAL-CPU-BUSY-TIME            NATIVE-8 VALUE ZERO.
     05 TXN-LINE.
         10 L-TXN-TYPE                 PIC X.
         10 L-TXN-NAME                 PIC X(20).
     05 UNIQUE-COUNTER                 NATIVE-2.
     05 USER-DEFINED                   PIC X VALUE "U".
* >>>>> Version dependent field <<<<<
     05 VERSION-BANNER.
         10 FILLER                     PIC X(42) VALUE
         "MeasTCM - Measure to TCM interface - T6042".
         10 MEASTCM-VERSION            PIC X(3) VALUE IPM-NPV-VERSION.
         10 FILLER                     PIC X(4) VALUE " - (".
         10 FILLER                     PIC X(7) VALUE IPM-NPV-DATE.
         10 FILLER                     PIC X(1) VALUE ")".
     05 VOLUME-TOTAL-READS             NATIVE-4 VALUE ZERO.
     05 VOLUME-TOTAL-WRITES            NATIVE-4 VALUE ZERO.
     05 WKLD-LINE.
         10 L-CPU                      PIC X(2) JUST.
         10 L-GROUP                    PIC X(3) JUST.
         10 L-PIN                      PIC X(5) JUST.
         10 L-SYSTEM                   PIC X(8).
*Start of Change-Declarations for Validation check
         10 TEMP-L-SYSTEM              PIC X(9).
*End of Change-Declarations for Validation check
         10 L-USER                     PIC X(3) JUST.
     05 WKLD-MATCH                     PIC 9.
         88 NO-MATCH                   VALUE 0.
         88 MATCH-FOUND                VALUE 1.
     05 WRITE-RUN-SUMMARY-FLAG         PIC X(01) VALUE "N".
        88 C-WRITE-RUN-SUMMARY         VALUE "Y".
     05 OVERFLOW-COUNTS.
         10 CPU-OVERFLOW-COUNT         NATIVE-2 VALUE ZERO.
         10 PROCESS-OVERFLOW-COUNT     NATIVE-2 VALUE ZERO.
         10 DISC-OVERFLOW-COUNT        NATIVE-2 VALUE ZERO.
         10 DISCOPEN-OVERFLOW-COUNT    NATIVE-2 VALUE ZERO.
         10 OVERFLOW-FLAG              PIC 9 VALUE ZERO.
            88 OVERFLOW-OCCURED        VALUE 1.
         10 MEASURE-FILE-OVERFLOW      PIC 9 VALUE ZERO.
 01 PREVIOUS-DETAIL.
     05 PREVIOUS-STOP-TIME             NATIVE-8 VALUE ZERO.
     05 PREVIOUS-WKLD-NAME             PIC X(8) VALUE SPACES.
     05 PREVIOUS-SYSTEM-NAME           PIC X(8).
     05 PREVIOUS-PROGRAM-FILE-NAME.
         10 PREVIOUS-VOLUME            PIC X(8).
         10 PREVIOUS-SUBVOLUME         PIC X(8).
         10 PREVIOUS-FILE-NAME         PIC X(8).
     05 PREVIOUS-PROCESS-NAME          PIC X(8).
     05 PREVIOUS-CPU-NUM               NATIVE-2.
     05 PREVIOUS-PIN                   NATIVE-4.
 01 PRINT-LINES.
     05 P-DETAIL.
         10 P-WKLD-NAME                PIC X(8).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-SYSTEM-NAME              PIC X(8).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-PROGRAM-FILE-NAME.
             15 P-VOLUME               PIC X(8).
             15 P-SUBVOLUME            PIC X(8).
             15 P-FILE-NAME            PIC X(8).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-PROCESS-NAME             PIC X(8).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-CPU-NUM                  PIC X(2).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-PIN                      PIC X(5).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-CPU-BUSY-TIME            PIC Z(5).9(3).
         10 FILLER                     PIC X VALUE SPACE.
         10 P-DELTA-TIME               PIC Z(5).9(3).
     05 P-FOOT.
         10 FILLER                     PIC X(36) VALUE SPACES.
         10 FILLER                     PIC X(5) VALUE "Page".
         10 PAGE-NUMBER-Z              PIC Z(2)9.
     05 P-TITLE-1.
         10 FILLER                     PIC X(8) VALUE SPACES.
         10 FILLER                     PIC X(43) VALUE
                                   "Process category audit report, application".
         10 P-APPLICATION              PIC X(20).
     05 P-TITLE-2.
         10 FILLER                     PIC X(8) VALUE SPACES.
         10 FILLER                     PIC X(25) VALUE
                                       "Measurement window: from".
         10 FROM-WINDOW                PIC X(19).
         10 FILLER                     PIC X(4) VALUE " to".
         10 TO-WINDOW                  PIC X(19).
     05 P-TITLE-21.
         10 FILLER                     PIC X(08) VALUE SPACES.
         10 FILLER                     PIC X(15) VALUE "CSV Data file: ".
         10 P-CSV-FILE                 PIC X(35) VALUE SPACES.
     05 P-TITLE-3.
         10 FILLER                     PIC X(8) VALUE "  Pcat".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(8) VALUE " System".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(24) VALUE "   Program file name".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(8) VALUE "Process".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(2) VALUE "CP".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(5) VALUE " PIN".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(9) VALUE "Busy secs".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(9) VALUE "Res secs".
     05 P-TITLE-4.
         10 FILLER                     PIC X(8) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(8) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(24) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(8) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(2) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(5) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(9) VALUE ALL "_".
         10 FILLER                     PIC X VALUE SPACE.
         10 FILLER                     PIC X(9) VALUE ALL "_".
     05 P-TOTAL-1.
         10 FILLER                     PIC X(61) VALUE SPACES.
         10 FILLER                     PIC X(9) VALUE ALL "_".
     05 P-TOTAL-2.
         10 FILLER                     PIC X(61) VALUE SPACES.
         10 P-CPU-BUSY-TIME-TOTAL      PIC Z(5).9(3).
* Modified the filler variable size in CPU-TEMP data item from 4 to 9 to sort all the columns in the CPU record.
 01 SORT-TEMPORARY-AREAS GLOBAL.
     05 CPU-TEMP.
         10 CPU-NUM                    NATIVE-2.
         10 FILLER                     PIC X(9).
     05 PROCESS-TEMP.
         10 PROCESS-SORT-KEY           PIC X(12).
         10 FILLER                     PIC X(12).
     05 SYSTEM-TEMP.
         10 SYSTEM-NAME                PIC X(8).
         10 FILLER                     PIC X(2).
     05 TITLE-TEMP.
         10 FILLER                     PIC X(8).
         10 TITLE-NUMBER               PIC X.
         10 FILLER                     PIC X.
     05 VOLUME-TEMP.
         10 VOLUME-SORT-KEY            PIC X(10).
         10 FILLER                     PIC X(97).
     05 WKLD-TEMP.
        10 WKLD-SORT-KEY               PIC X(42).
     05 MEASURE-TEMP.
        10 MEASURE-START               NATIVE-8.
        10 FILLER                      PIC X(105).
 01 STACK.
     05 S-GROUP                        PIC X.
     05 S-USER                         PIC X.
     05 S-PROCESS-NAME                 PIC X(8).
     05 S-PROGRAM-FILE-NAME            PIC X(24).
 01 STCM-VAL-SSID GLOBAL.
* The Tandem Bible is located in \CYCLONE.$OPSYS.NEWBIBLE,
* Charles Rosendahl is the owner
     05 Z-OWNER                        PIC X(8) VALUE "TANDEM".
     05 Z-NUMBER                       PIC S9(4) COMP VALUE 129.
* >>>>> Version dependent field <<<<<
*------------MeasTCM Yosemite Change----Start-----------
*    05 Z-VERSION                      NATIVE-2 VALUE CURRENTVERSION.
     05 Z-VERSION                      NATIVE-2.
*------------MeasTCM Yosemite Change-----End------------
 01 SYSTEM-TABLE-01 GLOBAL.
     05 SYSTEM-TABLE                   OCCURS 0 TO SYSTEM-CEILING
                                       DEPENDING SYSTEM-MAX
*                                      ASCENDING SYSTEM-NAME OF SYSTEM-TABLE
                                       INDEXED SYSTEM-INDEX SYSTEM-INDEX-2.
         10 SYSTEM-NAME                PIC X(8).
         10 SYSTEM-VERSION             NATIVE-2.
 01 TITLE-TABLE-01.
     05 TITLE-TABLE                    OCCURS 0 TO TITLE-CEILING
                                       DEPENDING TITLE-MAX
                                       ASCENDING TITLE-NUMBER OF TITLE-TABLE
                                       INDEXED TITLE-INDEX TITLE-INDEX-2.
         10 TITLE-SORT-MOVE.
             15 TITLE-NAME             PIC X(8).
             15 TITLE-NUMBER           PIC X.
             15 TITLE-TYPE             PIC X.
         10 CSV-W-BINARY.
* MeasTCM Yosemite Change: Size of W03,W04,W06,W07,W13 & W14 is changed.
             15 W03                    NATIVE-8.
             15 W04                    NATIVE-8.
             15 W05                    NATIVE-8.
             15 W06                    NATIVE-8.
             15 W07                    NATIVE-8.
             15 W08                    NATIVE-8.
             15 W09                    NATIVE-8.
             15 W13                    PIC 9(13)V9(5) COMP.
             15 W14                    PIC 9(13)V9(5) COMP.
             15 W21                    NATIVE-8.
             15 W22                    NATIVE-8.
             15 W23                    NATIVE-8.
 01 TXN-TABLE-01.
     05 TXN-TABLE                      OCCURS 0 TO TXN-CEILING
                                       DEPENDING TXN-MAX
                                       INDEXED TXN-INDEX.
         10 TXN-TYPE                   PIC X.
         10 TXN-NAME                   PIC X(20).
 01 VERSION-TABLE-01 GLOBAL.
     05 VERSION-TABLE                  OCCURS 0 TO VERSION-CEILING
                                       DEPENDING VERSION-MAX
                                       INDEXED VERSION-INDEX.
         10 VERSION-ENTITY-LENGTHS.
             15 CPU-ENTITY-LENGTH      PIC S9(4) COMP.
             15 DISC-ENTITY-LENGTH     PIC S9(4) COMP.
             15 DISCOPEN-ENTITY-LENGTH PIC S9(4) COMP.
             15 PROCESS-ENTITY-LENGTH  PIC S9(4) COMP.
         10 VERSION-VALUE              NATIVE-2.
 01 WILDCARD-CHARACTERS.
* The traditional wildcard characters * and ? are replaced by HIGH-VALUE and
* hexadecimal FE. This to make sure that they end up at the end after WKLD-TABLE
* is sorted.
     05 WC-ASTERISK-NUM                NATIVE-2 VALUE -1.
     05 WC-ASTERISK-ALFA               PIC X VALUE HIGH-VALUE.
     05 WC-QUESTION                    PIC X VALUE HEX-FE.
 01 WKLD-TABLE-01.
     05 WKLD-TABLE                     OCCURS 0 TO WKLD-CEILING
                                       DEPENDING WKLD-MAX
                                       INDEXED WKLD-INDEX WKLD-INDEX-2.
        10 WKLD-SORT-KEY.
* Don't change the order of these variables !
            15 WKLD-SYSTEM             NATIVE-2.
            15 WKLD-CPU                NATIVE-2.
            15 WKLD-PIN                NATIVE-2.
            15 WKLD-PROCESS-NAME       PIC X(8).
            15 WKLD-PROGRAM-FILENAME   PIC X(24).
            15 WKLD-USERID-FLAG        PIC X.
            15 WKLD-GROUP              PIC X.
            15 WKLD-USER               PIC X.
            15 WKLD-NUMBER             PIC X.
* For MEASURE counters overflow checking - Soln 10-000518-8168
 01 CONDITION                          PIC 9 GLOBAL.
 01 ARRAY-CTR                          PIC 9 GLOBAL.
* End of part of the fix of Soln 10-000518-8168.
* Variables added for Soln 10-001222-8124
 01 TEMP-COUNTER                       NATIVE-2.
 01 COUNT-OF-BLANKS                    NATIVE-2.
 01 TEMP-RECORD-BUFFER                 PIC X(80).
* Next 10 variables added for Soln 10-000602-8415
 01 CONVERTTO-CPU-NAME                 PIC X(8).
 01 TEMP-CPU-TYPE                      NATIVE-2.
 01 TEMP-CPU-SUBTYPE                   NATIVE-2.
 01 CPU-TYPE-FLAG                      PIC 9 VALUE ZERO.
 01 TEMP-OS-VERSION-X                  NATIVE-2.
 01 TEMP-OS-VERSION-Y                  REDEFINES TEMP-OS-VERSION-X.
    02 VERSION-LETTER                  PIC X.
    02 VERSION-NUMBER                  PIC X.
 01 TEMP-OS-VERSION-Z.
    02 VERSION-LETTER                  PIC X.
    02 VERSION-NUMBER                  PIC X.
 01 TEMP-OS-VERSION-LETTER             PIC X.
 01 TEMP-OS-VERSION-NUMBER             PIC X(2).
 01 FLAG-CPUFACTOR-NEW-CPU             PIC 9 VALUE ZERO.
* Below flag added for multi-core CPU support
 01 JCPU-FLAG                          PIC 9 VALUE ZERO.
* Below flag added for XP disk support
 01 SASDISK-FLAG                       PIC 9 VALUE ZERO.
 01 XPDISK-FLAG                        PIC 9 GLOBAL VALUE ZERO.
* Added for Soln 10-001226-8148.
 01 TEMP-DENOMINATOR                   NATIVE-8.
* These are pointers which are used to set up the linkage section below.
 01  CPU-PNTR        USAGE POINTER VALUE IS NULL.
 01  DISC-PNTR       USAGE POINTER GLOBAL VALUE IS NULL.
 01  DISCOPEN-PNTR   USAGE POINTER VALUE IS NULL.
 01  PROCESS-PNTR    USAGE POINTER VALUE IS NULL.
 01 CPU-CNTRS.
    05  CPU-CNTR-START                  NATIVE-2 VALUE ZERO.
    05  CPU-CNTR-END                    NATIVE-2 VALUE ZERO.
    05  ZMSCPU-CNTR-START               NATIVE-2 VALUE ZERO.
    05  ZMSCPU-CNTR-END                 NATIVE-2 VALUE ZERO.
 01 DISCOPEN-CNTRS.
    05  DISCOPEN-CNTR-START             NATIVE-2 VALUE ZERO.
    05  DISCOPEN-CNTR-END               NATIVE-2 VALUE ZERO.
    05  ZMSDOPEN-CNTR-START             NATIVE-2 VALUE ZERO.
    05  ZMSDOPEN-CNTR-END               NATIVE-2 VALUE ZERO.
 01 PROCESS-CNTRS.
    05  PROCESS-CNTR-START              NATIVE-2 VALUE ZERO.
    05  PROCESS-CNTR-END                NATIVE-2 VALUE ZERO.
    05  ZMSPROC-CNTR-START              NATIVE-2 VALUE ZERO.
    05  ZMSPROC-CNTR-END                NATIVE-2 VALUE ZERO.
*------------MeasTCM Yosemite Change----Start-----------
* For ZMS-Style Records (For Yosemite System support).
 01  ZMSCPU-PNTR     USAGE POINTER VALUE IS NULL.
 01  ZMSPROC-PNTR    USAGE POINTER VALUE IS NULL.
 01  ZMSDISC-PNTR    USAGE POINTER GLOBAL VALUE IS NULL.
 01  ZMSDOPEN-PNTR   USAGE POINTER VALUE IS NULL.
* Entity Template Version variables will be passed as [templateversion]
* argument to the MEASURE callable procedure MEASREAD_DIFF_() for
* accessing ZMS Style Record of the Entities (For Yosemite System support).
 01  ZMSPROC-TEMPLATE-VERSION   NATIVE-8 VALUE 562988609437745.
 01  ZMSDOPEN-TEMPLATE-VERSION  NATIVE-8 VALUE 1688888515624974.
* COBOL85 doesn’t support Numeric value greater than 18 digits.
* As, CPU & DISC Template Version Values require 19 digits in Decimal base,
* they are represented in Hexadecimal base here;
* else COBOL85 issues compilation errors.
* Please Note that this is not a Memory Storage Issue
* but a limitation of the COBOL85 language.
 01  ZMSCPU-TEMPLATE-VERSION    NATIVE-8 VALUE H"4001860900020060".
 01  ZMSDISC-TEMPLATE-VERSION   NATIVE-8 GLOBAL VALUE H"30079409001F0070".
* This flag will be set to "Y" if YOSEMITE Measure Datafile is being used.
 01  YOSEMITE-DATAFILE        PIC X(01) GLOBAL VALUE "N".
* MAX-VALUE-13 & MAX-VALUE-19 will be used in ON SIZE ERROR phrase.
* Depending on the size of variable undergoing Arithmetic overflow,
* one of these values will be passed to it.
* MAX-VALUE-19 equal to 9223372036854775807 (Max 19 digit value supported).
* Represented in Hex format, reason as explained for ZMSCPU-TEMPLATE-VERSION.
 01  MAX-VALUE-13       PIC 9(13) GLOBAL VALUE 9999999999999.
 01  MAX-VALUE-19       NATIVE-8  VALUE H"7FFFFFFFFFFFFFFF".
* W03, W04, W06, W07 will be divided by DIV-VALUE to get their
* most significant 19th digit, if any. Equal to 1000000000000000000.
* Represented in Hex format, reason as explained for ZMSCPU-TEMPLATE-VERSION.
 01  DIV-VALUE          NATIVE-8  VALUE H"DE0B6B3A7640000".
*------------MeasTCM Yosemite Change-----End------------
 01  ENTITY-COUNTER  NATIVE-2 GLOBAL.
* temporay variable added to fill IPU count
 77 TEMPIPU     PIC 99 VALUE 1.
*----------------------------------------------------------------------------
 EXTENDED-STORAGE SECTION.
 01 MEASREAD-BUFFER GLOBAL.
     05 LOC                            PIC X(32000).
 01 PROCESS-TABLE-01.
     05 PROCESS-TABLE                  OCCURS 0 TO PROCESS-CEILING
                                       DEPENDING PROCESS-MAX
                                       ASCENDING PROCESS-CPU-NUM
                                                 PROCESS-PIN
                                                 PROCESS-UNIQUE
                                       INDEXED PROCESS-INDEX PROCESS-INDEX-2.
         10 PROCESS-SORT-KEY.
             15 PROCESS-PID.
                 20 PROCESS-CPU-NUM    NATIVE-2.
                 20 PROCESS-PIN        NATIVE-2.
             15 PROCESS-FROM           NATIVE-8.
         10 PROCESS-TO                 NATIVE-8.
         10 PROCESS-WKLD-NUMBER        PIC X.
         10 PROCESS-UNIQUE             NATIVE-2.
 01 RUN-SUMMARY-LINES GLOBAL.
    05 RUN-SUM-HEADING.
       10 FILLER                       PIC X(25) VALUE "MeasTCM".
       10 FILLER                       PIC X(18) VALUE "Run Summary".
       10 RUN-SUM-DATE-N-TIME.
          15 RUN-SUM-DD                PIC Z9 VALUE ZERO.
          15 FILLER                    PIC X(01) VALUE "-".
          15 RUN-SUM-MON               PIC X(03) VALUE SPACE.
          15 FILLER                    PIC X(01) VALUE "-".
          15 RUN-SUM-YYYY              PIC 9(4) VALUE ZERO.
          15 FILLER                    PIC X(02) VALUE SPACES.
          15 RUN-SUM-HH                PIC Z9    VALUE ZERO.
          15 FILLER                    PIC X(01) VALUE ":".
          15 RUN-SUM-MN                PIC 99    VALUE ZERO.
          15 FILLER                    PIC X(01) VALUE ":".
          15 RUN-SUM-SS                PIC 99    VALUE ZERO.
    05 RUN-SUM-HEADING-2.
       10 FILLER                       PIC X(80) VALUE
          "Measure Data File Summary:".
    05 RUN-UND-1                       PIC X(26).
    05 RUN-UND-2                       PIC X(24).
    05 RUN-MEAS-MSG-INDX               PIC 9    VALUE 1.
    05 RUN-MEAS-TEMP.
       10 TEMP-LINE-1.
          15 MEAS-INDEX                 PIC Z(02)B.
          15 FILLER                     PIC X(19) VALUE
             "Measure file name: ".
          15 MEAS-FILE-NAME             PIC X(26).
          15 FILLER                     PIC X(7) VALUE SPACES.
          15 FILLER                     PIC X(8) VALUE "System: ".
          15 MEAS-SYS-NAME              PIC X(8).
       10 TEMP-LINE-2.
          15 FILLER                    PIC X(14) VALUE
           "   From time: ".
          15 TEMP-FROM-TIME            PIC X(19) VALUE SPACES.
          15 FILLER                    PIC X(1) VALUE SPACES.
          15 FILLER                    PIC X(9) VALUE "To Time: ".
          15 TEMP-TO-TIME              PIC X(19) VALUE  SPACES.
          15 FILLER                    PIC X(01) VALUE SPACES.
          15 FILLER                    PIC X(11) VALUE
             "Int.(Secs):".
          15 TEMP-COLL-INT             PIC Z(8).
       10 TEMP-LINE-3                  PIC X(80) VALUE SPACES.
    05 RUN-MEAS-FILE-ADV               PIC X(80) VALUE SPACES.
    05 RUN-SUM-CSV-HEAD                PIC X(80)  VALUE
       "CSVLO and CSVHI Summary: ".
    05 RUN-SUM-CSV-LINE-1.
       10 FILLER                       PIC X(30) VALUE
          "Requested Time Range: CSVLO = ".
       10 REQ-CSVLO                    PIC X(19) VALUE SPACES.
       10 FILLER                       PIC X(03) VALUE SPACES.
       10 FILLER                       PIC X(8) VALUE "CSVHI = ".
       10 REQ-CSVHI                    PIC X(19) VALUE SPACES.
    05 RUN-SUM-CSV-LINE-2.
       10 FILLER                       PIC X(30) VALUE
          "   Actual Time Range: CSVLO = ".
       10 ACT-CSVLO                    PIC X(19) VALUE SPACES.
       10 FILLER                       PIC X(03) VALUE SPACES.
       10 FILLER                       PIC X(8) VALUE "CSVHI = ".
       10 ACT-CSVHI                    PIC X(19) VALUE SPACES.
    05 RUN-SUM-CSV-LINE                PIC X(80) VALUE SPACES.
    05 RUN-SUM-OUTPUT-HEAD.
       10 FILLER                       PIC X(80) VALUE
       "CSV Output file Summary:".
    05 RUN-SUM-OUTPUT-LINE-1.
       10 FILLER                       PIC X(36) VALUE
          " Number of CSV data files possible: ".
       10 POSS-NUM-CSV                 PIC Z(03).
    05 RUN-SUM-OUTPUT-LINE-2.
       10 FILLER                       PIC X(36) VALUE
          "Requested number of CSV data files: ".
       10 REQ-NUM-CSV                  PIC X(03).
    05 RUN-SUM-OUTPUT-LINE-3.
       10 FILLER                       PIC X(36) VALUE
          "   Actual number of CSV data files: ".
       10 ACT-NUM-CSV                  PIC Z(03).
    05 RUN-CSV-TEMP.
       10 CSV-TEMP-1.
          15 FILLER                    PIC X(15) VALUE
          "CSV File Name: ".
          15 CSV-FILE-NAME             PIC X(35) VALUE SPACES.
          15 FILLER                    PIC X(04) VALUE SPACES.
          15 FILLER                    PIC X(20) VALUE
            "% Discopens linked: ".
          15 CSV-LINK                  PIC ZZ9.99 VALUE ZERO.
        10 CSV-TEMP-2.
          15 FILLER                    PIC X(15) VALUE
           "    From time: ".
          15 TEMP-FROM-TIME            PIC X(19) VALUE SPACES.
          15 FILLER                    PIC X(17) VALUE SPACES.
          15 FILLER                    PIC X(9) VALUE "To Time: ".
          15 TEMP-TO-TIME              PIC X(19) VALUE  SPACES.
        10 CSV-TEMP-3                  PIC X(80) VALUE SPACES.
*
 01 RUN-SUM-MEASURE-TABLE GLOBAL.
    05 RUN-MEASURE-FILE-INFO           OCCURS 0 TO MEASURE-CEILING
                                       DEPENDING ON MEASURE-MAX.
       10 RUN-MEAS-LINE-1               PIC X(80).
       10 RUN-MEAS-LINE-2               PIC X(80).
       10 RUN-MEAS-ADV                  PIC X(80) OCCURS 7 TIMES.
*
 01 RUN-SUM-CSV-TABLE GLOBAL.
    05 RUN-CSV-FILE-INFO               OCCURS 0 TO 999
                                       DEPENDING ON NUM-CSVS-ACTUAL.
       10 RUN-CSV-LINE-1                PIC X(80).
       10 RUN-CSV-LINE-2                PIC X(80).
       10 RUN-CSV-ADV                   PIC X(80).
 01 RUN-SUM-MONTHS GLOBAL.
    05 RUN-MONTHS-INDX                    PIC 9(02) VALUE ZERO.
    05 RUN-MONTHS                         PIC X(36) VALUE
       "JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC".
    05 RUN-MONTHS-R  REDEFINES RUN-MONTHS PIC X(03) OCCURS 12.
*   GAG IPM AAK.   Added DEV-TYPE and DEV-SUBTYPE.
 01 VOLUME-TABLE-01 GLOBAL.
     05 VOLUME-TABLE                   OCCURS 0 TO VOLUME-CEILING
                                       DEPENDING VOLUME-MAX
                                       ASCENDING VOLUME-SYSTEM-NUMBER
                                                 VOLUME-NAME
                                       INDEXED VOLUME-INDEX VOLUME-INDEX-2.
         10 VOLUME-SORT-MOVE.
             15 VOLUME-SORT-KEY.
                 20 VOLUME-SYSTEM-NUMBER NATIVE-2.
                 20 VOLUME-NAME        PIC X(8).
*------------MeasTCM Yosemite Change----Start-----------
             15 VOLUME-UNIT-1          NATIVE-4.
             15 VOLUME-UNIT-2          NATIVE-4.
*------------MeasTCM Yosemite Change-----End------------
             15 VOLUME-DEV-TYPE        NATIVE-2.
             15 VOLUME-DEV-SUBTYPE     NATIVE-2.
             15 VOLUME-READ-BUSY-TIME  NATIVE-8.
             15 VOLUME-WRITE-BUSY-TIME NATIVE-8.
             15 VOLUME-SEEK-BUSY-TIME  NATIVE-8.
*------------MeasTCM Yosemite Change----Start-----------
             15 VOLUME-READS           NATIVE-8.
             15 VOLUME-WRITES          NATIVE-8.
             15 VOLUME-DOPN-READS      NATIVE-8.
             15 VOLUME-DOPN-WRITES     NATIVE-8.
*------------MeasTCM Yosemite Change-----End------------
         10 PREVIOUS-MEAS-FILE         PIC X(24).
         10 NO-OF-FILES                PIC 9(03).
         10 NO-OF-VOLUME-RECS          PIC 9(06).
*------------MeasTCM Yosemite Change----Start-----------
         10 DISC-READ-COST             NATIVE-8.
         10 DISC-WRITE-COST            NATIVE-8.
         10 DISC-TO-DOPN-READ-RATIO    PIC 9(13)V9(5) COMP.
         10 DISC-TO-DOPN-WRITE-RATIO   PIC 9(13)V9(5) COMP.
*------------MeasTCM Yosemite Change-----End------------
*-----------Soln 10-060505-6280--start----
 01 INTR-AUX-BUSY                      NATIVE-8 VALUE ZERO.
 01 SYS-FLAG                           PIC 9    VALUE ZERO.
* Moved Linkage section COPY here -by Sangeetha
  COPY CPU-DEFINITION.
  COPY PROCESS-DEFINITION.
  COPY DISCOPEN-DEFINITION.
  COPY ZMSCPU-DEFINITION.
  COPY ZMSPROC-DEFINITION.
  COPY ZMSDOPEN-DEFINITION.
*-----------Soln 10-060505-6280--end----
*----------------------------------------------------------------------------
 LINKAGE SECTION.
* COPY CPU-TRIAL.
* COPY CPU-DEFINITION.
* COPY PROCESS-DEFINITION.
* COPY DISC-DEFINITION.
* COPY DISCOPEN-DEFINITION.
*------------MeasTCM Yosemite Change----Start-----------
*  For Yosemite System support
* COPY ZMSCPU-DEFINITION.
* COPY ZMSPROC-DEFINITION.
* COPY ZMSDISC-DEFINITION.
* COPY ZMSDOPEN-DEFINITION.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 PROCEDURE DIVISION.
 100-ENTRY.
* Call ABEND on arithmetic overflow
     ENTER "COBOL85^ARMTRAP" OF CBL85UTL.
     PERFORM 1000-INITIALIZE.
     PERFORM 2000-CONTROL-FILE-PROCESSING.
     PERFORM 3000-CORE-PROCESSING.
     MOVE COMPLETION-00 TO COMPLETION-MESSAGE.
*     PERFORM 9000-COMPLETION.
    PERFORM 9010-SPCOMPLETION.
* Call dummy routines SETDATAFREELIST and SETINDEXFREELIST to get rid of
* "undefined externals" message when run on D-series
* Cfr TPR # S 920131 1143 4576
     ENTER TAL "SETDATAFREELIST" OF OTALNAME.
     ENTER TAL "SETINDEXFREELIST" OF OTALNAME.
     STOP RUN.
*----------------------------------------------------------------------------
 1000-INITIALIZE.
     DISPLAY VERSION-BANNER.
     DISPLAY COPYRIGHT.
     DISPLAY SPACE.
     IF DEBUG-MODE
         DISPLAY ">DEBUG-MODE enabled"
     END-IF.
     DISPLAY INFO-01.
* Check GUARDIAN version (must be at least M20)
     ENTER TAL "TOSVERSION" GIVING OSVERSION.
*     IF OSVERSION < M20
      IF OSVERSION < Q02
         MOVE COMPLETION-29 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Specify parameters to FASTSORT
     ENTER "COBOL85^SET^SORT^PARAM^VALUE" OF CBL85UTL
         USING     SORT-FILE,
                   IN-FILE-COUNT,
                   (PROCESS-CEILING * SYSTEM-CEILING)
         GIVING RESULT.
     PERFORM 1010-SORT-PARAM-ERROR-CHECK.
     ENTER "COBOL85^SET^SORT^PARAM^VALUE" OF CBL85UTL
         USING     SORT-FILE,
                   MINTIME,
                   1
         GIVING RESULT.
     PERFORM 1010-SORT-PARAM-ERROR-CHECK.
* The following call can cause run-time warning diagnostic message 123
* to be issued if there is insufficient memory for a buffer. Nevertheless, the
* SORT will execute correctly. Use the MEM option on the RUN command to get
* sufficient memory.
* Cfr. COBOL85 T9257ABE 04APR92 softdoc, problems corrected 5.
*    ENTER "cobol85^set^sort^param^value" OF cbl85utl USING sort-file,
*        nowait-io, 1 GIVING result.
*    PERFORM 1010-sort-param-error-check.
     ENTER "COBOL85^SET^SORT^PARAM^VALUE" OF CBL85UTL
         USING     SORT-FILE,
                   SECOND-BUFFER,
                   1
         GIVING RESULT.
     PERFORM 1010-SORT-PARAM-ERROR-CHECK.
* Determine default volume and subvolume
     ENTER "GETSTARTUPTEXT" OF COBOLLIB USING STARTUP-PORTION-VOLUME,
         STARTUP-TEXT GIVING RESULT.
     IF RESULT NEGATIVE
         MOVE COMPLETION-01 TO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     UNSTRING STARTUP-TEXT DELIMITED "." INTO DEFAULT-SYSTEM,
         DEFAULT-VOLUME, DEFAULT-SUBVOLUME.
     IF DEFAULT-SYSTEM (1:1) NOT = "\"
         MOVE DEFAULT-VOLUME TO DEFAULT-SUBVOLUME
         MOVE DEFAULT-SYSTEM TO DEFAULT-VOLUME
         MOVE SPACES TO DEFAULT-SYSTEM
     END-IF.
* Get name of control file
     ENTER "GETSTARTUPTEXT" OF COBOLLIB USING STARTUP-PORTION-STRING,
         STARTUP-TEXT GIVING RESULT.
     IF RESULT NEGATIVE
         MOVE COMPLETION-01 TO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     IF RESULT ZERO
         MOVE COMPLETION-28 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
*    GAG  21AUG98.  IPM AAJ.  Modified date handling for YEAR 2000.
*    Now uses CURRENT-DATE function instead of ACCEPT from DATE TIME.
     MOVE FUNCTION CURRENT-DATE TO ACCEPT-DATE-TIME.
     MOVE ACCEPT-DAY            TO RUN-SUM-DD.
     MOVE ACCEPT-MONTH          TO RUN-MONTHS-INDX.
     MOVE RUN-MONTHS-R(RUN-MONTHS-INDX) TO RUN-SUM-MON.
     MOVE ACCEPT-YEAR           TO RUN-SUM-YYYY.
     MOVE ACCEPT-HOUR           TO RUN-SUM-HH.
     MOVE ACCEPT-MINUTE         TO RUN-SUM-MN.
     MOVE ACCEPT-SECOND         TO RUN-SUM-SS.
*----------------------------------------------------------------------------
 1010-SORT-PARAM-ERROR-CHECK.
* Check the error code returned by COBOL85^SET^SORT^PARAM^VALUE
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-67  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 2000-CONTROL-FILE-PROCESSING.
     DISPLAY INFO-02.
     PERFORM 2000-10-PROCESS-CONTROL-FILE.
     PERFORM 2000-20-DETERMINE-AUDIT.
     PERFORM 2000-30-SORT-MEASURE-TABLE.
     PERFORM 2000-40-VALIDATE-CSV-LO-HI.
     PERFORM 2000-50-VALIDATE-MEASURE-FILES.
     PERFORM 2000-60-GET-START-STOP-TIMES.
     PERFORM 2000-70-GET-POSSIBLE-CSV-COUNT.
     PERFORM 2000-80-GET-USER-CSV-COUNT.
     PERFORM 2000-90-GET-CSVDATA-NAMES.
     PERFORM 2000-100-APPLICATION-NAME.
     PERFORM 2000-110-PREPARE-CATEGORIES.
     PERFORM 2000-120-ADD-CAT-98.
     PERFORM 2000-130-ADD-CAT-99.
     PERFORM 2000-140-INITIALISE-CSV-AREAS.
     PERFORM 2000-150-DEBUG.
     IF CONVERTTO-PRESENT
*         EVALUATE CONVERT-GUARDIAN-VERSION
*             WHEN "C"
*                 MOVE CPU-POWER-VALUE-CNN(CPU-TYPE-POWER-CONVERTTO)
*                    TO CPU-POWER-VALUE
*             WHEN "D"
*                 MOVE CPU-POWER-VALUE-DNN(CPU-TYPE-POWER-CONVERTTO)
*                    TO CPU-POWER-VALUE
*         END-EVALUATE
          MOVE CPU-POWER-VALUE-GNN(CPU-TYPE-POWER-CONVERTTO)
                    TO CPU-POWER-VALUE
          MOVE CPU-IPUCOUNT-NUMBER(CPU-TYPE-POWER-CONVERTTO)
                    TO CONVERTTO-IPU-VALUE
     END-IF.
     IF DEBUG-MODE PERFORM 2000-01-CONVERT-TABLE.
* Soln 10-020415-8203 : start
     IF DISKCONVERTTO-PRESENT
*          Save the convertto disk controller type
           MOVE DISK-CONTROLLER(DISK-TYPE-POWER-CONVERTTO) TO DISKTO-CNT-VALUE
*          Save the convertto disk RPM
           MOVE DISK-RPM(DISK-TYPE-POWER-CONVERTTO) TO DISKTO-RPM-VALUE
*          Save the controller factor of convertto disk controller type
           SET CNT-TYPE-POWER-INDEX TO 1
           SEARCH CONTROLLER-TYPE-POWER-TABLE
             END
             PERFORM
                 MOVE COMPLETION-92 TO COMPLETION-MESSAGE
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
             WHEN CNT-TYPE-ALFA(CNT-TYPE-POWER-INDEX) = DISKTO-CNT-VALUE
             MOVE CNT-POWER(CNT-TYPE-POWER-INDEX) TO DISKTO-CNT-POWER-VALUE
           END-SEARCH
*          Save the convertto disk read access time to DISKTO-READ-SEEK-VALUE
           MOVE DISK-READSEEK (DISK-TYPE-POWER-CONVERTTO) TO DISKTO-READ-SEEK-VALUE
*          Save the convertto disk write access time to DISKTO-WRITE-SEEK-VALUE
           MOVE DISK-WRITESEEK (DISK-TYPE-POWER-CONVERTTO) TO DISKTO-WRITE-SEEK-VALUE
     END-IF.
     IF DEBUG-MODE PERFORM 2000-01-DISKCONVERT-TABLE.
* Soln 10-020415-8203 : end
*    GAG 21AUG98  IPM AAJ.   Do summary only after validation is done.
     SET C-WRITE-RUN-SUMMARY TO TRUE.
*----------------------------------------------------------------------------
 2000-01-CONVERT-TABLE.
     DISPLAY ">".
     DISPLAY "> CPU Power Table".
*    DISPLAY "> CPU, Type, Subtype, C Series, D Series.".
     DISPLAY "> CPU, Type, Subtype, IPU-Count, G Series Power Value.".
     DISPLAY ">".
     PERFORM VARYING CPU-TYPE-POWER-INDEX FROM 1 BY 1
             UNTIL CPU-TYPE-POWER-INDEX > CPU-POWER-TYPE-MAX
        DISPLAY    "> "
                   CPU-TYPE-ALFA(CPU-TYPE-POWER-INDEX)
                   " "
                   CPU-TYPE-NUMBER(CPU-TYPE-POWER-INDEX)
                   " "
                   CPU-SUBTYPE-NUMBER(CPU-TYPE-POWER-INDEX)
                   " "
*                  CPU-POWER-VALUE-CNN(CPU-TYPE-POWER-INDEX)
*                  " "
*                  CPU-POWER-VALUE-DNN(CPU-TYPE-POWER-INDEX)
                   CPU-IPUCOUNT-NUMBER(CPU-TYPE-POWER-INDEX)
                   " "
                   CPU-POWER-VALUE-GNN(CPU-TYPE-POWER-INDEX)
     END-PERFORM.
     DISPLAY ">".
*----------------------------------------------------------------------------
* Soln 10-020415-8203 : start
 2000-01-DISKCONVERT-TABLE.
     DISPLAY ">".
     DISPLAY "> CONTROLLER Table".
     DISPLAY "> CONTROLLER, Factor.".
     DISPLAY ">".
     PERFORM VARYING CNT-TYPE-POWER-INDEX FROM 1 BY 1
        UNTIL CNT-TYPE-POWER-INDEX > NO-CONTROLLER-TYPES
     DISPLAY    "> "
              CNT-TYPE-ALFA(CNT-TYPE-POWER-INDEX)
              " "
              CNT-POWER(CNT-TYPE-POWER-INDEX)
     END-PERFORM.
     DISPLAY ">".
     DISPLAY ">".
     DISPLAY "> DISK Power Table".
     DISPLAY "> DISK, Subtype, RPM, Controller, ReadSeekTime (ms) , WriteSeekTime (ms).".
     DISPLAY ">".
     PERFORM VARYING DISK-SUBTYPE-INDEX FROM 1 BY 1
             UNTIL DISK-SUBTYPE-INDEX > DISK-POWER-TYPE-MAX
        DISPLAY    "> "
                   DISK-TYPE-ALFA(DISK-SUBTYPE-INDEX)
                   " "
                   DISK-SUBTYPE-NUMBER(DISK-SUBTYPE-INDEX)
                   " "
                   DISK-RPM(DISK-SUBTYPE-INDEX)
                   " "
                   DISK-CONTROLLER(DISK-SUBTYPE-INDEX)
                   " "
                   DISK-READSEEK(DISK-SUBTYPE-INDEX)
                   " "
                   DISK-WRITESEEK(DISK-SUBTYPE-INDEX)
     END-PERFORM.
     DISPLAY ">".
* Soln 10-020415-8203 : end
*------------------------------------------------------------------
 2000-10-PROCESS-CONTROL-FILE.
* OPEN the control file
     ENTER "COBOLASSIGN" OF COBOLLIB
         USING     CONTROL-FILE,
                   STARTUP-TEXT,
         GIVING RESULT.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-02  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     OPEN INPUT CONTROL-FILE.
     SET NO-CONTROL-FILE-EOF TO TRUE.
     IF CONTROL-FILE-NOT-FOUND
        MOVE COMPLETION-88 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-IF.
* Read control file
     PERFORM 2010-READ-LOOP UNTIL CONTROL-FILE-EOF.
* If XP disk present, then DISKCONVERTTO to only SAS is allowed
     IF ACTUALDISK52-PRESENT OR XPDISKFACTOR-PRESENT
         IF NOT (DISKCONVERTTO-PRESENT AND SASDISK-FLAG = 1)
             MOVE COMPLETION-121 TO COMPLETION-MESSAGE
              PERFORM 9010-SPCOMPLETION
         END-IF
     END-IF.
* CLOSE the control file
     CLOSE CONTROL-FILE.
     SET CONTROL-FILE-CLOSED TO TRUE.
*----------------------------------------------------------------------------
 2000-20-DETERMINE-AUDIT.
     IF AUDIT-REPORT-YES
*        Split REPORT-LOCATION into collector and location
         PERFORM 2005-AUDIT-YES
     END-IF.
*----------------------------------------------------------------------------
 2000-30-SORT-MEASURE-TABLE.
* Sort Measure table in ascending order of start time.
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY MEASURE-MAX
         INDEX-1 BY MEASURE-INDEX
         INDEX-2 BY MEASURE-INDEX-2
         TABLE   BY MEASURE-TABLE
         TEMP    BY MEASURE-TEMP
         KEY     BY MEASURE-START.
*----------------------------------------------------------------------------
 2000-40-VALIDATE-CSV-LO-HI.
* CSVLO and CSVHI validation.
* Convert user supplied csvlo and csvhi to date time format.
* CSVLO must be smaller than CSVHI if supplied by user.
     IF CSVHI NOT ZERO
         ENTER TAL "INTERPRETTIMESTAMP"
           USING   CSVHI,
                   DATE-N-TIME
           GIVING RESULT-4
         MOVE CORR DATE-N-TIME TO CSVTIME
         MOVE CSVTIME TO REQ-CSVHI
     ELSE
         MOVE "NOT PROVIDED" TO REQ-CSVHI
     END-IF.
     IF CSVLO NOT ZERO
         ENTER TAL "INTERPRETTIMESTAMP"
           USING   CSVLO,
                   DATE-N-TIME
         GIVING RESULT-4
         MOVE CORR DATE-N-TIME TO CSVTIME
         MOVE CSVTIME TO REQ-CSVLO
     ELSE
        MOVE "NOT PROVIDED" TO REQ-CSVLO
     END-IF.
     IF (CSVHI NOT ZERO) AND (CSVLO NOT ZERO)
         IF CSVHI <= CSVLO
            MOVE COMPLETION-22 TO COMPLETION-MESSAGE
            PERFORM 9010-SPCOMPLETION
        END-IF
     END-IF.
*----------------------------------------------------------------------------
 2000-50-VALIDATE-MEASURE-FILES.
** Validate the Measure-files in the Measure-table.
    MOVE SPACES TO RUN-MEAS-FILE-ADV
                   RUN-SUM-MEASURE-TABLE
                   RUN-SUM-CSV-TABLE.
    PERFORM 2400-MEASURE-TABLE-SCAN
        VARYING TEMP-INDEX FROM 1 BY 1
        UNTIL TEMP-INDEX > MEASURE-MAX.
    IF NUM-VALID-FILES < 1
       SET C-EXIT-PROGRAM TO TRUE
       MOVE INFO-24 TO RUN-MEAS-FILE-ADV
    END-IF.
    IF DEBUG-MODE
       DISPLAY SPACE
       DISPLAY ">Measure Files Table"
       DISPLAY SPACE
       PERFORM
           VARYING TEMP-INDEX FROM 1 BY 1
           UNTIL TEMP-INDEX > MEASURE-MAX
               DISPLAY ">TABLE-INDEX   " TEMP-INDEX
               DISPLAY ">START         "
                   MEASURE-START OF MEASURE-TABLE(TEMP-INDEX)
               DISPLAY ">STOP          " MEASURE-STOP(TEMP-INDEX)
               DISPLAY ">INT           " MEASURE-INT(TEMP-INDEX)
               DISPLAY ">DATAFILE      " MEASURE-DATAFILE(TEMP-INDEX)
               DISPLAY ">DFNUM         " MEASURE-DFNUM(TEMP-INDEX)
               DISPLAY ">MEASFH        " MEASURE-MEASFH(TEMP-INDEX)
               DISPLAY ">SYSTEM-NUMBER " MEASURE-SYSTEM-NUMBER(TEMP-INDEX)
               DISPLAY ">VALID-FILE    " MEASURE-VALID-FILE(TEMP-INDEX)
               DISPLAY SPACE
       END-PERFORM
    END-IF.
    IF C-EXIT-PROGRAM
       MOVE COMPLETION-79 TO COMPLETION-MESSAGE
       PERFORM 9010-SPCOMPLETION
    END-IF.
*----------------------------------------------------------------------------
 2000-60-GET-START-STOP-TIMES.
* Convert actual start and stop times for run summary
    MOVE ZERO TO EARLIEST-START-TIME
                 LATEST-STOP-TIME.
    PERFORM
       VARYING MEASURE-INDEX FROM 1 BY 1
       UNTIL MEASURE-INDEX > MEASURE-MAX
        IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
           PERFORM 2000-62-START-AND-STOP
        END-IF
     END-PERFORM.
* Check if user-specified CSVHI > earliest start time.
    IF (CSVHI NOT ZERO)
      IF CSVHI <= EARLIEST-START-TIME
         MOVE COMPLETION-80 TO COMPLETION-MESSAGE
         MOVE INFO-23 TO RUN-SUM-CSV-LINE
         PERFORM 9010-SPCOMPLETION
      END-IF
    END-IF.
* Check if user-specified CSVLO > latest stop time.
    IF (CSVLO NOT ZERO)
      IF CSVLO >= LATEST-STOP-TIME
         MOVE COMPLETION-81 TO COMPLETION-MESSAGE
         MOVE INFO-23 TO RUN-SUM-CSV-LINE
         PERFORM 9010-SPCOMPLETION
      END-IF
    END-IF.
*----------------------------------------------------------------------------
 2000-62-START-AND-STOP.
    IF EARLIEST-START-TIME ZERO
       MOVE MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX)
              TO EARLIEST-START-TIME
    ELSE
        IF MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX)
            < EARLIEST-START-TIME
            MOVE MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX)
               TO EARLIEST-START-TIME
        END-IF
    END-IF.
    IF LATEST-STOP-TIME  < MEASURE-STOP(MEASURE-INDEX)
       MOVE MEASURE-STOP(MEASURE-INDEX) TO LATEST-STOP-TIME
    END-IF.
*----------------------------------------------------------------------------
 2000-70-GET-POSSIBLE-CSV-COUNT.
* Compute the number of CSV files possible.
* Set latest-stop-time to min(csvhi, latest-stop-time)
   IF CSVHI NOT ZERO
      IF CSVHI < LATEST-STOP-TIME
         MOVE CSVHI TO LATEST-STOP-TIME
      END-IF
   END-IF.
* Set earliest-start-time to max(csvlo, measure-start(1))
  IF CSVLO NOT ZERO
     IF CSVLO > EARLIEST-START-TIME
        MOVE CSVLO TO EARLIEST-START-TIME
     END-IF
  END-IF.
    ENTER TAL "INTERPRETTIMESTAMP"
       USING   EARLIEST-START-TIME,
               DATE-N-TIME
       GIVING RESULT-4.
    MOVE CORR DATE-N-TIME TO CSVTIME.
    MOVE CSVTIME TO ACT-CSVLO.
    ENTER TAL "INTERPRETTIMESTAMP"
       USING   LATEST-STOP-TIME,
               DATE-N-TIME
       GIVING RESULT-4.
    MOVE CORR DATE-N-TIME TO CSVTIME.
    MOVE CSVTIME TO ACT-CSVHI.
* Calculate the number of csv files possible. (LCM is the interval duration).
  COMPUTE TEMP-STORE = LATEST-STOP-TIME - EARLIEST-START-TIME.
  MOVE ZERO TO REM.
* GAG 98/11/23.   Check below was changed to > 0 instead of >= because of div by 0.
  IF LCM > 0
     DIVIDE TEMP-STORE BY LCM
        GIVING NUM-CSVS-POSSIBLE
        REMAINDER REM
     IF REM > ZERO AND NUM-CSVS-POSSIBLE = ZERO
        MOVE 1 TO NUM-CSVS-POSSIBLE
     END-IF
  ELSE
     MOVE 1 TO NUM-CSVS-POSSIBLE
  END-IF.
  IF NUM-CSVS-POSSIBLE > MAX-CSVS-POSSIBLE
     MOVE MAX-CSVS-POSSIBLE TO NUM-CSVS-POSSIBLE
  END-IF.
*----------------------------------------------------------------------------
 2000-80-GET-USER-CSV-COUNT.
* Check user specified number of csv files.
* If the user specifies max. possible csv files, generate the number as
* computed above. Otherwise, move the parameter to a numeric field and check
* the value against max possible. If it is greater than or equal to max
* possible, generate max possible, else re-compute the lcm to use it as
* the intervals for which the measure data files will be read.
  MOVE NUMBER-CSVS-ALPHA TO REQ-NUM-CSV.
  MOVE 1 TO NUM-OF-LCMS.
  IF C-DEFAULT-CSVS
     MOVE 1 TO NUM-CSVS-ACTUAL
  ELSE
     IF C-MAX-CSVS
         MOVE NUM-CSVS-POSSIBLE TO NUM-CSVS-ACTUAL
     ELSE
         PERFORM 2001-GET-NUMBER-CSVS
         MOVE NUMBER-CSVS TO NUM-CSVS-ACTUAL
         IF NUMBER-CSVS > 1
             IF NUMBER-CSVS < NUM-CSVS-POSSIBLE
*                Calculate the number of lcm(intervals) to form these files.
*                If the remainder is not zero, check if incrementing the
*                number of lcms will still result in the last csv file
*                starting before the latest stop time.
                 DIVIDE NUM-CSVS-POSSIBLE BY NUMBER-CSVS
                     GIVING NUM-OF-LCMS REMAINDER REM
                 IF (REM NOT ZERO) AND (LCM > 0)
                     COMPUTE TEMP-START =  EARLIEST-START-TIME +
                          ((NUM-OF-LCMS + 1)  * LCM * NUMBER-CSVS)
                     IF TEMP-START < LATEST-STOP-TIME
                         ADD 1 TO NUM-OF-LCMS
                     END-IF
                 END-IF
             ELSE
                MOVE NUM-CSVS-POSSIBLE TO NUM-CSVS-ACTUAL
             END-IF
         END-IF
     END-IF
  END-IF.
*  Move to run summary.
  MOVE NUM-CSVS-ACTUAL TO ACT-NUM-CSV.
  MOVE NUMBER-CSVS-ALPHA TO REQ-NUM-CSV.
  IF C-MAX-CSVS
     MOVE "MAX" TO REQ-NUM-CSV
  ELSE
    IF C-DEFAULT-CSVS
       MOVE "DEF" TO REQ-NUM-CSV
    END-IF
  END-IF.
  MOVE NUM-CSVS-POSSIBLE TO POSS-NUM-CSV.
  DISPLAY "Number of CSV Data files : ", ACT-NUM-CSV.
*----------------------------------------------------------------------------
 2000-90-GET-CSVDATA-NAMES.
* If no CSVDATA keyword was detected, supply the default name
     IF CSVDATA = LOW-VALUES MOVE "CSVDA" TO CSVDATA.
* Determine the position in the variable csvdata to append the file number.
* This is done by scanning the var. CSVDATA backwards till the first non-space
* character and "." character are found. The difference between the two byte
* locations is computed. If the difference is > 6 then the location for the
* number is set to the 6th byte from the location of "." character. If not the
* difference +1 from the location of "." is the byte position.
     MOVE ZERO TO LOC1, LOC2.
     PERFORM VARYING LOC-INDEX FROM 35 BY -1 UNTIL LOC-INDEX < 1
        IF LOC1  ZERO
           IF CSVDATA(LOC-INDEX:1) NOT = SPACES
               MOVE LOC-INDEX TO LOC1
           END-IF
        END-IF
        IF LOC2 ZERO
           IF CSVDATA(LOC-INDEX:1) = "."
              MOVE LOC-INDEX TO LOC2
           END-IF
        END-IF
      END-PERFORM.
      COMPUTE LOC-DIFF = LOC1 - LOC2.
      IF LOC-DIFF > 5
         COMPUTE POS = LOC2 + 6
      ELSE
         COMPUTE POS = LOC2 + LOC-DIFF + 1
      END-IF.
*----------------------------------------------------------------------------
 2000-100-APPLICATION-NAME.
* Application name is required
     IF I03 = LOW-VALUES
         MOVE COMPLETION-05 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
*----------------------------------------------------------------------------
 2000-110-PREPARE-CATEGORIES.
* TITLE-TABLE must be completely filled out (up to TITLE-MAX)
     SET TITLE-INDEX TO 1.
     SEARCH TITLE-TABLE
         WHEN TITLE-TYPE (TITLE-INDEX) = SPACE
             MOVE ZERO TO SCRATCH-NATIVE2
             MOVE TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX) TO SCRATCH-X
             MOVE SCRATCH-NATIVE2 TO NUMBER-DISPLAY
             STRING COMPLETION-46  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-SEARCH.
* Sort WKLD-TABLE in ascending order using the Heapsort algorithm
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY WKLD-MAX
         INDEX-1 BY WKLD-INDEX
         INDEX-2 BY WKLD-INDEX-2
         TABLE   BY WKLD-TABLE
         TEMP    BY WKLD-TEMP
         KEY     BY WKLD-SORT-KEY.
* Sort TITLE-TABLE in ascending order according to TITLE-NUMBER using the
* Heapsort algorithm
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY TITLE-MAX
         INDEX-1 BY TITLE-INDEX
         INDEX-2 BY TITLE-INDEX-2
         TABLE   BY TITLE-SORT-MOVE
         TEMP    BY TITLE-TEMP
         KEY     BY TITLE-NUMBER.
*----------------------------------------------------------------------------
 2000-120-ADD-CAT-98.
* Add category 98 (_OTHER)
     ADD 1 TO TITLE-MAX, WKLD-MAX.
     SET TITLE-INDEX TO TITLE-MAX.
     SET WKLD-INDEX TO WKLD-MAX.
     MOVE 98 TO SCRATCH-NATIVE2.
     MOVE SCRATCH-X TO TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX),
         WKLD-NUMBER (WKLD-INDEX).
     MOVE "O" TO TITLE-TYPE (TITLE-INDEX).
     MOVE "_OTHER" TO TITLE-NAME (TITLE-INDEX).
     MOVE WC-ASTERISK-NUM  TO WKLD-PIN              (WKLD-INDEX),
                              WKLD-SYSTEM           (WKLD-INDEX),
                              WKLD-CPU              (WKLD-INDEX).
     MOVE WC-ASTERISK-ALFA TO WKLD-PROCESS-NAME     (WKLD-INDEX),
                              WKLD-PROGRAM-FILENAME (WKLD-INDEX),
                              WKLD-PROGRAM-FILENAME (WKLD-INDEX) (9:1),
                              WKLD-PROGRAM-FILENAME (WKLD-INDEX) (17:1),
                              WKLD-USERID-FLAG      (WKLD-INDEX).
*----------------------------------------------------------------------------
 2000-130-ADD-CAT-99.
* Add category 99 (_ERROR)
     ADD 1 TO TITLE-MAX, WKLD-MAX.
     SET TITLE-INDEX TO TITLE-MAX.
     SET WKLD-INDEX TO WKLD-MAX.
     MOVE 99 TO SCRATCH-NATIVE2.
     MOVE SCRATCH-X TO TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX),
         WKLD-NUMBER (WKLD-INDEX).
     MOVE "O" TO TITLE-TYPE (TITLE-INDEX).
     MOVE "_ERROR" TO TITLE-NAME (TITLE-INDEX).
*----------------------------------------------------------------------------
 2000-140-INITIALISE-CSV-AREAS.
* Initialize CSV-W-BINARY
     PERFORM
         VARYING TITLE-INDEX FROM 1 BY 1
         UNTIL TITLE-INDEX > TITLE-MAX
         INITIALIZE CSV-W-BINARY (TITLE-INDEX)
     END-PERFORM.
*----------------------------------------------------------------------------
 2000-150-DEBUG.
* Display debug-fields
     IF DEBUG-MODE DISPLAY ">MEASURE-MAX: ", MEASURE-MAX,
                           " VERSION-MAX: ", VERSION-MAX,
                           " WKLD-MAX: "   , WKLD-MAX   ,
                           " TITLE-MAX: "  , TITLE-MAX  ,
                           " TXN-MAX: "    , TXN-MAX    ,
                           " SYSTEM-MAX: " , SYSTEM-MAX
     END-IF.
*----------------------------------------------------------------------------
 2001-GET-NUMBER-CSVS.
     UNSTRING NUMBER-CSVS-ALPHA DELIMITED SPACES INTO NUMBER-CSVS.
     IF NUMBER-CSVS NOT NUMERIC
        MOVE COMPLETION-83 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     ELSE
        IF NUMBER-CSVS < 1
           MOVE COMPLETION-84 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
        END-IF
     END-IF.
*----------------------------------------------------------------------------
 2005-AUDIT-YES.
     ENTER TAL "FNAMEEXPAND"
         USING     REPORT-LOCATION,
                   INTERNAL-FILENAME,
                   DEFAULT-NAMES
         GIVING RESULT.
     IF RESULT ZERO
        MOVE COMPLETION-64 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-IF.
     ENTER "COBOLASSIGN" OF COBOLLIB
         USING     SPOOLER-FILE,
                   PART1 OF INTERNAL-FILENAME
         GIVING RESULT.
     IF RESULT NOT ZERO
        MOVE RESULT TO NUMBER-DISPLAY
        STRING COMPLETION-65  DELIMITED SIZE
            SPACE          DELIMITED SIZE
            NUMBER-DISPLAY DELIMITED SIZE
            INTO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-IF.
* Open the Spooler (level 3)
     ENTER "COBOL85^SPECIAL^OPEN" OF CBL85UTL
         USING     SPOOLER-FILE,
                   OMITTED,
                   ZERO,
                   OMITTED,
                   1,
                   1,
                   QUALIFIERS
         GIVING RESULT.
     IF RESULT NOT ZERO
        MOVE RESULT TO NUMBER-DISPLAY
        STRING COMPLETION-66  DELIMITED SIZE
               SPACE          DELIMITED SIZE
               NUMBER-DISPLAY DELIMITED SIZE
               INTO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-IF.
     SET C-SPOOL-FILE-OPEN TO TRUE.
*----------------------------------------------------------------------------
 2010-READ-LOOP.
* Read and process the next record in the control file
     READ CONTROL-FILE
       AT END
         SET CONTROL-FILE-EOF TO TRUE
     END-READ.
* Process record but ignore comment lines
* Count the number of blank spaces before the keyword in the control-file-
* record. Remove the blank spaces by left-shifting the record by the counted
* number of characters. Soln 10-001222-8124.
     IF NOT CONTROL-FILE-EOF
       MOVE 0 TO COUNT-OF-BLANKS
       IF CONTROL-FILE-RECORD (1:1) = SPACES
         PERFORM VARYING TEMP-COUNTER FROM 1 BY 1
            UNTIL CONTROL-FILE-RECORD (TEMP-COUNTER : 1) NOT = SPACES
               OR TEMP-COUNTER >= 80
           ADD 1 TO COUNT-OF-BLANKS
         END-PERFORM
         IF COUNT-OF-BLANKS < 80
          MOVE SPACES TO TEMP-RECORD-BUFFER
          MOVE CONTROL-FILE-RECORD (COUNT-OF-BLANKS + 1 : 80 - COUNT-OF-BLANKS)
          TO TEMP-RECORD-BUFFER (1 : 80 - COUNT-OF-BLANKS)
          MOVE SPACES TO CONTROL-FILE-RECORD
          MOVE TEMP-RECORD-BUFFER TO CONTROL-FILE-RECORD
         END-IF
       END-IF
     END-IF.
* End of code changes of Soln 10-001222-8124.
     IF NOT CONTROL-FILE-EOF
         IF NOT CONTROL-FILE-RECORD (1:1) COMMENT-CHARS
           PERFORM 2020-PROCESS-CONTROL-RECORD
         END-IF
     END-IF.
*----------------------------------------------------------------------------
 2020-PROCESS-CONTROL-RECORD.
* Upshift all alphabetic characters
     INSPECT CONTROL-FILE-RECORD CONVERTING
         "abcdefghijklmnopqrstuvwxyz" TO "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
* Get the different parts of the record
     MOVE SPACES TO input-fields.
     UNSTRING CONTROL-FILE-RECORD DELIMITED ALL SPACE INTO
         KEYWORD, PARAMETER1, PARAMETER2, PARAMETER3, PARAMETER4, PARAMETER5, PARAMETER6.
* Check for keywords
     IF KEYWORD(1:4) = "WKLD" OR "PCAT"
         MOVE "WKLD" TO CASE-KEYWORD
     ELSE
         IF KEYWORD(1:5) = "TITLE"
             MOVE "TITLE" TO CASE-KEYWORD
         ELSE
             MOVE KEYWORD TO CASE-KEYWORD
         END-IF
     END-IF.
     EVALUATE CASE-KEYWORD
       WHEN "MEASURE"    PERFORM 2100-MEASURE-INPUT
       WHEN "CSVDATA"    PERFORM 2110-CSVDATA-INPUT
       WHEN "CSVLO"      PERFORM 2120-CSVLO-INPUT
       WHEN "CSVHI"      PERFORM 2130-CSVHI-INPUT
       WHEN "APPL"       PERFORM 2140-APPL-INPUT
       WHEN "WKLD"       PERFORM 2160-WKLD-INPUT
       WHEN "TITLE"      PERFORM 2170-TITLE-INPUT
       WHEN "TXN"        PERFORM 2180-TXN-INPUT
       WHEN "REPORT"     PERFORM 2190-REPORT-INPUT
       WHEN "CONVERTTO"  PERFORM 2200-CONVERTTO-INPUT
       WHEN "CPUFACTOR"  PERFORM 2220-CPUFACTOR-INPUT
       WHEN "NUMCSVS"    PERFORM 2230-NUMCSVS-INPUT
* Soln 10-020415-8203 : start
       WHEN "DISKCONVERTTO"  PERFORM 2240-DISKCONVERTTO-INPUT
       WHEN "DISKFACTOR"     PERFORM 2250-DISKFACTOR-INPUT
       WHEN "ACTUALDISK42"   PERFORM 2260-ACTUALDISK42-INPUT
       WHEN "ACTUALDISK43"   PERFORM 2270-ACTUALDISK43-INPUT
       WHEN "ACTUALDISK44"   PERFORM 2280-ACTUALDISK44-INPUT
* Soln 10-020415-8203 : END
*------------MeasTCM Yosemite Change----Start-----------
* For JBOD (SubType = 53) Disk models.
       WHEN "ACTUALDISK53"   PERFORM 2290-ACTUALDISK53-INPUT
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for CEP RFE.
* Added for SAS disk models (Subtype = 51).
       WHEN "ACTUALDISK51"   PERFORM 2450-ACTUALDISK51-INPUT
* Added for XP disk (Subtype = 52).
       WHEN "ACTUALDISK52"   PERFORM 2460-ACTUALDISK52-INPUT
       WHEN "XPDISKFACTOR"   PERFORM 2470-XPDISKFACTOR-INPUT
       WHEN "NUMTMFTRAIL"    PERFORM 2500-NUMTMFTRAIL-INPUT
* End of code change for CEP RFE.
       WHEN OTHER        PERFORM 2210-INVALID-KEYWORD
     END-EVALUATE.
*----------------------------------------------------------------------------
 2100-MEASURE-INPUT.
* Keyword MEASURE detected
* Expand the specified data file name to the standard 12-word internal form
     ENTER TAL "FNAMEEXPAND"
       USING   PARAMETER1,
               INTERNAL-FILENAME,
               DEFAULT-NAMES
       GIVING RESULT.
     IF RESULT ZERO
         MOVE COMPLETION-31 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Add data file name to MEASURE-TABLE
     SET MEASURE-INDEX TO 1.
     SEARCH MEASURE-TABLE
         END
             PERFORM
                 IF MEASURE-MAX = MEASURE-CEILING
*                      Too many measure data files
                     MOVE COMPLETION-57 TO COMPLETION-MESSAGE
                     PERFORM 9010-SPCOMPLETION
                 END-IF
                 ADD 1 TO MEASURE-MAX
                 SET MEASURE-INDEX TO MEASURE-MAX
                 MOVE INTERNAL-FILENAME TO MEASURE-DATAFILE (MEASURE-INDEX)
                 MOVE PARAMETER1 TO MEASURE-EXTERNAL-NAME (MEASURE-INDEX)
                 MOVE ZERO TO MEASURE-DFNUM (MEASURE-INDEX)
             END-PERFORM
         WHEN MEASURE-DATAFILE (MEASURE-INDEX) = INTERNAL-FILENAME
*             Duplicate file name detected
             MOVE COMPLETION-32 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-SEARCH.
* Check measfh file name
     IF PARAMETER2 = "!" OR PARAMETER2 = SPACES
         MOVE SPACES TO PARAMETER2, MEASURE-MEASFH (MEASURE-INDEX)
     END-IF.
     IF PARAMETER2 NOT = SPACES
*        Expand the specified measfh file name to the standard 12-word
*        internal form
         ENTER TAL "FNAMEEXPAND"
           USING   PARAMETER2,
                   INTERNAL-FILENAME,
                   DEFAULT-NAMES
           GIVING RESULT
         IF RESULT ZERO
             MOVE COMPLETION-48 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
         END-IF
*        Add measfh file name to MEASURE-TABLE
         MOVE INTERNAL-FILENAME TO MEASURE-MEASFH (MEASURE-INDEX)
     END-IF.
* Open measure data file
     DISPLAY INFO-04, SPACE, PARAMETER1.
     IF MEASURE-MEASFH (MEASURE-INDEX) = SPACES
         ENTER TAL "MEASOPEN"
           USING   MEASURE-DATAFILE (MEASURE-INDEX),
                   MEASURE-DFNUM (MEASURE-INDEX),
                   ZERO,
                   -1
           GIVING RESULT
     ELSE
         ENTER TAL "MEASOPEN"
           USING   MEASURE-DATAFILE (MEASURE-INDEX),
                   MEASURE-DFNUM (MEASURE-INDEX),
                   ZERO,
                   -1,
                   MEASURE-MEASFH (MEASURE-INDEX)
           GIVING RESULT
     END-IF.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-49  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Determine version of measure data file and system name
     ENTER TAL "MEASGETVERSION"
           USING   MEASURE-DATAFILE (MEASURE-INDEX),
                   OMITTED,
                   DFVERSION,
                   ENTITY-LENGTH-BUFFER,
                   ENT-BUF-LEN,
                   SYSNAME
           GIVING RESULT.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-51  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Data file version has to be at least G02
*    IF DFVERSION < C10
     IF DFVERSION < G02
         MOVE COMPLETION-30 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Note highest guardian series for power conversion formulas.
* Need either C, or D for D and above.
*Removed as part of CEP RFE
*     IF DFVERSION < D00
*        MOVE "C" TO CONVERT-GUARDIAN-SAVE
*     ELSE
*        MOVE "D" TO CONVERT-GUARDIAN-SAVE
*     END-IF.
*     IF CONVERT-GUARDIAN-SAVE = "D"
*         MOVE "D" TO CONVERT-GUARDIAN-VERSION
*     END-IF.
*------------MeasTCM Yosemite Change----Start-----------
* Check for YOSEMITE Measure Datafile.
* Modified IF condition for Soln:10-100304-8526
    IF DFVERSION >= H01 AND DFVERSION <= H06
        MOVE "Y" TO YOSEMITE-DATAFILE
    ELSE
        MOVE "N" TO YOSEMITE-DATAFILE
    END-IF.
*------------MeasTCM Yosemite Change-----End------------
* Obtain pseudo system number
     SET SYSTEM-INDEX TO 1.
     SEARCH SYSTEM-TABLE
         END
*            System does not exist yet: insert it into SYSTEM-TABLE
             PERFORM 2102-SYSTEM
         WHEN SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) = SYSNAME
*            Check to make sure that DFVERSION equals SYSTEM-VERSION
             IF DFVERSION NOT = SYSTEM-VERSION (SYSTEM-INDEX)
                 MOVE COMPLETION-60 TO COMPLETION-MESSAGE
                 PERFORM 9010-SPCOMPLETION
             END-IF
     END-SEARCH.
     SET MEASURE-SYSTEM-NUMBER (MEASURE-INDEX) TO SYSTEM-INDEX.
* Get the start and stop times and interval for this Measure data file
     ENTER TAL "MEASREADCONF"
           USING   MEASURE-DFNUM(MEASURE-INDEX),
                   MEASREAD-BUFFER,
                   MEASREAD-BUFFER-LENGTH,
                   BYTESRET,
                   MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX),
                   MEASURE-STOP(MEASURE-INDEX),
                   MEASURE-INT(MEASURE-INDEX),
                   ENTITIES,
                   CTRSPACE,
                   DFVERSION
           GIVING  RESULT.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">MEASURE "       , MEASURE-MAX          ,
                 ": dfnum "        , MEASURE-DFNUM (MEASURE-INDEX),
                 ", system number ", MEASURE-SYSTEM-NUMBER (MEASURE-INDEX)
     END-IF.
*----------------------------------------------------------------------------
 2102-SYSTEM.
     ADD 1 TO SYSTEM-MAX.
     IF SYSTEM-MAX > SYSTEM-CEILING
*       Too many different system names; this should never
*       occur as long as  MEASURE-CEILING = SYSTEM-CEILING
         STRING COMPLETION-54     DELIMITED SIZE
                " (SYSTEM-TABLE)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET SYSTEM-INDEX TO SYSTEM-MAX.
     MOVE SYSNAME TO SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX).
     MOVE DFVERSION TO SYSTEM-VERSION (SYSTEM-INDEX).
*    Display debug fields
     IF DEBUG-MODE
         DISPLAY ">SYSTEM "          , SYSTEM-MAX     ,
                 ": system name "    , SYSNAME        ,
                 ", measure version ", DFVERSION
     END-IF.
*    Check if measurement version is already defined in
*    VERSION-TABLE; if not, insert it !
     SET version-index TO 1.
     SEARCH VERSION-TABLE
         END
             PERFORM 2104-MEASURE-VERSION
         WHEN VERSION-VALUE (VERSION-INDEX) = DFVERSION
             CONTINUE
     END-SEARCH.
*----------------------------------------------------------------------------
 2104-MEASURE-VERSION.
     ADD 1 TO VERSION-MAX.
     IF VERSION-MAX > VERSION-CEILING
*        Too many different measure versions
         STRING COMPLETION-54      DELIMITED SIZE
                " (VERSION-TABLE)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET VERSION-INDEX TO VERSION-MAX.
     MOVE DFVERSION TO VERSION-VALUE (VERSION-INDEX).
     MOVE CORR ENTITY-LENGTHS TO
         VERSION-ENTITY-LENGTHS (VERSION-INDEX).
*    Display debug fields
     IF DEBUG-MODE
         DISPLAY
             ">VERSION ", VERSION-MAX  ,
             ": "       ,
             VERSION-VALUE (VERSION-INDEX)
     END-IF.
*----------------------------------------------------------------------------
 2110-CSVDATA-INPUT.
* Keyword CSVDATA detected
* Check for duplicates
     IF CSVDATA NOT = LOW-VALUES
         MOVE COMPLETION-06 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     IF PARAMETER1 = SPACES OR PARAMETER1 (1:1) = "!"
         MOVE COMPLETION-47 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     MOVE PARAMETER1 TO CSVDATA.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">CSVDATA: ", CSVDATA
     END-IF.
*----------------------------------------------------------------------------
 2120-CSVLO-INPUT.
* Keyword CSVLO detected
* Check for duplicates
     IF CSVLO NOT ZERO
         MOVE COMPLETION-07 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check that date and time are numeric
     MOVE PARAMETER1 TO CSVTIME.
     IF    YEAR    OF CSVTIME NOT NUMERIC OR
           MONTH   OF CSVTIME NOT NUMERIC OR
           DDAY    OF CSVTIME NOT NUMERIC OR
           HOURS   OF CSVTIME NOT NUMERIC OR
           MINUTES OF CSVTIME NOT NUMERIC OR
           SECONDS OF CSVTIME NOT NUMERIC
         MOVE COMPLETION-08 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Compute timestamp
     MOVE CORR CSVTIME TO DATE-N-TIME.
     ENTER TAL "COMPUTETIMESTAMP" USING DATE-N-TIME, RESULT GIVING CSVLO.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-25  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Display debug fields
     IF DEBUG-MODE
        MOVE CORR CSVTIME TO I04
        MOVE CORR CSVTIME TO I05
        DISPLAY ">CSVLO: ", I04, SPACE, I05
     END-IF.
*----------------------------------------------------------------------------
 2130-CSVHI-INPUT.
* Keyword CSVHI detected
* Check for duplicates
     IF CSVHI NOT ZERO
         MOVE COMPLETION-09 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check that date and time are numeric
     MOVE PARAMETER1 TO CSVTIME.
     IF    YEAR    OF CSVTIME NOT NUMERIC OR
           MONTH   OF CSVTIME NOT NUMERIC OR
           DDAY    OF CSVTIME NOT NUMERIC OR
           HOURS   OF CSVTIME NOT NUMERIC OR
           MINUTES OF CSVTIME NOT NUMERIC OR
           SECONDS OF CSVTIME NOT NUMERIC
         MOVE COMPLETION-10 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Compute timestamp
     MOVE CORR CSVTIME TO DATE-N-TIME.
     ENTER TAL "COMPUTETIMESTAMP" USING DATE-N-TIME, RESULT GIVING CSVHI.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-26  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Display debug fields
     IF DEBUG-MODE
        MOVE CORR CSVTIME TO I06
        MOVE CORR CSVTIME TO I07
        DISPLAY ">CSVHI: ", I06, SPACE, I07
     END-IF.
*----------------------------------------------------------------------------
 2140-APPL-INPUT.
* Keyword APPL detected
* Check for duplicates
     IF I03 NOT = LOW-VALUES
         MOVE COMPLETION-11 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     IF PARAMETER1 = SPACES OR PARAMETER1 (1:1) = "!"
         MOVE COMPLETION-12 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Application name should start with a letter
     IF PARAMETER1 (1:1) < "A" OR PARAMETER1 (1:1) > "Z"
         MOVE COMPLETION-73 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
*Start of Change-Validation Check for 20 chars
     UNSTRING PARAMETER1 DELIMITED BY ALL SPACES INTO APPL-INPUT-T1
     IF APPL-INPUT-T1 (1:1) NOT EQUAL SPACES
         MOVE COMPLETION-73 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
*End of Change-Validation Check for 20 chars
* Move result to CSV I-record and P-TITLE-1
     MOVE PARAMETER1 TO I03, P-APPLICATION.
* Display debug fields
     IF DEBUG-MODE DISPLAY ">APPL: ", I03.
*----------------------------------------------------------------------------
 2160-WKLD-INPUT.
* Keyword WKLD or PCAT detected
* WKLD keywords must precede TITLE keywords
     IF TITLE-DETECTED
         MOVE COMPLETION-45 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     ADD 1 TO WKLD-MAX.
* Maximum (WKLD-CEILING - 2) WKLD entries are allowed in the control file
     IF WKLD-MAX > WKLD-CEILING - 2
         MOVE COMPLETION-58 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Obtain category number
     MOVE KEYWORD (5:2) TO SCRATCH-99.
     IF SCRATCH-99 NOT NUMERIC
         STRING COMPLETION-23 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (5:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Maximum user-defined category number is 97
     IF SCRATCH-99 > 97
         STRING COMPLETION-18 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (5:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Store new WKLD-NUMBER
     SET WKLD-INDEX TO WKLD-MAX.
     MOVE SCRATCH-99 TO SCRATCH-NATIVE2.
     MOVE SCRATCH-X TO WKLD-NUMBER (WKLD-INDEX).
* Check if corresponding TITLE-NUMBER already exists.
     SET TITLE-INDEX TO 1.
     SEARCH TITLE-TABLE
         END
             PERFORM 2161-NEW-TITLE
         WHEN WKLD-NUMBER (WKLD-INDEX) =
                TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX)
             NEXT SENTENCE
     END-SEARCH.
* Display debug field
     IF DEBUG-MODE
         DISPLAY ">WKLD", KEYWORD (5:2), " :" NO ADVANCING
     END-IF.
* Split PARAMETER1 into system, CPU, PIN
     MOVE SPACES TO WKLD-LINE, INTERNAL-FILENAME.
*Start of Change-Validation Check for 8 chars Node name
*     UNSTRING PARAMETER1 DELIMITED ",", OR SPACE INTO L-SYSTEM, L-CPU, L-PIN.
     UNSTRING PARAMETER1 DELIMITED ",", OR SPACE INTO TEMP-L-SYSTEM, L-CPU, L-PIN.
      IF TEMP-L-SYSTEM (9:1) NOT EQUAL SPACES
          PERFORM 2300-INVALID-NODE-NAME
      END-IF
      MOVE TEMP-L-SYSTEM TO L-SYSTEM
*End of Change-Validation Check for 8 chars Node name
* Check if system equals "*", in that case
* move WC-ASTERISK-NUM to WKLD-SYSTEM
     IF L-SYSTEM = "*"
         MOVE WC-ASTERISK-NUM TO WKLD-SYSTEM (WKLD-INDEX)
     ELSE
*        Check for a valid system name
         PERFORM 2162-SYSTEM
     END-IF.
* Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, WKLD-SYSTEM (WKLD-INDEX) NO ADVANCING
     END-IF.
* Check if CPU equals "*", in that case move WC-ASTERISK-NUM to WKLD-CPU
     IF L-CPU = " *"
         MOVE WC-ASTERISK-NUM TO WKLD-CPU (WKLD-INDEX)
     ELSE
*        Check for a valid CPU number
         PERFORM 2163-CPU
     END-IF.
* Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, WKLD-CPU (WKLD-INDEX) NO ADVANCING
     END-IF.
* Check if PIN equals "*", in that case move WC-ASTERISK-NUM to WKLD-PIN
     IF L-PIN = "    *"
         MOVE WC-ASTERISK-NUM TO WKLD-PIN (WKLD-INDEX)
     ELSE
*        Check for a valid PIN number
         PERFORM 2164-PIN
     END-IF.
* Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, SCRATCH-99999 NO ADVANCING
     END-IF.
* Do an elementary check for a valid process name
     IF PARAMETER2 NOT WC-FILENAME
         STRING COMPLETION-36 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (5:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Store WKLD-PROCESS-NAME
     MOVE PARAMETER2 TO WKLD-PROCESS-NAME (WKLD-INDEX).
* Replace * by WC-ASTERISK-ALFA and ? by WC-QUESTION
     INSPECT WKLD-PROCESS-NAME (WKLD-INDEX)
         REPLACING FIRST "*" BY WC-ASTERISK-ALFA, ALL "?" BY WC-QUESTION.
* Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, PARAMETER2 (1:8) NO ADVANCING
     END-IF.
* Split PARAMETER3 into the different file name parts
     UNSTRING PARAMETER3 DELIMITED "." INTO PART1 OF INTERNAL-FILENAME,
         PART2 OF INTERNAL-FILENAME, PART3 OF INTERNAL-FILENAME.
* Do an elementary check for a valid file name
     IF    INTERNAL-FILENAME NOT WC-FILENAME   OR
           PART1 OF INTERNAL-FILENAME = SPACES OR
           PART2 OF INTERNAL-FILENAME = SPACES OR
           PART3 OF INTERNAL-FILENAME = SPACES
         STRING COMPLETION-37 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (5:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Store WKLD-PROGRAM-FILENAME
     MOVE INTERNAL-FILENAME TO WKLD-PROGRAM-FILENAME (WKLD-INDEX).
* Replace * by WC-ASTERISK-ALFA and ? by WC-QUESTION
     INSPECT WKLD-PROGRAM-FILENAME (WKLD-INDEX)
         REPLACING ALL "*" BY WC-ASTERISK-ALFA, ALL "?" BY WC-QUESTION.
* Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, INTERNAL-FILENAME NO ADVANCING
     END-IF.
* Split PARAMETER4 into the different userid parts
     UNSTRING PARAMETER4 DELIMITED ",", OR SPACE INTO L-GROUP, L-USER.
* Check if group equals "*", in that case move "G" to WKLD-USERID-FLAG.
* The table WKLD-USERID-FLAG is used to represent the fact that group and/or
* user might be anything ("*"):
*    if the value is " " ----------------> group and user are defined
*    if the value is "G" ----------------> only group is defined
*    if the value is "U" ----------------> only user is defined
*    if the value is WC-ASTERISK-ALFA ---> group and user can be anything
     IF L-GROUP = "  *"
         MOVE WC-ASTERISK-ALFA TO WKLD-USERID-FLAG (WKLD-INDEX)
*        Display debug field
         IF DEBUG-MODE
             DISPLAY "    -1" NO ADVANCING
         END-IF
     ELSE
*        Check for a valid group number
         PERFORM 2166-GROUP
     END-IF.
     IF L-USER = "  *"
*        Display debug field
         IF DEBUG-MODE
             DISPLAY "    -1"
         END-IF
     ELSE
*        Check for a valid user number
         PERFORM 2168-USER
     END-IF.
*----------------------------------------------------------------------------
 2161-NEW-TITLE.
*    Insert the new TITLE-NUMBER
     ADD 1 TO TITLE-MAX.
     IF TITLE-MAX > TITLE-CEILING
*        This should never occur !
         STRING COMPLETION-54    DELIMITED SIZE
                " (TITLE-TABLE)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET TITLE-INDEX TO TITLE-MAX.
     MOVE WKLD-NUMBER (WKLD-INDEX) TO
         TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX).
     MOVE SPACE TO TITLE-TYPE (TITLE-INDEX).
*----------------------------------------------------------------------------
 2162-SYSTEM.
*Start of Change-Validation Check for \ in Node name
      IF L-SYSTEM (1:1) NOT EQUAL "\"
          PERFORM 2300-INVALID-NODE-NAME
      END-IF
*End of Change-Validation Check for \ in Node name
      IF L-SYSTEM = SPACES OR L-SYSTEM NOT NODE-NAME
          PERFORM 2300-INVALID-NODE-NAME
      END-IF.
*     Check if system name exists
      SET SYSTEM-INDEX TO 1.
      SEARCH SYSTEM-TABLE
*         If name is not defined, no processes will fit into this
*           category; so let's just move a ZERO into WKLD-SYSTEM
          END MOVE ZERO TO WKLD-SYSTEM (WKLD-INDEX)
          WHEN SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) = L-SYSTEM
              SET WKLD-SYSTEM (WKLD-INDEX) TO SYSTEM-INDEX
      END-SEARCH.
*----------------------------------------------------------------------------
 2163-CPU.
     IF L-CPU = SPACES
         PERFORM 2310-INVALID-CPU-NUMBER
     END-IF.
     INSPECT L-CPU REPLACING LEADING SPACE BY ZERO.
     MOVE L-CPU TO SCRATCH-99.
     IF SCRATCH-99 NOT NUMERIC
         PERFORM 2310-INVALID-CPU-NUMBER
     END-IF.
     IF SCRATCH-99 > 15
         PERFORM 2310-INVALID-CPU-NUMBER
     END-IF.
*    Store WKLD-CPU
     MOVE SCRATCH-99 TO WKLD-CPU (WKLD-INDEX).
*----------------------------------------------------------------------------
 2164-PIN.
     IF L-PIN = SPACES
         PERFORM 2320-INVALID-PIN-NUMBER
     END-IF.
     INSPECT L-PIN REPLACING LEADING SPACE BY ZERO.
     MOVE L-PIN TO SCRATCH-99999.
*Start of Change-Validation Check for PIN;should be numeric between 0 to 255
*    IF SCRATCH-99999 NOT NUMERIC
     IF SCRATCH-99999 NOT NUMERIC OR (SCRATCH-99999 < 00000 OR SCRATCH-99999 > 00255)
*End of Change-Validation Check for PIN;should be numeric between 0 to 255
         PERFORM 2320-INVALID-PIN-NUMBER
     END-IF.
*    Store WKLD-PIN
     MOVE SCRATCH-99999 TO WKLD-PIN (WKLD-INDEX).
*----------------------------------------------------------------------------
 2166-GROUP.
     IF L-GROUP = SPACES
         PERFORM 2330-INVALID-GROUP
     END-IF.
     INSPECT L-GROUP REPLACING LEADING SPACE BY ZERO.
     MOVE L-GROUP TO SCRATCH-999.
     IF SCRATCH-999 NOT NUMERIC
         PERFORM 2330-INVALID-GROUP
     END-IF.
     IF SCRATCH-999 > 255
         PERFORM 2330-INVALID-GROUP
     END-IF.
     MOVE GROUP-DEFINED TO WKLD-USERID-FLAG (WKLD-INDEX).
*    Store WKLD-GROUP
     MOVE SCRATCH-999 TO SCRATCH-NATIVE2.
     MOVE SCRATCH-X TO WKLD-GROUP (WKLD-INDEX).
*    Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, SCRATCH-NATIVE2 NO ADVANCING
     END-IF.
*----------------------------------------------------------------------------
 2168-USER.
     IF L-USER = SPACES
         PERFORM 2340-INVALID-USER
     END-IF.
     INSPECT L-USER REPLACING LEADING SPACE BY ZERO.
     MOVE L-USER TO SCRATCH-999.
     IF SCRATCH-999 NOT NUMERIC
         PERFORM 2340-INVALID-USER
     END-IF.
     IF SCRATCH-999 > 255
         PERFORM 2340-INVALID-USER
     END-IF.
*    Store WKLD-USER
     MOVE SCRATCH-999 TO SCRATCH-NATIVE2.
     MOVE SCRATCH-X TO WKLD-USER (WKLD-INDEX).
*    Check contents of WKLD-USERID-FLAG
     IF WKLD-USERID-FLAG (WKLD-INDEX) = WC-ASTERISK-ALFA
*        In this case the group was not defined
         MOVE USER-DEFINED TO WKLD-USERID-FLAG (WKLD-INDEX)
     ELSE
*        In this case the group was also defined
         MOVE SPACE TO WKLD-USERID-FLAG (WKLD-INDEX)
     END-IF.
*    Display debug field
     IF DEBUG-MODE
         DISPLAY SPACE, SCRATCH-NATIVE2
     END-IF.
*----------------------------------------------------------------------------
 2170-TITLE-INPUT.
* Keyword TITLE detected
     SET TITLE-DETECTED TO TRUE.
* Obtain category number
     MOVE KEYWORD (6:2) TO SCRATCH-99.
     IF SCRATCH-99 NOT NUMERIC
         STRING COMPLETION-39 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (6:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Make sure that TITLE-NUMBER is already there
     MOVE SCRATCH-99 TO SCRATCH-NATIVE2.
     SET TITLE-INDEX TO 1.
     SEARCH TITLE-TABLE
         END
             PERFORM
                 STRING COMPLETION-40 DELIMITED SIZE
                        SPACE         DELIMITED SIZE
                        KEYWORD (6:2) DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX) = SCRATCH-X
             NEXT SENTENCE
     END-SEARCH.
* Check that no two TITLE entries with the same number exist
     IF TITLE-TYPE (TITLE-INDEX) NOT = SPACE
         STRING COMPLETION-41 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (6:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Split PARAMETER1 into category type and name
     MOVE SPACES TO L-TITLE.
*Change-Validation check-modified parameter L-TITILE to TEMP-L-TITLE
     UNSTRING PARAMETER1 DELIMITED "," , OR SPACE
         INTO TITLE-TYPE (TITLE-INDEX), TEMP-L-TITLE.
* Verify category type
     IF NOT TITLE-TYPE (TITLE-INDEX) VALID-CATEGORY-TYPES
         STRING COMPLETION-15 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (6:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check for a valid category name
*Start of change-Validation added for TITLE entry
     IF TEMP-L-TITLE (9:1) NOT EQUAL SPACES
         STRING COMPLETION-16 DELIMITED SIZE
                         SPACE         DELIMITED SIZE
                         KEYWORD (6:2) DELIMITED SIZE
                         INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF
     MOVE TEMP-L-TITLE TO L-TITLE
*End of change-Validation added for TITLE entry
     IF L-TITLE = SPACES     OR
        L-TITLE (1:1) = "!"  OR
        L-TITLE = "_OTHER"   OR
        L-TITLE = "_ERROR"
         STRING COMPLETION-16 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                KEYWORD (6:2) DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check that the same category name is not already used
     SET TITLE-INDEX-2 TO 1.
     SEARCH TITLE-TABLE VARYING TITLE-INDEX-2
         WHEN TITLE-NAME (TITLE-INDEX-2) = L-TITLE
             STRING COMPLETION-17 DELIMITED SIZE
                    SPACE         DELIMITED SIZE
                    KEYWORD (6:2) DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-SEARCH.
* Store TITLE-NAME
     MOVE L-TITLE TO TITLE-NAME (TITLE-INDEX).
* Display debug fields
     IF DEBUG-MODE DISPLAY ">TITLE", KEYWORD (6:2), ": ",
         TITLE-TYPE (TITLE-INDEX), SPACE
         TITLE-NAME (TITLE-INDEX)
     END-IF.
*----------------------------------------------------------------------------
 2180-TXN-INPUT.
* Keyword TXN detected
* Split PARAMETER1 in transaction type and name
     MOVE SPACES TO TXN-LINE.
     UNSTRING PARAMETER1 DELIMITED ",", OR SPACE
         INTO L-TXN-TYPE, L-TXN-NAME.
* Verify transaction type
     IF NOT L-TXN-TYPE VALID-TRANSACTION-TYPES
         STRING COMPLETION-69 DELIMITED SIZE
                SPACE         DELIMITED SIZE
                L-TXN-TYPE    DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check for valid transaction name
     IF L-TXN-NAME = SPACES OR L-TXN-NAME (1:1) = "!"
         MOVE COMPLETION-19 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check for duplicates
     SET TXN-INDEX TO 1.
     SEARCH TXN-TABLE
         WHEN TXN-NAME (TXN-INDEX) = L-TXN-NAME
             STRING COMPLETION-20 DELIMITED SIZE
                    SPACE         DELIMITED SIZE
                    L-TXN-NAME    DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-SEARCH.
     ADD 1 TO TXN-MAX.
* The maximum number of user-defined transactions is TXN-CEILING
     IF TXN-MAX > TXN-CEILING
         MOVE COMPLETION-59 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Store TXN-NAME
     SET TXN-INDEX TO TXN-MAX.
     MOVE L-TXN-TYPE TO TXN-TYPE (TXN-INDEX).
     MOVE L-TXN-NAME TO TXN-NAME (TXN-INDEX).
* Display debug field
     IF DEBUG-MODE
         DISPLAY ">TXN: ", TXN-TYPE (TXN-INDEX), SPACE, TXN-NAME (TXN-INDEX)
     END-IF.
*----------------------------------------------------------------------------
 2190-REPORT-INPUT.
* Keyword REPORT detected
* Check for duplicates
     IF AUDIT-REPORT-YES
         MOVE COMPLETION-43 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check for valid report location
     IF PARAMETER1 = SPACES OR PARAMETER1 (1:1) = "!"
         MOVE COMPLETION-44 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Store REPORT-LOCATION
     MOVE PARAMETER1 TO REPORT-LOCATION.
     SET AUDIT-REPORT-YES TO TRUE.
* Display debug field
     IF DEBUG-MODE
         DISPLAY ">REPORT: ", REPORT-LOCATION
     END-IF.
*----------------------------------------------------------------------------
 2200-CONVERTTO-INPUT.
* Keyword CONVERTTO detected
* Check for duplicates
     IF CONVERTTO-PRESENT
         MOVE COMPLETION-74 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Soln 10-000602-8415. A check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-75 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF
* Obtain CPU power value
     SET CPU-TYPE-POWER-INDEX TO 1.
     SEARCH CPU-TYPE-POWER-TABLE
         END
*            Invalid CPU type entered
             PERFORM
                 MOVE COMPLETION-75 TO COMPLETION-MESSAGE
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN CPU-TYPE-ALFA (CPU-TYPE-POWER-INDEX) = PARAMETER1
             NEXT SENTENCE
     END-SEARCH.
* Store the CONVERTTO values of CPU-type, CPU-subtype and OS-version in
* temporary variables. Validate the second parameter of CONVERTTO.
* Changes start here - Soln 10-000602-8415.
     MOVE PARAMETER1 TO CONVERTTO-CPU-NAME.
     MOVE CPU-TYPE-NUMBER OF CPU-TYPE-SUBTYPE (CPU-TYPE-POWER-INDEX)
        TO TEMP-CPU-TYPE.
     MOVE CPU-SUBTYPE-NUMBER OF CPU-TYPE-SUBTYPE (CPU-TYPE-POWER-INDEX)
        TO TEMP-CPU-SUBTYPE.
     MOVE SPACES TO TEMP-OS-VERSION-LETTER.
     IF PARAMETER2 (1:3) NOT = SPACES
        MOVE PARAMETER2 (1:1) TO TEMP-OS-VERSION-LETTER
* J-Series Blades Change: "J" "j" Guardian-Type added.
* MeasTCM Yosemite Change: "H" "h" Guardian-Type added.
*        IF TEMP-OS-VERSION-LETTER NOT = "D" AND "d" AND "g" AND "G" AND "c" AND "C"
*                                        AND "H" AND "h" AND "J" AND "j"
        IF TEMP-OS-VERSION-LETTER NOT = "g" AND "G"
                                        AND "H" AND "h" AND "J" AND "j"
           PERFORM 8999-OS-VERSION-ERROR
        END-IF
        MOVE PARAMETER2 (2:2) TO TEMP-OS-VERSION-NUMBER
        IF TEMP-OS-VERSION-NUMBER NOT = SPACES
          IF PARAMETER2 (2:1) NOT NUMERIC AND PARAMETER2 (2:1) NOT = "X" AND "x"
             PERFORM 8999-OS-VERSION-ERROR
          END-IF
          IF PARAMETER2 (3:1) NOT NUMERIC AND PARAMETER2 (3:1) NOT = "X" AND "x"
             PERFORM 8999-OS-VERSION-ERROR
          END-IF
        END-IF
     END-IF.
* Changes end here - Soln 10-000602-8415.
     SET CPU-TYPE-POWER-CONVERTTO TO CPU-TYPE-POWER-INDEX.
     SET CONVERTTO-PRESENT        TO TRUE.
* Check for optional 2nd parameter of D or G or H -convert to D or G or H series
* Soln 10-000602-8415. The IF condition below for Debug mode is modified. Only
* 1st character of parameter2 is compared with "D/d/G/g/H/h", since parameter2 can
* also contain the factor 'u' of CONVERTTO. DISPLAY statements are now executed
* when Debug mode is off and parameter2 contains only a single character.
*     IF PARAMETER2 = "d" OR "D" OR "g" OR "G"
* J-Series Blades Change: "J" "j" Guardian-Type added.
* IF PARAMETER2 (1:1) = "d" OR "D" OR "g" OR "G" OR "h" OR "H" OR "j" OR "J"
  IF PARAMETER2 (1:1) = "g" OR "G" OR "h" OR "H" OR "j" OR "J"
         IF DEBUG-MODE
*            MOVE "D" TO CONVERT-GUARDIAN-VERSION
            MOVE "G" TO CONVERT-GUARDIAN-VERSION
         ELSE
             IF PARAMETER2 (2:2) = SPACES
*               DISPLAY ">D,G,H J Option on CONVERTTO only valid in DEBUG mode."
               DISPLAY ">G,H J Option on CONVERTTO only valid in DEBUG mode."
               DISPLAY ">    Option ignored."
         END-IF
      END-IF.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY
           ">CONVERTTO: (CICS,RICS) "
           CPU-TYPE-ALFA (CPU-TYPE-POWER-CONVERTTO)
           SPACE
*           CPU-POWER-VALUE-CNN (CPU-TYPE-POWER-CONVERTTO)
*           SPACE
*           CPU-POWER-VALUE-DNN (CPU-TYPE-POWER-CONVERTTO)
           CPU-POWER-VALUE-GNN (CPU-TYPE-POWER-CONVERTTO)
*         IF PARAMETER2 = "d" OR "D" or "g" OR "G" OR "h" OR "H" OR "j" OR "J"
          IF PARAMETER2 = "g" OR "G" OR "h" OR "H" OR "j" OR "J"
               DISPLAY ">CONVERTTO: ", PARAMETER2, " Option Detected"
           END-IF
     END-IF.
*----------------------------------------------------------------------------
* Soln 10-020415-8203 : start
  2240-DISKCONVERTTO-INPUT.
* Keyword DISKCONVERTTO detected
* Check for duplicates
     IF DISKCONVERTTO-PRESENT
         MOVE COMPLETION-93 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-94 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF
* Obtain DISK values
     SET DISK-SUBTYPE-INDEX TO 1.
     SEARCH DISK-TYPE-POWER-TABLE
         END
*            Invalid DISK type entered
             PERFORM
                 MOVE COMPLETION-94 TO COMPLETION-MESSAGE
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN DISK-TYPE-ALFA (DISK-SUBTYPE-INDEX) = PARAMETER1 AND DISK-SUBTYPE-NUMBER (DISK-SUBTYPE-INDEX) NOT = 52
             NEXT SENTENCE
     END-SEARCH.
     MOVE PARAMETER1 TO DISKTO-DISK-MODEL-NAME.
     SET DISK-TYPE-POWER-CONVERTTO TO DISK-SUBTYPE-INDEX.
* Check if DISKCONVERTTO contains SAS disk
        If DISK-SUBTYPE-NUMBER (DISK-TYPE-POWER-CONVERTTO)  = 51
           MOVE 1 TO SASDISK-FLAG
* Check for WCE status
           IF PARAMETER2 = SPACES OR "OFF" OR "off"
                MOVE "OFF" TO DISKTO-DISK-WCE
           ELSE IF PARAMETER2 = "ON" OR "on"
                MOVE "ON" TO DISKTO-DISK-WCE
           ELSE
                MOVE COMPLETION-109 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
           END-IF
        ELSE
* If DISKCONVERTTO contains non-SAS disk, check for WCE status
           IF PARAMETER2 = SPACES OR "NA" OR "na"
                MOVE "NA" TO DISKTO-DISK-WCE
           ELSE
                MOVE COMPLETION-94 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
           END-IF
        END-IF
     SET DISKCONVERTTO-PRESENT        TO TRUE.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY
           ">DISKCONVERTTO: (Model, Controller, WCE Status) "
           DISK-TYPE-ALFA (DISK-TYPE-POWER-CONVERTTO)
           SPACE
           DISK-CONTROLLER (DISK-TYPE-POWER-CONVERTTO)
           SPACE
           DISKTO-DISK-WCE
     END-IF.
* Soln 10-020415-8203 : end
*----------------------------------------------------------------------------
 2210-INVALID-KEYWORD.
* Invalid keyword detected
     STRING COMPLETION-21 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD       DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2220-CPUFACTOR-INPUT.
* Keyword CPUFACTOR detected
* Check Guardian type
     MOVE PARAMETER2 TO GUARDIAN-TYPE.
     IF NOT VALID-GUARDIAN-TYPE
*        If not a valid  G H or J check if alpha
         IF GUARDIAN-TYPE ALPHABETIC
            MOVE COMPLETION-85 TO COMPLETION-MESSAGE
            PERFORM 9010-SPCOMPLETION
         ELSE
*           Assume no guardian type provided so default to G
            MOVE PARAMETER4 TO PARAMETER5
            MOVE PARAMETER3 TO PARAMETER4
            MOVE PARAMETER2 TO PARAMETER3
*            MOVE "D" TO GUARDIAN-TYPE
            MOVE "G" TO GUARDIAN-TYPE
         END-IF
     ELSE
         IF GUARDIAN-TYPE = "j" OR "J"
            MOVE 1 TO JCPU-FLAG
            MOVE "G" TO GUARDIAN-TYPE
         ELSE
            MOVE "G" TO GUARDIAN-TYPE
         END-IF
     END-IF.
* Isolate power value
     UNSTRING PARAMETER3 DELIMITED ALL SPACE INTO CPUPOWER-ENTERED.
* Soln 10-020717-0465:start
* Check for format xxxx.yy
     IF CPUPOWER-ENTERED (1:1) NOT NUMERIC OR
        CPUPOWER-ENTERED (2:1) NOT NUMERIC OR
        CPUPOWER-ENTERED (3:1) NOT NUMERIC OR
        CPUPOWER-ENTERED (4:1) NOT NUMERIC OR
        CPUPOWER-ENTERED (5:1) NOT = "."   OR
        CPUPOWER-ENTERED (6:1) NOT NUMERIC OR
        CPUPOWER-ENTERED (7:1) NOT NUMERIC
* Soln 10-020717-0465:end
*        Invalid CPU power value entered
         MOVE COMPLETION-78 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Obtain index into CPU-TYPE-POWER-TABLE and check if CPU exist
     SET CPU-TYPE-POWER-INDEX TO 1.
     SEARCH CPU-TYPE-POWER-TABLE
         END
*            Invalid CPU type entered
*            GAG IPM AAK.   Check if ok to add new type.
             PERFORM 2225-ADD-NEW-CPU-TYPE
         WHEN CPU-TYPE-ALFA (CPU-TYPE-POWER-INDEX) = PARAMETER1
             NEXT SENTENCE
     END-SEARCH.
* Check if CPU power entered > 0
     IF CPUPOWER-ENTERED-RED <= ZERO
         MOVE COMPLETION-78 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
         MOVE CPUPOWER-ENTERED-RED
              TO CPU-POWER-VALUE-GNN (CPU-TYPE-POWER-INDEX).
* Display debug fields
     IF DEBUG-MODE
         DISPLAY
           ">CPUPOWER (CICS,RISC): "
           CPU-TYPE-ALFA (CPU-TYPE-POWER-INDEX)
           SPACE
*           CPU-POWER-VALUE-CNN (CPU-TYPE-POWER-INDEX)
*           SPACE
*           CPU-POWER-VALUE-DNN (CPU-TYPE-POWER-INDEX)
           CPU-POWER-VALUE-GNN (CPU-TYPE-POWER-INDEX)
     END-IF.
*----------------------------------------------------------------------------
* Soln 10-020415-8203 : start
  2250-DISKFACTOR-INPUT.
* Keyword DISKFACTOR detected
* Obtain index into DISK-TYPE-POWER-TABLE
     SET DISK-SUBTYPE-INDEX TO 1.
     SEARCH DISK-TYPE-POWER-TABLE
         END
*            Invalid DISK type entered
*            Check if ok to add new type.
             PERFORM 2255-ADD-NEW-DISK-TYPE
         WHEN DISK-TYPE-ALFA (DISK-SUBTYPE-INDEX) = PARAMETER1
             NEXT SENTENCE
     END-SEARCH.
   MOVE PARAMETER2 TO DISK-RPM-ENTERED.
*     Check for numerics for RPM.
    IF DISK-RPM-ENTERED (1:1) NOT NUMERIC OR
       DISK-RPM-ENTERED (2:1) NOT NUMERIC OR
       DISK-RPM-ENTERED (3:1) NOT NUMERIC OR
       DISK-RPM-ENTERED (4:1) NOT NUMERIC OR
       DISK-RPM-ENTERED (5:1) NOT NUMERIC
       PERFORM
           MOVE COMPLETION-91 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
       END-PERFORM
    END-IF.
*  Check if DISK RPM entered > 0
    IF DISK-RPM-ENTERED-RED <= ZERO
           MOVE COMPLETION-91 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
    END-IF.
*  Check if Controller is EXT, SNET or MFC only.
*    MOVE PARAMETER3 TO DISK-CNT-ENTERED.
     SET CNT-TYPE-POWER-INDEX TO 1
          SEARCH CONTROLLER-TYPE-POWER-TABLE
          END
          PERFORM
              MOVE COMPLETION-91 TO COMPLETION-MESSAGE
              PERFORM 9010-SPCOMPLETION
          END-PERFORM
          WHEN CNT-TYPE-ALFA(CNT-TYPE-POWER-INDEX) = PARAMETER3
          NEXT SENTENCE
        END-SEARCH.
* Store DISK RPM, Controller
    MOVE DISK-RPM-ENTERED-RED TO DISK-RPM (DISK-SUBTYPE-INDEX).
    MOVE PARAMETER3 TO DISK-CONTROLLER (DISK-SUBTYPE-INDEX).
* Soln 10-020717-0465:end
* Start of code change for CEP RFE.
* Check read seek time is entered
     IF PARAMETER5 = SPACES
        PERFORM
           MOVE COMPLETION-91 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
        END-PERFORM
     ELSE
        MOVE PARAMETER5 TO DISK-READSEEK-ENTERED
     END-IF.
* Check for format xx.yy
     IF DISK-READSEEK-ENTERED (1:1) NOT NUMERIC OR
        DISK-READSEEK-ENTERED (2:1) NOT NUMERIC OR
        DISK-READSEEK-ENTERED (3:1) NOT = "."   OR
        DISK-READSEEK-ENTERED (4:1) NOT NUMERIC OR
        DISK-READSEEK-ENTERED (5:1) NOT NUMERIC
*        Invalid read seek time entered
         MOVE COMPLETION-113 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if read seek time entered > 0
     IF DISK-READSEEK-ENTERED-RED <= ZERO OR DISK-READSEEK-ENTERED-RED > 10
        PERFORM
           MOVE COMPLETION-113 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
     IF PARAMETER6 = SPACES
        MOVE DISK-READSEEK-ENTERED TO DISK-WRITESEEK-ENTERED
     ELSE
        MOVE PARAMETER6 TO DISK-WRITESEEK-ENTERED
     END-IF.
* Check for format xxxx.yy
     IF DISK-WRITESEEK-ENTERED (1:1) NOT NUMERIC OR
        DISK-WRITESEEK-ENTERED (2:1) NOT NUMERIC OR
        DISK-WRITESEEK-ENTERED (3:1) NOT = "."   OR
        DISK-WRITESEEK-ENTERED (4:1) NOT NUMERIC OR
        DISK-WRITESEEK-ENTERED (5:1) NOT NUMERIC
*        Invalid write seek time entered
         MOVE COMPLETION-114 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if write seek time entered > 0
     IF DISK-WRITESEEK-ENTERED-RED <= ZERO OR DISK-WRITESEEK-ENTERED-RED > 10
        PERFORM
           MOVE COMPLETION-114 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
* Store DISK read and write seek time.
    MOVE DISK-READSEEK-ENTERED-RED TO DISK-READSEEK (DISK-SUBTYPE-INDEX).
    MOVE DISK-WRITESEEK-ENTERED-RED TO DISK-WRITESEEK (DISK-SUBTYPE-INDEX).
* End of code change for CEP RFE.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY
           ">DISKPOWER (Model, Subtype, RPM, Controller, ReadSeekTime (ms), WriteSeekTime (ms)): "
           DISK-TYPE-ALFA (DISK-SUBTYPE-INDEX)
           SPACE
           DISK-SUBTYPE-NUMBER (DISK-SUBTYPE-INDEX)
           SPACE
           DISK-RPM (DISK-SUBTYPE-INDEX)
           SPACE
           DISK-CONTROLLER (DISK-SUBTYPE-INDEX)
           SPACE
           DISK-READSEEK-ENTERED-RED
           SPACE
           DISK-WRITESEEK-ENTERED-RED
     END-IF.
*----------------------------------------------------------------------------
  2260-ACTUALDISK42-INPUT.
* Keyword ACTUALDISK42 detected
* Check for duplicates
     IF ACTUALDISK42-PRESENT
          MOVE COMPLETION-97 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-100 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if it is only "4608" or "4609".
     IF PARAMETER1 EQUAL TO "4608" OR "4609"
           MOVE PARAMETER1 TO ACTUALDISK42-ENTERED
     ELSE
        PERFORM
          MOVE COMPLETION-100 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
     SET ACTUALDISK42-PRESENT TO TRUE.
     IF DEBUG-MODE
        DISPLAY
        ">ACTUALDISK42 (model): " ACTUALDISK42-ENTERED
     END-IF.
*----------------------------------------------------------------------------
  2270-ACTUALDISK43-INPUT.
* Keyword ACTUALDISK43 detected
* Check for duplicates
     IF ACTUALDISK43-PRESENT
          MOVE COMPLETION-98 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-101 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if it is only "4618" or "4619".
     IF PARAMETER1 EQUAL TO "4618" OR "4619"
           MOVE PARAMETER1 TO ACTUALDISK43-ENTERED
     ELSE
        PERFORM
          MOVE COMPLETION-101 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
     SET ACTUALDISK43-PRESENT TO TRUE.
     IF DEBUG-MODE
         DISPLAY
         ">ACTUALDISK43 (model): " ACTUALDISK43-ENTERED
     END-IF.
*----------------------------------------------------------------------------
  2280-ACTUALDISK44-INPUT.
* Keyword ACTUALDISK44 detected
* Check for duplicates
     IF ACTUALDISK44-PRESENT
          MOVE COMPLETION-99 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-102 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if it is only "4636" or "4637" or "4638".
     IF PARAMETER1 EQUAL TO "4636" OR "4637" OR "4638"
          MOVE PARAMETER1 TO ACTUALDISK44-ENTERED
     ELSE
        PERFORM
          MOVE COMPLETION-102 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
     SET ACTUALDISK44-PRESENT TO TRUE.
     IF DEBUG-MODE
        DISPLAY
        ">ACTUALDISK44 (model): " ACTUALDISK44-ENTERED
     END-IF.
* Soln 10-020415-8203 : end
*----------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
 2290-ACTUALDISK53-INPUT.
* JBOD Disc support (Subtype 53).
* Keyword ACTUALDISK53 detected
* Check for duplicates
     IF ACTUALDISK53-PRESENT
          MOVE COMPLETION-106 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-107 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if it is only "BF07255B2C" or "BF0725754B" or "BF07258243"
*                  or "BF14658244".
     IF PARAMETER1 EQUAL TO "BF07255B2C" OR "BF0725754B" OR "BF07258243" OR "BF14658244"
                         OR "BF0725A476" OR "BF1465A477" OR "BF3005A478" OR "BF072D6186"
                         OR "BF146DA47C" OR "BF300DA482" OR "BF450DA483" OR "BF072DAJZN"
                         OR "BF146DAJZP" OR "BF300DAJZQ" OR "BF450DAJZR" OR "BF600DAJZT"
                         OR "BF036574C9" OR "BF07258222" OR "BF14658227" OR "BF0725A692"
                         OR "BF1465A693" OR "BF146DA47A" OR "BF300DA47B" OR "BF300D6188"
                         OR "BF450D6189" OR "BF300DASTH" OR "BF450DASTK" OR "BF600DASTL"
          MOVE PARAMETER1 TO ACTUALDISK53-ENTERED
     ELSE
        PERFORM
          MOVE COMPLETION-107 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
     SET ACTUALDISK53-PRESENT TO TRUE.
     IF DEBUG-MODE
        DISPLAY
        ">ACTUALDISK53 (model): " ACTUALDISK53-ENTERED
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
* Start of code change for SAS disk support
 2450-ACTUALDISK51-INPUT.
* SAS Disc support (Subtype 51).
* Keyword ACTUALDISK51 detected
* Check for duplicates
     IF ACTUALDISK51-PRESENT
          MOVE COMPLETION-110 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-IF.
* Check to ensure that at least one parameter is passed
     IF PARAMETER1 = SPACES
           MOVE COMPLETION-111 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
     END-IF.
* Check if it is SAS disk model.
     IF PARAMETER1 EQUAL TO "DG072BB975" OR "DG146BB976" OR "DH072BB978" OR "DG0146BAHZP"
                         OR "DG0300BAHZQ" OR "DG0146BALVN" OR "DG0300BALVP" OR "DG0146FAMWL"
                         OR "EG0146FAWHU" OR "DG0300FAMWN" OR "EG0300FAWHV" OR "DH0072BALWL"
                         OR "DH0146BALWN" OR "DH0072FAQRD" OR "EH0072FAWJA" OR "DH0146FAQRE"
                         OR "EH0146FAWJB" OR "DG072BAAJA" OR "DG146BAAJB" OR "DG0146BAMYQ"
                         OR "DG0300BAMYR" OR "DG0146FARVU" OR "DG0300FARVV" OR "EG0146FAWJC"
                         OR "EG0300FAWJD" OR "EH0072FARWC" OR "EH0146FARWD" OR "EG0300FBDBR"
                         OR "EG0600FBDBU" OR "DH072BAAKN" OR "DG072BABCE" OR "DG146BABCF"
                         OR "DG0146BARTP" OR "DG0300BARTQ" OR "EG0146FARTR" OR "EG0300FARTT"
                         OR "EH0072FARUA" OR "EH0146FARUB" OR "EG0300FBDSP" OR "EG0600FBDSR"
          MOVE PARAMETER1 TO ACTUALDISK51-ENTERED
     ELSE
        PERFORM
          MOVE COMPLETION-111 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
        END-PERFORM
     END-IF.
* Check WCE status
     MOVE PARAMETER2 TO WCE-STATUS.
     IF NOT VALID-WCE-STATUS
*        If not a valid "OFF" or "ON"  check if alpha
         IF WCE-STATUS NOT = SPACE
           PERFORM
              MOVE COMPLETION-111 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
           END-PERFORM
         ELSE
*           Assume no WCE status provided, so set default value as "OFF"
            MOVE "OFF" TO ACTUAL-DISK-WCE
         END-IF
     ELSE
         IF WCE-STATUS = "ON" OR "on"
             MOVE "ON" TO ACTUAL-DISK-WCE
         ELSE IF WCE-STATUS = "NA" OR "na"
             MOVE "NA" TO ACTUAL-DISK-WCE
         ELSE
             MOVE "OFF" TO ACTUAL-DISK-WCE
         END-IF
     END-IF.
     SET ACTUALDISK51-PRESENT TO TRUE.
     IF DEBUG-MODE
        DISPLAY
        ">ACTUALDISK51 (model): " ACTUALDISK51-ENTERED
     END-IF.
* End of code change for SAS disk support
*----------------------------------------------------------------------------
* Start of code change for XP disk support
 2460-ACTUALDISK52-INPUT.
* XP Disc support (Subtype 52).
* Keyword ACTUALDISK52 detected
* Check for duplicates
      IF ACTUALDISK52-PRESENT
           MOVE COMPLETION-117 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
      END-IF.
* Check to ensure that at least one parameter is passed
      IF PARAMETER1 = SPACES
            MOVE COMPLETION-118 TO COMPLETION-MESSAGE
            PERFORM 9010-SPCOMPLETION
      END-IF.
* Check if it is XP disk.
      IF PARAMETER1 EQUAL TO "XP24KRG5A" OR "XP24KRG5B"
           MOVE PARAMETER1 TO ACTUALDISK52-ENTERED
      ELSE
         PERFORM
           MOVE COMPLETION-118 TO COMPLETION-MESSAGE
           PERFORM 9010-SPCOMPLETION
         END-PERFORM
      END-IF.
      SET ACTUALDISK52-PRESENT TO TRUE.
      IF DEBUG-MODE
         DISPLAY
         ">ACTUALDISK52 (model): " ACTUALDISK52-ENTERED
     END-IF.
*----------------------------------------------------------------------------
* Start of code change for XP disk support
 2470-XPDISKFACTOR-INPUT.
* Keyword XPDISKFACTOR detected
* Check for duplicates
      IF XPDISKFACTOR-PRESENT
         MOVE COMPLETION-119 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
      END-IF.
* Check to ensure that at least one parameter is passed
      IF PARAMETER1 = SPACES
            MOVE COMPLETION-120 TO COMPLETION-MESSAGE
            PERFORM 9010-SPCOMPLETION
      END-IF.
* Validate parameter1 and  update XPDISKFACTOR-ENTERED
      UNSTRING PARAMETER1 DELIMITED ALL SPACE INTO XPDISKFACTOR-ENTERED
      IF XPDISKFACTOR-ENTERED (1:1) NOT NUMERIC OR
         XPDISKFACTOR-ENTERED (2:1) NOT NUMERIC OR
         XPDISKFACTOR-ENTERED (3:1) NOT = "."   OR
         XPDISKFACTOR-ENTERED (4:1) NOT NUMERIC OR
         XPDISKFACTOR-ENTERED (5:1) NOT NUMERIC
         PERFORM
                MOVE COMPLETION-120 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
         END-PERFORM
      END-IF.
* Check if paramter1 value is between 1 to 10.
      IF XPDISKFACTOR-ENTERED-RED <= ZERO OR XPDISKFACTOR-ENTERED-RED > 10
         MOVE COMPLETION-120 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
      END-IF.
* Check if parameter2 is supported XP disk.
* if not, add the new disk to XP disk table
* Obtain index into XPDISK-POWER-TABLE
    IF PARAMETER2 NOT = SPACES
     UNSTRING PARAMETER2 DELIMITED ALL SPACE INTO XPDISK-ENTERED
     SET XPDISK-TYPE-INDEX TO 1
     SEARCH XPDISK-POWER-TABLE
         END
*            Invalid XPDISK type entered
*            Check if ok to add new type.
             PERFORM 2475-ADD-NEW-XPDISK
         WHEN XPDISK-TYPE-ALFA (XPDISK-TYPE-INDEX) = XPDISK-ENTERED
             MOVE XPDISKFACTOR-ENTERED TO XPDISK-FACTOR  (XPDISK-TYPE-INDEX)
     END-SEARCH
    END-IF.
    SET XPDISKFACTOR-PRESENT TO TRUE.
    IF DEBUG-MODE
       DISPLAY
       ">XPDISKFACTOR (model): " XPDISKFACTOR-ENTERED
    END-IF.
*----------------------------------------------------------------------------
 2475-ADD-NEW-XPDISK.
   IF XPDISK-POWER-TYPE-MAX >= MAX-XPDISK-TYPES
     PERFORM
        MOVE COMPLETION-120 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
*  Verify that the subtype, RPM, disk controller was specified.
   IF PARAMETER2 EQUAL SPACES
     PERFORM
        MOVE COMPLETION-120 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
* We're ok, setup the new entry.
   ADD 1 TO XPDISK-POWER-TYPE-MAX.
   SET XPDISK-TYPE-INDEX TO XPDISK-POWER-TYPE-MAX.
* Store DISK name, Subtype
   MOVE PARAMETER2 TO XPDISK-TYPE-ALFA  (XPDISK-TYPE-INDEX).
*----------------------------------------------------------------------------
* Start of code change for multiple tmf audit trails
 2500-NUMTMFTRAIL-INPUT.
* Keyword NUMTMFTRAIL detected
* Check for duplicates
  IF NUMTMFTRAIL-PRESENT
     MOVE COMPLETION-123 TO COMPLETION-MESSAGE
     PERFORM 9010-SPCOMPLETION
  END-IF.
* Unstring parameter1 to get number of TMf trails
 UNSTRING PARAMETER1 DELIMITED ALL SPACE INTO NUMTRAILS-ENTERED-RED
 IF NUMTRAILS-ENTERED-RED NOT NUMERIC
     PERFORM
        MOVE COMPLETION-116 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
 END-IF.
 IF NUMTRAILS-ENTERED-RED >= TRAIL-MIN AND NUMTRAILS-ENTERED-RED <= TRAIL-MAX
        MOVE NUMTRAILS-ENTERED-RED TO NUMTRAILS
 ELSE
       PERFORM
        MOVE COMPLETION-116 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
 END-IF.
 SET NUMTMFTRAIL-PRESENT TO TRUE.
* Display debug fields
 IF DEBUG-MODE
    DISPLAY
        ">NUMTMFTRAIL: " NUMTRAILS
     END-IF.
* End of code change for multiple tmf audit trails
*----------------------------------------------------------------------------
*  GAG IPM AAK    Added so that new cputype can be added until MeasTCM is updated.
 2225-ADD-NEW-CPU-TYPE.
 IF CPU-POWER-TYPE-MAX >= MAX-PROCESSOR-TYPES
     PERFORM
        MOVE COMPLETION-77 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
*  Verify that the type, subtype was specified.
   IF PARAMETER4 EQUAL SPACES
     PERFORM
        MOVE COMPLETION-77 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
   UNSTRING PARAMETER4 DELIMITED ",", OR ALL SPACE
      INTO CPU-TYPE-ENTERED, CPU-SUBTYPE-ENTERED.
*  Check for numerics.
   IF CPU-TYPE-ENTERED (1:1) NOT NUMERIC OR
      CPU-SUBTYPE-ENTERED (1:1) NOT NUMERIC
     PERFORM
        MOVE COMPLETION-77 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
* Check if CPU power entered > 0
   IF CPU-TYPE-ENTERED (2:1) NOT NUMERIC
     MOVE CPU-TYPE-ENTERED (1:1) TO CPU-TYPE-ENTERED-RED
   END-IF.
   IF CPU-SUBTYPE-ENTERED (2:1) NOT NUMERIC
     MOVE CPU-SUBTYPE-ENTERED (1:1) TO CPU-SUBTYPE-ENTERED-RED
   END-IF.
*Added for multi-core support-Start of code change
*Check if IPU-count entered for multi-core CPUs >0
* Isolate IPU count
*  Verify that the IPU count was specified.
        IF PARAMETER5 EQUAL SPACES
*Check whether guardian type is "j" or "J"
            IF JCPU-FLAG = 1
                PERFORM
                MOVE COMPLETION-115 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
                END-PERFORM
            ELSE
                MOVE 1 TO CPU-IPUCOUNT-ENTERED
            END-IF
        ELSE
                UNSTRING PARAMETER5 DELIMITED ALL SPACE INTO CPU-IPUCOUNT-ENTERED
        END-IF.
*        Invalid IPU count value entered
        IF CPU-IPUCOUNT-ENTERED (1:1) NOT NUMERIC
               PERFORM
                    MOVE COMPLETION-115 TO COMPLETION-MESSAGE
                    PERFORM 9010-SPCOMPLETION
               END-PERFORM
        END-IF.
        IF CPU-IPUCOUNT-ENTERED (2:1) NOT NUMERIC
             MOVE CPU-IPUCOUNT-ENTERED (1:1) TO CPU-IPUCOUNT-ENTERED-RED
        END-IF.
* Check if IPU Count entered > 0
        IF CPU-IPUCOUNT-ENTERED-RED <= ZERO
               PERFORM
               MOVE COMPLETION-115 TO COMPLETION-MESSAGE
               PERFORM 9010-SPCOMPLETION
               END-PERFORM
        END-IF.
        IF (JCPU-FLAG NOT = 1) AND (CPU-IPUCOUNT-ENTERED-RED NOT = 1)
                PERFORM
                MOVE COMPLETION-115 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
                END-PERFORM
        END-IF.
        IF (JCPU-FLAG = 1) AND (CPU-IPUCOUNT-ENTERED-RED = 1)
                PERFORM
                MOVE COMPLETION-115 TO COMPLETION-MESSAGE
                PERFORM 9010-SPCOMPLETION
                END-PERFORM
        END-IF.
* End of code change for multicore support
*  Verify if TYPE-SUBTYPE not already in table.
   SET CPU-TYPE-POWER-INDEX TO 1.
   SEARCH CPU-TYPE-POWER-TABLE
     WHEN CPU-TYPE-NUMBER (CPU-TYPE-POWER-INDEX) = CPU-TYPE-ENTERED-RED AND
          CPU-SUBTYPE-NUMBER (CPU-TYPE-POWER-INDEX) = CPU-SUBTYPE-ENTERED-RED
       PERFORM
          MOVE COMPLETION-77 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
       END-PERFORM
   END-SEARCH.
*  We're ok, setup the new entry.
   ADD 1 TO CPU-POWER-TYPE-MAX.
   SET CPU-TYPE-POWER-INDEX TO CPU-POWER-TYPE-MAX.
*  Soln 10-000602-8415. New CPU-type added.
   MOVE 1 TO FLAG-CPUFACTOR-NEW-CPU.
   MOVE PARAMETER1 TO CPU-TYPE-ALFA (CPU-TYPE-POWER-INDEX).
   MOVE CPU-TYPE-ENTERED-RED TO CPU-TYPE-NUMBER (CPU-TYPE-POWER-INDEX).
   MOVE CPU-SUBTYPE-ENTERED-RED TO CPU-SUBTYPE-NUMBER (CPU-TYPE-POWER-INDEX).
* Changed MOVE statement for IPU count
   MOVE CPU-IPUCOUNT-ENTERED-RED TO CPU-IPUCOUNT-NUMBER (CPU-TYPE-POWER-INDEX).
*  MOVE 1 TO CPU-POWER-VALUE-CNN (CPU-TYPE-POWER-INDEX).
*  MOVE 1 TO CPU-POWER-VALUE-DNN (CPU-TYPE-POWER-INDEX).
   MOVE 1 TO CPU-POWER-VALUE-GNN (CPU-TYPE-POWER-INDEX).
*----------------------------------------------------------------------------
* Soln 10-020415-8203 : start
  2255-ADD-NEW-DISK-TYPE.
   IF DISK-POWER-TYPE-MAX >= MAX-DISK-TYPES
     PERFORM
        MOVE COMPLETION-91 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
*  Verify that the subtype, RPM, disk controller was specified.
   IF PARAMETER4 EQUAL SPACES
     PERFORM
        MOVE COMPLETION-91 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-IF.
   MOVE PARAMETER4 TO DISK-SUBTYPE-ENTERED.
*  Check for numerics for subtype.
   IF DISK-SUBTYPE-ENTERED (1:1) NOT NUMERIC OR
      DISK-SUBTYPE-ENTERED (2:1) NOT NUMERIC
      PERFORM
        MOVE COMPLETION-91 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
      END-PERFORM
   END-IF.
*  Check if DISK Subtype entered > 0
   IF DISK-SUBTYPE-ENTERED-RED <= ZERO
       MOVE COMPLETION-91 TO COMPLETION-MESSAGE
       PERFORM 9010-SPCOMPLETION
   END-IF.
   SET DISK-SUBTYPE-INDEX TO 1.
   SEARCH DISK-TYPE-POWER-TABLE
    WHEN DISK-SUBTYPE-NUMBER (DISK-SUBTYPE-INDEX) = DISK-SUBTYPE-ENTERED-RED
     PERFORM
        MOVE COMPLETION-91 TO COMPLETION-MESSAGE
        PERFORM 9010-SPCOMPLETION
     END-PERFORM
   END-SEARCH.
* We're ok, setup the new entry.
   ADD 1 TO DISK-POWER-TYPE-MAX.
   SET DISK-SUBTYPE-INDEX TO DISK-POWER-TYPE-MAX.
* Store DISK name, Subtype
   MOVE PARAMETER1 TO DISK-TYPE-ALFA (DISK-SUBTYPE-INDEX).
   MOVE DISK-SUBTYPE-ENTERED-RED TO DISK-SUBTYPE-NUMBER (DISK-SUBTYPE-INDEX).
* Soln 10-020415-8203 : end
*----------------------------------------------------------------------------
 2230-NUMCSVS-INPUT.
* Keyword NUMCSVS detected
* Check for duplicates.
      IF C-NUM-CSVS-DETECTED
         MOVE COMPLETION-82 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
      END-IF.
      SET C-NUM-CSVS-DETECTED TO TRUE.
      MOVE PARAMETER1(1:3) TO NUMBER-CSVS-ALPHA.
*----------------------------------------------------------------------------
 2300-INVALID-NODE-NAME.
     STRING COMPLETION-33 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD (5:2) DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2310-INVALID-CPU-NUMBER.
     STRING COMPLETION-34 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD (5:2) DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2320-INVALID-PIN-NUMBER.
     STRING COMPLETION-35 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD (5:2) DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2330-INVALID-GROUP.
     STRING COMPLETION-38 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD (5:2) DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2340-INVALID-USER.
     STRING COMPLETION-42 DELIMITED SIZE
            SPACE         DELIMITED SIZE
            KEYWORD (5:2) DELIMITED SIZE
            INTO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 2400-MEASURE-TABLE-SCAN.
      SET MEASURE-INDEX TO TEMP-INDEX.
      MOVE TEMP-INDEX TO MEAS-INDEX.
      MOVE 1 TO RUN-MEAS-MSG-INDX.
      MOVE "Y" TO MEASURE-VALID-FILE(MEASURE-INDEX).
      MOVE MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX) TO TEMP-TIMESTAMP.
      ENTER TAL "INTERPRETTIMESTAMP" USING
                TEMP-TIMESTAMP, DATE-N-TIME GIVING RESULT-4.
      MOVE CORR DATE-N-TIME TO CSVTIME.
      MOVE CSVTIME          TO TEMP-FROM-TIME OF TEMP-LINE-2.
* Set the stop time if CSVHI is available.
      IF (MEASURE-STOP(MEASURE-INDEX)) = -1
         IF CSVHI ZERO
            MOVE INFO-15 TO COMPLETION-MESSAGE
                            RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            MOVE INFO-19 TO RUN-MEAS-FILE-ADV
            SET C-EXIT-PROGRAM TO TRUE
            PERFORM 2490-PRE-EXIT
         ELSE
            MOVE CSVHI TO MEASURE-STOP(MEASURE-INDEX)
            MOVE INFO-20 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
            PERFORM 2420-SCAN-PART-2
         END-IF
      ELSE
         PERFORM 2420-SCAN-PART-2
      END-IF.
*----------------------------------------------------------------------------
 2420-SCAN-PART-2.
      MOVE MEASURE-STOP(MEASURE-INDEX) TO TEMP-TIMESTAMP.
      ENTER TAL "INTERPRETTIMESTAMP" USING
                TEMP-TIMESTAMP, DATE-N-TIME GIVING RESULT-4.
      MOVE CORR DATE-N-TIME TO CSVTIME.
      MOVE CSVTIME          TO TEMP-TO-TIME OF TEMP-LINE-2.
* Check if this measure file lies within user specified time window
      IF CSVHI NOT ZERO
         IF MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX) > CSVHI
            MOVE INFO-21 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
            MOVE INFO-22 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
            MOVE "N" TO MEASURE-VALID-FILE(MEASURE-INDEX)
         END-IF
      END-IF.
      IF CSVLO NOT ZERO
         IF MEASURE-STOP(MEASURE-INDEX) < CSVLO
            MOVE INFO-21 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
            MOVE INFO-22 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
            MOVE "N" TO MEASURE-VALID-FILE(MEASURE-INDEX)
         END-IF
      END-IF.
      IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
         ADD 1 TO NUM-VALID-FILES
      END-IF.
* Check for overlap. Check if the start time of current file is less than
* stop time of previous valid file.
     IF (NUM-VALID-FILES > 1)
        IF (MEASURE-VALID-FILE(MEASURE-INDEX) = "Y")
          IF (MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX) >
                     PREVIOUS-STOP-TIME)
            MOVE INFO-16 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
            ADD 1 TO RUN-MEAS-MSG-INDX
          END-IF
        END-IF
     END-IF.
* Set the previous-stop-time to stop time of current file.
     MOVE MEASURE-STOP(MEASURE-INDEX) TO PREVIOUS-STOP-TIME.
* Set the interval if it is -1 for this file
* Divide the (stop - start) by 1000000 and multiply by 1000000 to give the
* interval rounded. The start and stop times calculated will not go out of
* range.
    IF (MEASURE-INT(MEASURE-INDEX) = -1)
       COMPUTE MEASURE-INT(MEASURE-INDEX) =
              (MEASURE-STOP(MEASURE-INDEX) -
              MEASURE-START OF MEASURE-TABLE(MEASURE-INDEX)) / 1000000
       COMPUTE MEASURE-INT(MEASURE-INDEX) =
                   MEASURE-INT(MEASURE-INDEX) * 1000000
       MOVE INFO-17 TO RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
       ADD 1 TO RUN-MEAS-MSG-INDX
    END-IF.
    DIVIDE MEASURE-INT(MEASURE-INDEX) BY 1000000 GIVING TEMP-COLL-INT.
* Compute LCM of intervals
   IF MEASURE-VALID-FILE(MEASURE-INDEX) = "N"
      PERFORM 2490-PRE-EXIT
   ELSE
*     If the index = 1, set lcm = interval
      IF (MEASURE-INDEX = 1)  OR (LCM = 0)
          MOVE  MEASURE-INT(MEASURE-INDEX) TO LCM
          PERFORM 2490-PRE-EXIT
      ELSE
*         Get GCD of lcm and interval of current element.
          MOVE MEASURE-INT(MEASURE-INDEX) TO NUMERATOR
          IF (NUMERATOR = LCM) OR (LCM < 0)
              PERFORM 2490-PRE-EXIT
          ELSE
              PERFORM 2480-SCAN-PART-3
          END-IF
       END-IF
   END-IF.
*----------------------------------------------------------------------------
 2480-SCAN-PART-3.
* Since the interval is not the same as the lcm of previous values,
* compute the gcd of the lcm and the interval and use this to find lcm.
   MOVE LCM TO DENOMINATOR.
* If numerator < denominator, switch values so that numerator > denominator.
   IF (NUMERATOR < DENOMINATOR)
      MOVE NUMERATOR TO TEMP-STORE
      MOVE DENOMINATOR       TO NUMERATOR
      MOVE TEMP-STORE TO DENOMINATOR
   END-IF.
* Find the GCD of interval and denominator. Divide interval by denominator.
* If rem = 0 denominator is the gcd. If rem not zero, move denominator to
* numerator, rem to denominator and repeat until rem = 0.
   MOVE "N" TO EXIT-GCD.
   PERFORM UNTIL C-EXIT-GCD
      DIVIDE NUMERATOR BY DENOMINATOR GIVING QUOTIENT REMAINDER REM
      IF REM ZERO
         MOVE DENOMINATOR TO GCD
         SET C-EXIT-GCD TO TRUE
      ELSE
         MOVE DENOMINATOR TO NUMERATOR
         MOVE REM TO DENOMINATOR
      END-IF
   END-PERFORM.
* Find the factor by which the lcm and interval are divisible by gcd
   COMPUTE FACTOR-1 = MEASURE-INT(MEASURE-INDEX) / GCD.
   COMPUTE FACTOR-2 = LCM / GCD.
* The lcm = product of the two factors and the gcd.
   COMPUTE LCM = FACTOR-1 * FACTOR-2 * GCD
   ON SIZE ERROR
      MOVE -1 TO LCM
   END-COMPUTE.
   PERFORM 2490-PRE-EXIT.
*----------------------------------------------------------------------------
 2490-PRE-EXIT.
      SET SYSTEM-INDEX TO MEASURE-SYSTEM-NUMBER(MEASURE-INDEX).
      MOVE SPACES TO MEAS-SYS-NAME.
      MOVE SYSTEM-NAME OF SYSTEM-TABLE(SYSTEM-INDEX) TO MEAS-SYS-NAME.
      MOVE SPACES TO INTERNAL-FILENAME.
      MOVE MEASURE-DATAFILE(MEASURE-INDEX) TO INTERNAL-FILENAME.
      STRING PART1 DELIMITED BY SPACES,
             "."   DELIMITED BY SIZE,
             PART2 DELIMITED BY SPACES,
             "."   DELIMITED BY SIZE,
             PART3 DELIMITED BY SIZE
      INTO MEAS-FILE-NAME.
      MOVE TEMP-LINE-1 TO RUN-MEAS-LINE-1(TEMP-INDEX).
      MOVE TEMP-LINE-2 TO RUN-MEAS-LINE-2(TEMP-INDEX).
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 3000-CORE-PROCESSING.
* Loop through the process of reading the measure data files, generating the
* csv data file for all files possible.
      PERFORM 3000-CORE-PROCESSING-MAIN
           VARYING FILE-NUM FROM 1 BY 1
           UNTIL FILE-NUM > NUM-CSVS-ACTUAL.
* Close all measure data files
      PERFORM 5000-CLOSE-MEASDATA.
*----------------------------------------------------------------------------
 3000-CORE-PROCESSING-MAIN.
   MOVE FILE-NUM TO CSVDATA(POS:3).
   MOVE CSVDATA  TO CSV-FILE-NAME.
   MOVE CSV-FILE-NAME TO P-CSV-FILE.
*  Set the time window for the csvdata file and the measure data files.
   IF MEAS-START ZERO
      MOVE EARLIEST-START-TIME TO MEAS-START
   ELSE
      MOVE MEAS-STOP TO MEAS-START
   END-IF.
   IF (FILE-NUM = NUM-CSVS-ACTUAL) OR (LCM < 0)
      MOVE LATEST-STOP-TIME TO MEAS-STOP
   ELSE
      COMPUTE MEAS-STOP = MEAS-START + (LCM * NUM-OF-LCMS)
   END-IF.
* Set the low and high times in the csv record
   ENTER TAL "INTERPRETTIMESTAMP" USING MEAS-START, DATE-N-TIME
                                  GIVING RESULT-4.
   MOVE CORR DATE-N-TIME TO CSVTIME.
   MOVE CORR CSVTIME     TO I04.
   MOVE CORR CSVTIME     TO I05.
   MOVE      CSVTIME     TO FROM-WINDOW
                            TEMP-FROM-TIME OF CSV-TEMP-2.
   ENTER TAL "INTERPRETTIMESTAMP" USING MEAS-STOP, DATE-N-TIME
                                  GIVING RESULT-4.
   MOVE CORR DATE-N-TIME TO CSVTIME.
   MOVE CORR CSVTIME     TO I06.
   MOVE CORR CSVTIME     TO I07.
   MOVE      CSVTIME     TO TO-WINDOW
                            TEMP-TO-TIME OF CSV-TEMP-2.
* Business as usual for this csv file.
   DISPLAY INFO-27, SPACE, CSVDATA.
   PERFORM 3000-CORE-PROCESSING-CONT.
* Initialize all areas required for the next csv data file
   PERFORM VARYING VOLUME-INDEX FROM 1 BY 1
         UNTIL VOLUME-INDEX > VOLUME-MAX
      INITIALIZE VOLUME-SORT-MOVE(VOLUME-INDEX)
          REPLACING NUMERIC DATA BY ZERO
               ALPHANUMERIC DATA BY SPACES
      MOVE ZERO TO NO-OF-FILES(VOLUME-INDEX)
                   NO-OF-VOLUME-RECS(VOLUME-INDEX)
                   DISC-READ-COST(VOLUME-INDEX)
                   DISC-WRITE-COST(VOLUME-INDEX)
                   DISC-TO-DOPN-READ-RATIO(VOLUME-INDEX)
                   DISC-TO-DOPN-WRITE-RATIO(VOLUME-INDEX)
   END-PERFORM.
   PERFORM VARYING PROCESS-INDEX FROM 1 BY 1
         UNTIL PROCESS-INDEX > PROCESS-MAX
      INITIALIZE PROCESS-SORT-KEY OF PROCESS-TABLE(PROCESS-INDEX)
          REPLACING NUMERIC DATA BY ZERO
               ALPHANUMERIC DATA BY SPACES
      MOVE ZERO TO PROCESS-TO(PROCESS-INDEX)
                   PROCESS-UNIQUE(PROCESS-INDEX)
      MOVE SPACES TO PROCESS-WKLD-NUMBER(PROCESS-INDEX)
   END-PERFORM.
   PERFORM VARYING TITLE-INDEX FROM 1 BY 1
         UNTIL TITLE-INDEX > TITLE-MAX
       INITIALIZE CSV-W-BINARY(TITLE-INDEX)
              REPLACING NUMERIC DATA BY ZERO
                   ALPHANUMERIC DATA BY SPACES
   END-PERFORM.
   MOVE ZERO TO D01
                D02
                VOLUME-MAX
                F02
                F03 OF CSV-F-COMP
                C02 OF CSV-C-BINARY
                C03 OF CSV-C-BINARY
                F03 OF CSV-F-DATA
                PROCESS-MAX
                CPU-MAX
                UNIQUE-COUNTER
*               GAG.  IPM AAI.
                MEASURE-FILE-OVERFLOW
                NUMBER-LINKED-DISCOPENS
                NUMBER-UNLINKED-DISCOPENS
                NUMBER-UNLINKED-DISCOPENS-R.
   MOVE 32767 TO DFVERSION-SAVE.
*----------------------------------------------------------------------------
 3000-CORE-PROCESSING-CONT.
* Obtain all disc information
     DISPLAY INFO-08.
     PERFORM 3201-SPDISKINFO
         VARYING MEASURE-INDEX FROM 1 BY 1
         UNTIL MEASURE-INDEX > MEASURE-MAX.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">VOLUME-MAX: ", VOLUME-MAX
     END-IF.
* Fill in D01
* Soln 10-020415-8203 : start
* Soln 10-040510-5889 : start
* IF DISKCONVERTTO-PRESENT
*   COMPUTE
*        D01 ROUNDED = VOLUME-MAX + DISK-POWER-VALUE
*   END-COMPUTE
* ELSE
     MOVE VOLUME-MAX TO D01
* END-IF.
* Soln 10-040510-5889 : end
* Soln 10-020415-8203 : end
* Calculate number of drives. For each measure data file, for each vol.,
* there will be two records for unmirrorred vol. and more than that for
* mirrorred vol. The calculation of # of drives is then by storing  the
* number of occurrances of a volume across all the data files and the number
* of measure files it occurs in, checking if the number of occurrances is
* > the product of # of files * 4. If so, the volume is mirrorred.
* TPR # S930119 1403 14751.
     MOVE ZERO TO D02.
     PERFORM VARYING VOLUME-INDEX FROM 1 BY 1
           UNTIL VOLUME-INDEX > VOLUME-MAX
        IF NO-OF-VOLUME-RECS(VOLUME-INDEX) >
             (NO-OF-FILES(VOLUME-INDEX) * 4)
           ADD 2 TO D02
        ELSE
           ADD 1 TO D02
        END-IF
     END-PERFORM.
* Soln 10-020415-8203 : start
* Soln 10-040510-5889 : start
*   IF DISKCONVERTTO-PRESENT
*     COMPUTE
*          D02 ROUNDED = D02 + DISK-POWER-VALUE
*     END-COMPUTE
*   END-IF.
* Soln 10-040510-5889 : end
* Soln 10-020415-8203 : end
* Sort VOLUME-TABLE
     PERFORM 3240-VOLUME-TABLE-SORT.
* Obtain discopen totals for each volume
     MOVE ZERO TO FIRSTCALL.
     PERFORM 3500-READ-DISCOPEN-TOTALS VARYING MEASURE-INDEX
        FROM 1 BY 1 UNTIL MEASURE-INDEX > MEASURE-MAX.
* Calculate READ/WRITE cost and disc-to-discopen ratio for each volume
     PERFORM 3250-CALCULATE-READ-WRITE-COST.
* Obtain CPU and process information on a system by system basis; for each
* system go through the corresponding measurement data files. If audit report
* is selected, process information must be released to sort
     IF AUDIT-REPORT-YES
         MOVE ZERO TO LAST-RECORD-TEST
         SORT SORT-FILE ASCENDING SORT-WKLD-NAME
                        ASCENDING SORT-SYSTEM-NAME
                        ASCENDING SORT-PROGRAM-FILE-NAME
                        ASCENDING SORT-PROCESS-NAME
                        ASCENDING SORT-CPU-NUM
                        ASCENDING SORT-PIN-X
             INPUT  PROCEDURE 3010-CORE-PROCESSING-CONT
             OUTPUT PROCEDURE 4000-PRINT-REPORT
     ELSE
         PERFORM 3010-CORE-PROCESSING-CONT
     END-IF.
     PERFORM 6000-WRITE-CSV.
** Fill up the csv array for run summary
     MOVE CSV-TEMP-1 TO RUN-CSV-LINE-1(FILE-NUM).
     MOVE CSV-TEMP-2 TO RUN-CSV-LINE-2(FILE-NUM).
     MOVE CSV-TEMP-3 TO RUN-CSV-ADV(FILE-NUM).
     MOVE SPACES     TO CSV-TEMP-3.
*----------------------------------------------------------------------------
 3010-CORE-PROCESSING-CONT.
* Obtain information on a system by system basis
     MOVE "$*" TO FILE-NAME OF ALL-DISCOPENS (1:2).
     PERFORM 3020-SYSTEM-LOOP VARYING SYSTEM-INDEX FROM 1 BY 1
         UNTIL SYSTEM-INDEX > SYSTEM-MAX.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">NUMBER-LINKED-DISCOPENS: ",
                   NUMBER-LINKED-DISCOPENS,
                 " NUMBER-UNLINKED-DISCOPENS: ",
                   NUMBER-UNLINKED-DISCOPENS,
*                  NUMBER-UNLINKED-DISCOPENS-R IS THE NUMBER OF DISCOPENS
*                  THAT WERE NOT LINKED BECAUSE THE OWNER PROCESSES WERE
*                  ON REMOTE SYSTEMS THAT WERE NOT MEASURED
                 " NUMBER-UNLINKED-DISCOPENS-R: ",
                   NUMBER-UNLINKED-DISCOPENS-R
     END-IF.
* Calculate percentage of discopens linked
     IF NOT (NUMBER-LINKED-DISCOPENS ZERO AND NUMBER-UNLINKED-DISCOPENS ZERO)
         COMPUTE PERCENT-LINKED = NUMBER-LINKED-DISCOPENS *
             100 / (NUMBER-LINKED-DISCOPENS + NUMBER-UNLINKED-DISCOPENS)
         MOVE PERCENT-LINKED TO PERCENTAGE-LINKED-DISCOPENS
         MOVE PERCENTAGE-LINKED-DISCOPENS TO CSV-LINK
         DISPLAY PERCENTAGE-LINKED-DISCOPENS, SPACE, INFO-13
         IF PERCENT-LINKED < 90
            DISPLAY INFO-18
            IF CSV-TEMP-3 = SPACES
              MOVE INFO-18 TO CSV-TEMP-3
            END-IF
         END-IF
     ELSE
*      GAG, IPM AAI.
       MOVE ZERO    TO CSV-LINK
       IF CSV-TEMP-3 = SPACES
         MOVE INFO-26 TO CSV-TEMP-3
       END-IF
       DISPLAY INFO-26
     END-IF.
     IF AUDIT-REPORT-YES
         DISPLAY INFO-11
     END-IF.
*----------------------------------------------------------------------------
 3020-SYSTEM-LOOP.
     DISPLAY INFO-03, SPACE, SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX).
* Obtain VERSION-INDEX for current system
     SET VERSION-INDEX TO 1.
     SEARCH VERSION-TABLE
         END
*            This should never occur !
             PERFORM
                 STRING COMPLETION-56     DELIMITED SIZE
                        " (version link)" DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 MOVE 1 TO ABEND-REQUIRED-FLAG
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN VERSION-VALUE (VERSION-INDEX) = SYSTEM-VERSION (SYSTEM-INDEX)
             NEXT SENTENCE
     END-SEARCH.
* Reset CPU-TABLE and PROCESS-TABLE
     MOVE ZERO TO CPU-MAX, PROCESS-MAX.
* Obtain CPU information
     DISPLAY FOUR-SPACES, INFO-06.
     PERFORM VARYING MEASURE-INDEX FROM 1 BY 1
           UNTIL MEASURE-INDEX > MEASURE-MAX
         IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
           IF MEASURE-SYSTEM-NUMBER (MEASURE-INDEX) = SYSTEM-INDEX
             PERFORM 3100-READ-CPU-INFO
           END-IF
         END-IF
     END-PERFORM.
* Fill in F02
     ADD CPU-MAX TO F02.
* Sort CPU-TABLE
     PERFORM 3140-CPU-TABLE-SORT.
* Obtain process information
     DISPLAY FOUR-SPACES, INFO-09.
     PERFORM VARYING MEASURE-INDEX FROM 1 BY 1
           UNTIL MEASURE-INDEX > MEASURE-MAX
         IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
           IF MEASURE-SYSTEM-NUMBER (MEASURE-INDEX) = SYSTEM-INDEX
              PERFORM 3300-READ-PROCESS-INFO
           END-IF
         END-IF
     END-PERFORM.
* Sort PROCESS-TABLE
     PERFORM 3370-PROCESS-TABLE-SORT.
* Insert PROCESS-UNIQUE
     PERFORM 3380-INSERT-PROCESS-UNIQUE.
* Obtain discopen information
     DISPLAY FOUR-SPACES, INFO-10.
     PERFORM 3400-READ-DISCOPEN-INFO
           VARYING MEASURE-INDEX FROM 1 BY 1
           UNTIL MEASURE-INDEX > MEASURE-MAX.
* This time we scan all measurement data files; this is because measurements
* taken on other systems might include DISCOPEN records related to processes
* on the current system
*----------------------------------------------------------------------------
 3100-READ-CPU-INFO.
* Get CPU information
     MOVE ZERO TO FIRSTCALL.
* Read CPU counter record blocks until FIRSTCALL is ZERO.
     PERFORM 3105-GET-CPU-DATA TEST AFTER UNTIL FIRSTCALL ZERO.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">CPU-MAX: ", CPU-MAX
     END-IF.
*----------------------------------------------------------------------------
 3105-GET-CPU-DATA.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        ENTER TAL "MEASREAD_DIFF_"
        USING   MEASURE-DFNUM (MEASURE-INDEX),
             ALL-CPUS,
             MEASREAD-BUFFER,
             MEASREAD-BUFFER-LENGTH,
             BYTESRET,
             FIRSTCALL,
             MEAS-START,
             MEAS-STOP,
             OMITTED,
             SYSTEM-VERSION (SYSTEM-INDEX),
             OMITTED,
             ZERO,
             OMITTED,
             OMITTED,
             OMITTED,
             OMITTED,
             ZMSCPU-TEMPLATE-VERSION
        GIVING RESULT
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        ENTER TAL "MEASREAD_DIFF_"
        USING   MEASURE-DFNUM (MEASURE-INDEX),
             ALL-CPUS,
             MEASREAD-BUFFER,
             MEASREAD-BUFFER-LENGTH,
             BYTESRET,
             FIRSTCALL,
             MEAS-START,
             MEAS-STOP,
             OMITTED,
             SYSTEM-VERSION (SYSTEM-INDEX),
             OMITTED,
             ZERO
        GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-52  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     IF BYTESRET NOT ZERO
           PERFORM 3110-TREAT-CPU-INFO
     END-IF.
*----------------------------------------------------------------------------
 3110-TREAT-CPU-INFO.
* Treat CPU information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
        IF YOSEMITE-DATAFILE = "Y"
* We use FUNCTION LENGTH() to calculate the length of ZMSCPU-DEFINITION as
* MEASGETVERSION() returns legacy style Entity lengths.
             DIVIDE FUNCTION LENGTH(ZMSCPU-DEFINITION) INTO BYTESRET
             MOVE ZERO TO ZMSCPU-CNTR-START
             SET ZMSCPU-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3115-TREAT-CPU-ENTITY-Y
                VARYING ENTITY-COUNTER FROM 1 BY 1
                UNTIL   ENTITY-COUNTER > BYTESRET
        ELSE
*------------MeasTCM Yosemite Change-----End------------
             DIVIDE CPU-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX)
             INTO BYTESRET
             MOVE ZERO TO CPU-CNTR-START
             MOVE CPU-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX) TO CPU-CNTR-END
             SET CPU-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3115-TREAT-CPU-ENTITY
                VARYING ENTITY-COUNTER FROM 1 BY 1
                UNTIL   ENTITY-COUNTER > BYTESRET
*------------MeasTCM Yosemite Change----Start-----------
        END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
** Any logical change in procedure 3115-TREAT-CPU-ENTITY could also apply
** to the equivalent procedure 3115-TREAT-CPU-ENTITY-Y. Please check.
 3115-TREAT-CPU-ENTITY.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF CPU-DEFINITION TO CPU-PNTR.
     MOVE MEASREAD-BUFFER( CPU-CNTR-START + 1  : FUNCTION LENGTH(CPU-DEFINITION) )   TO CPU-DEFINITION
     ADD CPU-CNTR-END      TO  CPU-CNTR-START
*    SET CPU-PNTR UP BY FUNCTION LENGTH(CPU-DEFINITION).
* Soln 10-000602-8415. Check for CONVERTTO and accordingly determine I10
* (the base CPU OS version) of  CSV-I-DATA, from the CPU-DEFINITION buffer.
* Changes start here.
     IF (((CPU-TYPE OF CPU-DEFINITION = TEMP-CPU-TYPE) AND
      (CPU-SUBTYPE OF CPU-DEFINITION = TEMP-CPU-SUBTYPE) AND CONVERTTO-PRESENT)
      OR (NOT CONVERTTO-PRESENT))     AND
      (CPU-TYPE-FLAG = 0 OR TEMP-OS-VERSION-Z < OS-VERSION OF CPU-DEFINITION)
* CPU-TYPE-FLAG is set to 1. So the latest OS version is taken as I10, when
* when measure files of different OS versions are present in this MeasTCM run.
            MOVE 1 TO CPU-TYPE-FLAG
            MOVE OS-VERSION OF CPU-DEFINITION TO TEMP-OS-VERSION-X
                                                 TEMP-OS-VERSION-Z
            MOVE VERSION-LETTER OF TEMP-OS-VERSION-Y TO VERSION-LETTER OF I10
            MOVE LOW-VALUES TO VERSION-LETTER OF TEMP-OS-VERSION-Y
            MOVE TEMP-OS-VERSION-X TO VERSION-NUMBER OF I10
     END-IF.
* Changes end here - Soln 10-000602-8415.
*    GAG.  IPM AAI.  Check if CPU record is valid.
     IF (FROM-TIMESTAMP OF CPU-DEFINITION + USEC-MINUTE) <
        MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
      OR
        (TO-TIMESTAMP OF CPU-DEFINITION - USEC-MINUTE) >
          MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
       DISPLAY INFO-25
       DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
       MOVE INFO-25 TO CSV-TEMP-3
       MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
       MOVE 1 TO MEASURE-FILE-OVERFLOW
       MOVE ZERO TO BYTESRET, FIRSTCALL
     ELSE
       PERFORM 3115-00-CONTINUE-CPU-ENTITY
     END-IF.
*----------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3115-TREAT-CPU-ENTITY-Y could also apply
** to the equivalent procedure 3115-TREAT-CPU-ENTITY. Please check.
 3115-TREAT-CPU-ENTITY-Y.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*      SET ADDRESS OF ZMSCPU-DEFINITION TO ZMSCPU-PNTR.
       MOVE MEASREAD-BUFFER( ZMSCPU-CNTR-START + 1  : FUNCTION LENGTH(ZMSCPU-DEFINITION) )   TO ZMSCPU-DEFINITION
       ADD FUNCTION LENGTH(ZMSCPU-DEFINITION)      TO  ZMSCPU-CNTR-START
*      SET ZMSCPU-PNTR UP BY FUNCTION LENGTH(ZMSCPU-DEFINITION).
* Soln 10-000602-8415. Check for CONVERTTO and accordingly determine I10
* (the base CPU OS version) of  CSV-I-DATA, from the ZMSCPU-DEFINITION buffer.
* Changes start here.
      IF (((CPU-TYPE OF ZMSCPU-DEFINITION = TEMP-CPU-TYPE) AND
       (CPU-SUBTYPE OF ZMSCPU-DEFINITION = TEMP-CPU-SUBTYPE) AND CONVERTTO-PRESENT)
       OR (NOT CONVERTTO-PRESENT))     AND
       (CPU-TYPE-FLAG = 0 OR TEMP-OS-VERSION-Z < OS-VERSION OF ZMSCPU-DEFINITION)
* CPU-TYPE-FLAG is set to 1. So the latest OS version is taken as I10, when
* when measure files of different OS versions are present in this MeasTCM run.
             MOVE 1 TO CPU-TYPE-FLAG
             MOVE OS-VERSION OF ZMSCPU-DEFINITION TO TEMP-OS-VERSION-X
                                                  TEMP-OS-VERSION-Z
             MOVE VERSION-LETTER OF TEMP-OS-VERSION-Y TO VERSION-LETTER OF I10
             MOVE LOW-VALUES TO VERSION-LETTER OF TEMP-OS-VERSION-Y
             MOVE TEMP-OS-VERSION-X TO VERSION-NUMBER OF I10
      END-IF.
* Changes end here - Soln 10-000602-8415.
*    GAG.  IPM AAI.  Check if CPU record is valid.
      IF (FROM-TIMESTAMP OF ZMSCPU-DEFINITION + USEC-MINUTE) <
         MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
       OR
         (TO-TIMESTAMP OF ZMSCPU-DEFINITION - USEC-MINUTE) >
           MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
        DISPLAY INFO-25
        DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
        MOVE INFO-25 TO CSV-TEMP-3
        MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
        MOVE 1 TO MEASURE-FILE-OVERFLOW
        MOVE ZERO TO BYTESRET, FIRSTCALL
      ELSE
        PERFORM 3115-00-CONTINUE-CPU-ENTITY
      END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 3115-00-CONTINUE-CPU-ENTITY.
*    Extract CPU-TYPE and CPU-SUBTYPE and place in CPU-POWER-SEARCH-KEY.
     PERFORM 3139-GET-CPU-TYPE-SUBTYPE.
*    If first CPU record, save type
     IF CPU-TYPE-SAVE ZERO
       MOVE CPU-POWER-SEARCH-KEY TO CPU-TYPE-SUBTYPE-SAVE
*      GAG 21AUG98.  IPM AAJ.   Get CPU model name from CPU type, subtype.
       IF CPU-TYPE-ALPHA-SAVE = SPACES
         ENTER TAL "PROCESSOR_GETNAME_"
           USING OMITTED,
               CPU-TYPE-ALPHA-SAVE(1:CPU-TYPE-ALPHA-SAVE-LEN)
               CPU-TYPE-ALPHA-SAVE-LEN,
               OMITTED,
               OMITTED,
               OMITTED,
               CPU-TYPE-SAVE,
               OMITTED,
               OMITTED,
               CPU-SUBTYPE-SAVE
           GIVING WS-CHECK-ERROR
         IF WS-CHECK-ERROR NOT = 0
            MOVE CPU-TYPE-SAVE    TO NUMBER-DISPLAY
            MOVE CPU-SUBTYPE-SAVE TO NUMBER-DISPLAY-2
            STRING COMPLETION-68  DELIMITED SIZE
                   SPACE          DELIMITED SIZE
                   NUMBER-DISPLAY DELIMITED SIZE
                   ","
                   NUMBER-DISPLAY-2 DELIMITED SIZE
              INTO COMPLETION-MESSAGE
            PERFORM 9010-SPCOMPLETION
         END-IF
       END-IF
     ELSE
       IF CPU-POWER-SEARCH-KEY NOT = CPU-TYPE-SUBTYPE-SAVE
          AND NOT CONVERTTO-PRESENT
*         CONVERTTO should have been specified in control file
          MOVE COMPLETION-27 TO COMPLETION-MESSAGE
          PERFORM 9010-SPCOMPLETION
       END-IF
     END-IF.
*    Check for supported CPU type.
*    Check only if CONVERTTO is used. IPM AAJ.  21AUG98
     IF CONVERTTO-PRESENT
        SET CPU-TYPE-POWER-INDEX TO 1
        SEARCH CPU-TYPE-POWER-TABLE
           END
*------------MeasTCM Yosemite Change----Start-----------
             IF YOSEMITE-DATAFILE = "Y"
                 MOVE CPU-TYPE    OF ZMSCPU-DEFINITION TO NUMBER-DISPLAY
                 MOVE CPU-SUBTYPE OF ZMSCPU-DEFINITION TO NUMBER-DISPLAY-2
             ELSE
*------------MeasTCM Yosemite Change-----End------------
                 MOVE CPU-TYPE    OF CPU-DEFINITION TO NUMBER-DISPLAY
                 MOVE CPU-SUBTYPE OF CPU-DEFINITION TO NUMBER-DISPLAY-2
*------------MeasTCM Yosemite Change----Start-----------
             END-IF
*------------MeasTCM Yosemite Change-----End------------
             STRING COMPLETION-68  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    ","
                    NUMBER-DISPLAY-2 DELIMITED SIZE
               INTO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
           WHEN CPU-TYPE-SUBTYPE (CPU-TYPE-POWER-INDEX) = CPU-POWER-SEARCH-KEY
             NEXT SENTENCE
        END-SEARCH
     END-IF.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
*    Store the CPU power and CPU number in CPU table.
        SET CPU-INDEX TO 1
        SEARCH CPU-TABLE
         AT END
*       Store processor information in CPU-TABLE and increment F02
             PERFORM 3115-10-NEW-CPU
             WHEN   CPU-NUM OF CPU-TABLE(CPU-INDEX) = CPU-NUM OF ZMSCPU-DEFINITION
                AND CPU-SYSTEM-NUMBER(CPU-INDEX) =
                    MEASURE-SYSTEM-NUMBER(MEASURE-INDEX)
             CONTINUE
        END-SEARCH
        IF CONVERTTO-PRESENT
*        COMPUTE C02 OF CSV-C-BINARY = C02 OF CSV-C-BINARY +
*              INTR-BUSY-TIME OF ZMSCPU-DEFINITION     *
*              (CPU-POWER (CPU-INDEX)                         /
*              CPU-POWER-VALUE)                        *
*              (CONVERTTO-IPU-VALUE                           /
*              CPU-IPUCOUNT (CPU-INDEX))
         COMPUTE C03 OF CSV-C-BINARY = C03 OF CSV-C-BINARY +
              PROCESS-OVHD   OF ZMSCPU-DEFINITION     *
              (CPU-POWER (CPU-INDEX)                         /
              CPU-POWER-VALUE)                        *
              (CONVERTTO-IPU-VALUE                           /
              CPU-IPUCOUNT (CPU-INDEX))
         COMPUTE F03 OF CSV-F-COMP   = F03 OF CSV-F-COMP   +
              (CPU-POWER (CPU-INDEX)                         /
              CPU-POWER-VALUE)                        *
              (CONVERTTO-IPU-VALUE                           /
              CPU-IPUCOUNT (CPU-INDEX))
        ELSE
*          ADD INTR-BUSY-TIME OF ZMSCPU-DEFINITION
*              TO C02 OF CSV-C-BINARY
          ADD PROCESS-OVHD   OF ZMSCPU-DEFINITION
              TO C03 OF CSV-C-BINARY
          ADD 1 TO F03 OF CSV-F-COMP
        END-IF
     ELSE
*------------MeasTCM Yosemite Change-----End------------
*    Store the CPU power and CPU number in CPU table.
        SET CPU-INDEX TO 1
        SEARCH CPU-TABLE
        AT END
*       Store processor information in CPU-TABLE and increment F02
            PERFORM 3115-10-NEW-CPU
            WHEN   CPU-NUM OF CPU-TABLE(CPU-INDEX) = CPU-NUM OF CPU-DEFINITION
               AND CPU-SYSTEM-NUMBER(CPU-INDEX) =
                   MEASURE-SYSTEM-NUMBER(MEASURE-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
*            NEXT SENTENCE
             CONTINUE
*------------MeasTCM Yosemite Change-----End------------
        END-SEARCH
        IF CONVERTTO-PRESENT
           COMPUTE C02 OF CSV-C-BINARY = C02 OF CSV-C-BINARY +
              INTR-BUSY-TIME OF CPU-DEFINITION     *
              CPU-POWER (CPU-INDEX)                         /
              CPU-POWER-VALUE
           COMPUTE C03 OF CSV-C-BINARY = C03 OF CSV-C-BINARY +
              PROCESS-OVHD   OF CPU-DEFINITION     *
              CPU-POWER (CPU-INDEX)                         /
              CPU-POWER-VALUE
           COMPUTE F03 OF CSV-F-COMP   = F03 OF CSV-F-COMP   +
              CPU-POWER (CPU-INDEX)                         /
              CPU-POWER-VALUE
        ELSE
           ADD INTR-BUSY-TIME OF CPU-DEFINITION
              TO C02 OF CSV-C-BINARY
           ADD PROCESS-OVHD   OF CPU-DEFINITION
              TO C03 OF CSV-C-BINARY
           ADD 1 TO F03 OF CSV-F-COMP
        END-IF
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*---------------------------------------------------------------------------
 3115-10-NEW-CPU.
     ADD 1 TO CPU-MAX.
     IF CPU-MAX > CPU-CEILING
*       Too many processor entries
        STRING COMPLETION-54  DELIMITED SIZE
             " (CPU-TABLE)" DELIMITED SIZE
            INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET CPU-INDEX TO CPU-MAX.
*    Save Guardian series letter for this CPU
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        MOVE LETTER OF OS-VERSION OF ZMSCPU-DEFINITION TO CPU-LETTER(CPU-INDEX)
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        MOVE LETTER OF CPU-DEFINITION TO CPU-LETTER(CPU-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*    If guardian series unrecognised then assume greater than D, so use D.
*     IF CPU-LETTER(CPU-INDEX) NOT = "C" AND NOT = "D"
*         MOVE "D" TO CPU-LETTER(CPU-INDEX)
*     END-IF.
*    If guardian series unrecognised then assume G, so use G.
     IF CPU-LETTER(CPU-INDEX) NOT = "G"
         MOVE "G" TO CPU-LETTER(CPU-INDEX)
     END-IF.
*    Store CPU power if CONVERTO is used.   IPM AAJ  21AUG98.
     IF CONVERTTO-PRESENT
*       IF CPU-LETTER(CPU-INDEX) < "D"
*          MOVE CPU-POWER-VALUE-CNN (CPU-TYPE-POWER-INDEX)
*             TO CPU-POWER (CPU-INDEX)
*       ELSE
*          MOVE CPU-POWER-VALUE-DNN (CPU-TYPE-POWER-INDEX)
*             TO CPU-POWER (CPU-INDEX)
          MOVE CPU-POWER-VALUE-GNN (CPU-TYPE-POWER-INDEX)
             TO CPU-POWER (CPU-INDEX)
          MOVE CPU-IPUCOUNT-NUMBER (CPU-TYPE-POWER-INDEX)
             TO CPU-IPUCOUNT (CPU-INDEX)
*       END-IF
     END-IF.
*    Store CPU number
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        MOVE CPU-NUM OF ZMSCPU-DEFINITION
         TO CPU-NUM OF CPU-TABLE (CPU-INDEX)
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        MOVE CPU-NUM OF CPU-DEFINITION
         TO CPU-NUM OF CPU-TABLE (CPU-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*    Store system number
     MOVE MEASURE-SYSTEM-NUMBER(MEASURE-INDEX)
          TO CPU-SYSTEM-NUMBER(CPU-INDEX).
*---------------------------------------------------------------------------
 3139-GET-CPU-TYPE-SUBTYPE.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        MOVE IPUS OF ZMSCPU-DEFINITION TO CPU-POWER-SEARCH-IPUCOUNT
        IF CPU-POWER-SEARCH-IPUCOUNT = ZERO
           MOVE 1 TO CPU-POWER-SEARCH-IPUCOUNT
        END-IF
        MOVE CPU-TYPE OF ZMSCPU-DEFINITION TO CPU-POWER-SEARCH-TYPE
*        IF (ADDRESS OF CPU-SUBTYPE OF ZMSCPU-DEFINITION < ZMSCPU-PNTR) MODIFIED BY SANGEETHA
         IF (CPU-SUBTYPE OF ZMSCPU-DEFINITION > ZERO)
          MOVE CPU-SUBTYPE OF ZMSCPU-DEFINITION TO CPU-POWER-SEARCH-SUBTYPE
        ELSE
          MOVE ZERO TO CPU-POWER-SEARCH-SUBTYPE
        END-IF
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        MOVE CPU-TYPE OF CPU-DEFINITION TO CPU-POWER-SEARCH-TYPE
*        IF (ADDRESS OF CPU-SUBTYPE OF CPU-DEFINITION < CPU-PNTR)  MODIFIED BY SANGEETHA
         IF (CPU-SUBTYPE OF CPU-DEFINITION > ZERO)
          MOVE CPU-SUBTYPE OF CPU-DEFINITION TO CPU-POWER-SEARCH-SUBTYPE
        ELSE
          MOVE ZERO TO CPU-POWER-SEARCH-SUBTYPE
        END-IF
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 3140-CPU-TABLE-SORT.
* Sort CPU-TABLE in ascending order according to CPU-NUM using the Heapsort
* algorithm
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY CPU-MAX
         INDEX-1 BY CPU-INDEX
         INDEX-2 BY CPU-INDEX-2
         TABLE   BY CPU-TABLE
         TEMP    BY CPU-TEMP
         KEY     BY CPU-NUM.
*----------------------------------------------------------------------------
 3201-SPDISKINFO.
        CALL SPDISKINFO.
*----------------------------------------------------------------------------
*---------------------------------------------------------------------------
 3240-VOLUME-TABLE-SORT.
* Sort VOLUME-TABLE in ascending order according to VOLUME-SORT-KEY using the
* Heapsort algorithm
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY VOLUME-MAX
         INDEX-1 BY VOLUME-INDEX
         INDEX-2 BY VOLUME-INDEX-2
         TABLE   BY VOLUME-SORT-MOVE
         TEMP    BY VOLUME-TEMP
         KEY     BY VOLUME-SORT-KEY.
*----------------------------------------------------------------------------
 3250-CALCULATE-READ-WRITE-COST.
     IF DEBUG-MODE
           DISPLAY
         ">V-S-N V-N      TYPE  D-R-C      D-W-C      D-T-D-R-R        D-T-D-W-R"
     END-IF.
     PERFORM 3255-CALCULATE
           VARYING VOLUME-INDEX FROM 1 BY 1
           UNTIL VOLUME-INDEX > VOLUME-MAX.
*----------------------------------------------------------------------------
 3255-CALCULATE.
*------------MeasTCM Yosemite Change----Start-----------
* SEEK-BUSY-TIME counter is not present in ZMSDISC-Definition.
* Hence, the code below should NOT execute for YOSEMITE.
   IF YOSEMITE-DATAFILE = "N"
*------------MeasTCM Yosemite Change-----End------------
*      For each volume, increment read and write busy time to include
*      explicit seek busy time.
     IF VOLUME-SEEK-BUSY-TIME             (VOLUME-INDEX) NOT ZERO AND
        VOLUME-READ-BUSY-TIME             (VOLUME-INDEX) NOT ZERO AND
        VOLUME-WRITE-BUSY-TIME            (VOLUME-INDEX) NOT ZERO
* Soln 10-001226-8148. For correct computation of Volume-write-busy-time, store
* the denominator, (Volume-read-busy-time + Volume-write-busy-time), in a temp
* variable because Volume-read-busy-time is modified in the next computation.
         COMPUTE TEMP-DENOMINATOR = VOLUME-READ-BUSY-TIME  (VOLUME-INDEX) +
                           VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX)
         COMPUTE VOLUME-READ-BUSY-TIME   (VOLUME-INDEX) =
                 VOLUME-READ-BUSY-TIME   (VOLUME-INDEX) +
                 VOLUME-READ-BUSY-TIME   (VOLUME-INDEX) *
                 VOLUME-SEEK-BUSY-TIME   (VOLUME-INDEX) /
                 TEMP-DENOMINATOR
* Commented for Soln 10-001226-8148.
*                 (VOLUME-READ-BUSY-TIME  (VOLUME-INDEX) +
*                  VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX))
         COMPUTE VOLUME-WRITE-BUSY-TIME   (VOLUME-INDEX) =
                 VOLUME-WRITE-BUSY-TIME   (VOLUME-INDEX) +
                 VOLUME-WRITE-BUSY-TIME   (VOLUME-INDEX) *
                 VOLUME-SEEK-BUSY-TIME    (VOLUME-INDEX) /
                 TEMP-DENOMINATOR
* Commented for Soln 10-001226-8148.
*                 (VOLUME-READ-BUSY-TIME   (VOLUME-INDEX) +
*                  VOLUME-WRITE-BUSY-TIME  (VOLUME-INDEX))
     END-IF
*------------MeasTCM Yosemite Change----Start-----------
   END-IF.
*------------MeasTCM Yosemite Change-----End------------
*    For each volume, calculate the cost of a read and a write
*    (including seek).
     IF VOLUME-READS (VOLUME-INDEX) NOT ZERO
         DIVIDE VOLUME-READ-BUSY-TIME          (VOLUME-INDEX) BY
                VOLUME-READS                   (VOLUME-INDEX) GIVING
                DISC-READ-COST                 (VOLUME-INDEX)
     ELSE
         MOVE ZERO TO DISC-READ-COST           (VOLUME-INDEX)
     END-IF.
     IF VOLUME-WRITES (VOLUME-INDEX) NOT ZERO
         DIVIDE VOLUME-WRITE-BUSY-TIME         (VOLUME-INDEX) BY
                VOLUME-WRITES                  (VOLUME-INDEX) GIVING
                DISC-WRITE-COST                (VOLUME-INDEX)
     ELSE
         MOVE ZERO TO DISC-WRITE-COST          (VOLUME-INDEX)
     END-IF.
*    For each volume, calculate the disc-to-discopen ratio
*    (including seek).
     IF VOLUME-DOPN-READS (VOLUME-INDEX) NOT ZERO
         DIVIDE VOLUME-READS                   (VOLUME-INDEX) BY
                VOLUME-DOPN-READS              (VOLUME-INDEX) GIVING
                DISC-TO-DOPN-READ-RATIO        (VOLUME-INDEX)
           ON SIZE ERROR
               MOVE MAX-VALUE-13 TO DISC-TO-DOPN-READ-RATIO(VOLUME-INDEX)
     ELSE
         MOVE ZERO TO DISC-TO-DOPN-READ-RATIO  (VOLUME-INDEX)
     END-IF.
     IF VOLUME-DOPN-WRITES (VOLUME-INDEX) NOT ZERO
         DIVIDE VOLUME-WRITES                  (VOLUME-INDEX) BY
                VOLUME-DOPN-WRITES             (VOLUME-INDEX) GIVING
                DISC-TO-DOPN-WRITE-RATIO       (VOLUME-INDEX)
           ON SIZE ERROR
               MOVE MAX-VALUE-13 TO DISC-TO-DOPN-WRITE-RATIO(VOLUME-INDEX)
     ELSE
         MOVE ZERO TO DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)
     END-IF.
*    Display debug fields
     IF DEBUG-MODE
         DISPLAY                        SPACE,
             VOLUME-SYSTEM-NUMBER     (VOLUME-INDEX), SPACE,
             VOLUME-NAME              (VOLUME-INDEX), SPACE,
             VOLUME-DEV-SUBTYPE       (VOLUME-INDEX), SPACE,
             DISC-READ-COST           (VOLUME-INDEX), SPACE,
             DISC-WRITE-COST          (VOLUME-INDEX), SPACE,
             DISC-TO-DOPN-READ-RATIO  (VOLUME-INDEX), SPACE,
             DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)
     END-IF.
*----------------------------------------------------------------------------
 3300-READ-PROCESS-INFO.
* Get process information
     MOVE ZERO TO FIRSTCALL.
* Read process counter blocks until FIRSTCALL is ZERO.
     PERFORM TEST AFTER UNTIL FIRSTCALL ZERO
*------------MeasTCM Yosemite Change----Start-----------
         IF YOSEMITE-DATAFILE = "Y"
            ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-PROCESSES,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION (SYSTEM-INDEX),
               OMITTED,
               ZERO,
               OMITTED,
               OMITTED,
               OMITTED,
               OMITTED,
               ZMSPROC-TEMPLATE-VERSION
            GIVING RESULT
         ELSE
*------------MeasTCM Yosemite Change-----End------------
            ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-PROCESSES,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION (SYSTEM-INDEX),
               OMITTED,
               ZERO
            GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
          END-IF
*------------MeasTCM Yosemite Change-----End------------
         IF RESULT NOT ZERO
             MOVE RESULT TO NUMBER-DISPLAY
             STRING COMPLETION-52  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
             PERFORM 9010-SPCOMPLETION
         END-IF
         IF BYTESRET NOT ZERO
             PERFORM 3310-TREAT-PROCESS-INFO
         END-IF
     END-PERFORM.
* Display debug fields
     IF DEBUG-MODE
         DISPLAY ">PROCESS-MAX: ", PROCESS-MAX
     END-IF.
*----------------------------------------------------------------------------
 3310-TREAT-PROCESS-INFO.
* Treat process information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
         IF YOSEMITE-DATAFILE = "Y"
* We use FUNCTION LENGTH() to calculate the length of ZMSPROC-DEFINITION as
* MEASGETVERSION() returns legacy style Entity lengths.
             DIVIDE FUNCTION LENGTH(ZMSPROC-DEFINITION) INTO BYTESRET
             MOVE ZERO TO ZMSPROC-CNTR-START
             SET ZMSPROC-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3315-TREAT-PROCESS-ENTITY-Y
                VARYING ENTITY-COUNTER FROM 1 BY 1
                UNTIL   ENTITY-COUNTER > BYTESRET
         ELSE
*------------MeasTCM Yosemite Change-----End------------
             DIVIDE PROCESS-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX)
             INTO BYTESRET
             MOVE ZERO TO PROCESS-CNTR-START
             MOVE PROCESS-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX) TO PROCESS-CNTR-END
             SET PROCESS-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3315-TREAT-PROCESS-ENTITY
                VARYING ENTITY-COUNTER FROM 1 BY 1
                UNTIL   ENTITY-COUNTER > BYTESRET
*------------MeasTCM Yosemite Change----Start-----------
          END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
** Any logical change in procedure 3315-TREAT-PROCESS-ENTITY could also apply
** to the equivalent procedure 3315-TREAT-PROCESS-ENTITY-Y. Please check.
 3315-TREAT-PROCESS-ENTITY.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF PROCESS-DEFINITION TO PROCESS-PNTR.
     MOVE MEASREAD-BUFFER( PROCESS-CNTR-START + 1  : FUNCTION LENGTH(PROCESS-DEFINITION) )   TO PROCESS-DEFINITION
     ADD PROCESS-CNTR-END      TO  PROCESS-CNTR-START
*     SET PROCESS-PNTR UP BY FUNCTION LENGTH(PROCESS-DEFINITION).
* Check for measure allocation error
* Soln 10-000518-8168. Check MEASURE counters. If 32-bit counters overflow,
* use 64-bit counters.
     MOVE ZERO TO CONDITION.
     IF ((SENT-BYTES-F OF PROCESS-DEFINITION < 0) AND
        (SENT-BYTES OF PROCESS-DEFINITION < 0)) OR
        ((RETURNED-BYTES-F OF PROCESS-DEFINITION < 0) AND
        (RETURNED-BYTES OF PROCESS-DEFINITION < 0)) OR
        ((RECEIVED-BYTES-F OF PROCESS-DEFINITION < 0) AND
        (RECEIVED-BYTES OF PROCESS-DEFINITION < 0)) OR
        ((REPLY-BYTES-F OF PROCESS-DEFINITION < 0) AND
        (REPLY-BYTES OF PROCESS-DEFINITION < 0))
        MOVE 1 TO CONDITION
     END-IF.
* Line commented for Soln 10-000518-8168.
*     IF ENTITY-ERROR OF PROCESS-DEFINITION NOT ZERO
      IF (ENTITY-ERROR OF PROCESS-DEFINITION > 0) OR CONDITION = 1
*  End of part of the fix of Soln 10-000518-8168.
        ADD 1  TO PROCESS-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
*         MOVE ENTITY-ERROR OF PROCESS-DEFINITION
*            TO NUMBER-DISPLAY
*         STRING COMPLETION-55  DELIMITED SIZE
*                SPACE          DELIMITED SIZE
*                NUMBER-DISPLAY DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
     ELSE
*      GAG.  IPM AAI.  Check if PROCESS record is valid.
       IF (FROM-TIMESTAMP OF PROCESS-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF PROCESS-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3315-00-CONT-PROCESS-INFO
       END-IF
     END-IF.
*----------------------------------------------------------------------------
** Any logical change in procedure 3315-00-CONT-PROCESS-INFO could also apply
** to the equivalent procedure 3315-00-CONT-PROCESS-INFO-Y. Please check.
 3315-00-CONT-PROCESS-INFO.
* Store process information
     ADD 1 TO PROCESS-MAX.
     IF PROCESS-MAX > PROCESS-CEILING
*        Too many processes
         MOVE COMPLETION-62 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET PROCESS-INDEX TO PROCESS-MAX.
     MOVE CPU-NUM OF PROCESS-DEFINITION
         TO PROCESS-CPU-NUM (PROCESS-INDEX).
     MOVE PIN OF PROCESS-DEFINITION
         TO PROCESS-PIN (PROCESS-INDEX).
     MOVE FROM-TIMESTAMP OF PROCESS-DEFINITION
         TO PROCESS-FROM (PROCESS-INDEX).
     MOVE TO-TIMESTAMP OF PROCESS-DEFINITION
         TO PROCESS-TO (PROCESS-INDEX).
* Push stack for 3340-MATCH-WKLD
     MOVE USERID-GROUP OF USERID OF PROCESS-DEFINITION
         TO S-GROUP.
     MOVE USER         OF USERID OF PROCESS-DEFINITION
         TO S-USER.
     MOVE PROCESS-NAME OF PROCESS-DEFINITION
         TO S-PROCESS-NAME.
    MOVE PROGRAM-FILE-NAME OF PROCESS-DEFINITION
         TO S-PROGRAM-FILE-NAME.
* Compare this process with each of the workload entries to see where it fits
     SET NO-MATCH TO TRUE.
     SET WKLD-INDEX-2 TO WKLD-MAX.
     SET WKLD-INDEX-2 DOWN BY 1.
* The loop can go up to category 98 (_OTHER)
     PERFORM 3340-MATCH-WKLD TEST AFTER
         VARYING WKLD-INDEX FROM 1 BY 1
         UNTIL WKLD-INDEX >= WKLD-INDEX-2
           OR MATCH-FOUND.
     IF no-match
*        This should never happen ...
         STRING COMPLETION-56      DELIMITED SIZE
                " (no WKLD match)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Fill in process workload number
     MOVE WKLD-NUMBER (WKLD-INDEX) TO PROCESS-WKLD-NUMBER (PROCESS-INDEX).
* Determine corresponding TITLE-INDEX
     SEARCH ALL title-table
         END
*           This should never happen ...
            STRING COMPLETION-56 DELIMITED SIZE
                   " (no title)" DELIMITED SIZE
                   INTO COMPLETION-MESSAGE
            MOVE 1 TO ABEND-REQUIRED-FLAG
            PERFORM 9010-SPCOMPLETION
         WHEN title-number OF title-table (title-index) =
              wkld-number (wkld-index)
             NEXT SENTENCE
     END-SEARCH.
* MESSAGES-RECEIVED and MESSAGES-SENT can be negative since original counters
* are unsigned
     IF MESSAGES-RECEIVED OF PROCESS-DEFINITION NEGATIVE OR
        MESSAGES-SENT     OF PROCESS-DEFINITION NEGATIVE
         STRING COMPLETION-56                        DELIMITED SIZE
                " (MESSAGES-RECEIVED/SENT negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Add process counters TO CSV-W-BINARY
     ADD MESSAGES-RECEIVED OF PROCESS-DEFINITION
        TO W03 OF CSV-W-BINARY (TITLE-INDEX).
     ADD MESSAGES-SENT     OF PROCESS-DEFINITION
        TO W04 OF CSV-W-BINARY (TITLE-INDEX).
     IF CONVERTTO-PRESENT
*        Find out CPU in which process is executing
         PERFORM 3315-10-SEARCH-CPU
*        Add process counters TO CSV-W-BINARY
         PERFORM 3315-20-COMPUTE-A
     ELSE
         PERFORM 3315-30-COMPUTE-B
     END-IF.
     IF AUDIT-REPORT-YES
*        Release process information to sort
         PERFORM 3315-50-RELEASE
     END-IF.
*---------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3315-TREAT-PROCESS-ENTITY-Y could also apply
** to the equivalent procedure 3315-TREAT-PROCESS-ENTITY. Please check.
 3315-TREAT-PROCESS-ENTITY-Y.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF ZMSPROC-DEFINITION TO ZMSPROC-PNTR.
     MOVE MEASREAD-BUFFER( ZMSPROC-CNTR-START + 1  : FUNCTION LENGTH(ZMSPROC-DEFINITION) )   TO ZMSPROC-DEFINITION
     ADD FUNCTION LENGTH(ZMSPROC-DEFINITION)      TO  ZMSPROC-CNTR-START
*     SET ZMSPROC-PNTR UP BY FUNCTION LENGTH(ZMSPROC-DEFINITION).
* Check for measure allocation error
* Soln 10-000518-8168. Check MEASURE counters. If 32-bit counters overflow,
* use 64-bit counters.
*-----------Soln 10-060505-6280--start----
* This allows the processes with priority 255 to be refrained from
* being processed to be put into the specified categories.
     IF (PRIORITY OF ZMSPROC-DEFINITION) = 255
         PERFORM 9980-COMPUTE-INTR-AUX
         MOVE INTR-AUX-BUSY TO C02 OF CSV-C-BINARY
     ELSE
*-----------Soln 10-060505-6280--end----
     MOVE ZERO TO CONDITION
*IF CONDITION MODIFIED BY SANGEETHA
      IF (SENT-BYTES OF ZMSPROC-DEFINITION < 0) OR
         (RETURNED-BYTES OF ZMSPROC-DEFINITION < 0) OR
         (RECEIVED-BYTES OF ZMSPROC-DEFINITION < 0) OR
         (REPLY-BYTES OF ZMSPROC-DEFINITION < 0)
        MOVE 1 TO CONDITION
     END-IF
* Line commented for Soln 10-000518-8168.
*     IF ENTITY-ERROR OF PROCESS-DEFINITION NOT ZERO
     IF (ENTITY-ERROR OF ZMSPROC-DEFINITION > 0) OR CONDITION = 1
*  End of part of the fix of Soln 10-000518-8168.
        ADD 1  TO PROCESS-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
     ELSE
*      GAG.  IPM AAI.  Check if PROCESS record is valid.
       IF (FROM-TIMESTAMP OF ZMSPROC-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF ZMSPROC-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3315-00-CONT-PROCESS-INFO-Y
       END-IF
     END-IF
     END-IF.
*----------------------------------------------------------------------------
** Any logical change in procedure 3315-00-CONT-PROCESS-INFO-Y could also apply
** to the equivalent procedure 3315-00-CONT-PROCESS-INFO. Please check.
 3315-00-CONT-PROCESS-INFO-Y.
* Store process information
     ADD 1 TO PROCESS-MAX.
     IF PROCESS-MAX > PROCESS-CEILING
*        Too many processes
         MOVE COMPLETION-62 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     SET PROCESS-INDEX TO PROCESS-MAX.
     MOVE CPU-NUM OF ZMSPROC-DEFINITION
         TO PROCESS-CPU-NUM (PROCESS-INDEX).
     MOVE PIN OF ZMSPROC-DEFINITION
         TO PROCESS-PIN (PROCESS-INDEX).
     MOVE FROM-TIMESTAMP OF ZMSPROC-DEFINITION
         TO PROCESS-FROM (PROCESS-INDEX).
     MOVE TO-TIMESTAMP OF ZMSPROC-DEFINITION
         TO PROCESS-TO (PROCESS-INDEX).
* Push stack for 3340-MATCH-WKLD
     MOVE USERID-GROUP OF USERID OF ZMSPROC-DEFINITION
         TO S-GROUP.
     MOVE USER         OF USERID OF ZMSPROC-DEFINITION
         TO S-USER.
     MOVE PROCESS-NAME OF ZMSPROC-DEFINITION
         TO S-PROCESS-NAME.
     MOVE PROGRAM-FILE-NAME OF ZMSPROC-DEFINITION
         TO S-PROGRAM-FILE-NAME.
* Compare this process with each of the workload entries to see where it fits
     SET NO-MATCH TO TRUE.
     SET WKLD-INDEX-2 TO WKLD-MAX.
     SET WKLD-INDEX-2 DOWN BY 1.
* The loop can go up to category 98 (_OTHER)
     PERFORM 3340-MATCH-WKLD TEST AFTER
         VARYING WKLD-INDEX FROM 1 BY 1
         UNTIL WKLD-INDEX >= WKLD-INDEX-2
           OR MATCH-FOUND.
     IF no-match
*        This should never happen ...
         STRING COMPLETION-56      DELIMITED SIZE
                " (no WKLD match)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Fill in process workload number
     MOVE WKLD-NUMBER (WKLD-INDEX) TO PROCESS-WKLD-NUMBER (PROCESS-INDEX).
* Determine corresponding TITLE-INDEX
     SEARCH ALL title-table
         END
*           This should never happen ...
            STRING COMPLETION-56 DELIMITED SIZE
                   " (no title)" DELIMITED SIZE
                   INTO COMPLETION-MESSAGE
            MOVE 1 TO ABEND-REQUIRED-FLAG
            PERFORM 9010-SPCOMPLETION
         WHEN title-number OF title-table (title-index) =
              wkld-number (wkld-index)
             NEXT SENTENCE
     END-SEARCH.
* MESSAGES-RECEIVED and MESSAGES-SENT can be negative since original counters
* are unsigned
     IF MESSAGES-RECEIVED OF ZMSPROC-DEFINITION NEGATIVE OR
        MESSAGES-SENT     OF ZMSPROC-DEFINITION NEGATIVE
         STRING COMPLETION-56                        DELIMITED SIZE
                " (MESSAGES-RECEIVED/SENT negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Add process counters TO CSV-W-BINARY
     ADD MESSAGES-RECEIVED OF ZMSPROC-DEFINITION
        TO W03 OF CSV-W-BINARY (TITLE-INDEX)
        ON SIZE ERROR
        MOVE MAX-VALUE-19 TO W03 OF CSV-W-BINARY (TITLE-INDEX).
     ADD MESSAGES-SENT     OF ZMSPROC-DEFINITION
        TO W04 OF CSV-W-BINARY (TITLE-INDEX)
        ON SIZE ERROR
        MOVE MAX-VALUE-19 TO W04 OF CSV-W-BINARY (TITLE-INDEX).
     IF CONVERTTO-PRESENT
*        Find out CPU in which process is executing
         PERFORM 3315-10-SEARCH-CPU
*        Add process counters TO CSV-W-BINARY
         PERFORM 3315-20-COMPUTE-A-Y
     ELSE
         PERFORM 3315-30-COMPUTE-B-Y
     END-IF.
     IF AUDIT-REPORT-YES
*        Release process information to sort
         PERFORM 3315-50-RELEASE-Y
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 3315-10-SEARCH-CPU.
     SET CPU-INDEX TO 1.
     SEARCH CPU-TABLE
         END
*            This can happen if not all CPUs have been measured
             MOVE PROCESS-CPU-NUM(PROCESS-INDEX) TO ERROR-86-NUM
             STRING COMPLETION-86   DELIMITED SIZE
                    " CPU=" DELIMITED SIZE
                    ERROR-86-NUM DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
         WHEN CPU-NUM OF CPU-TABLE (CPU-INDEX) =
             PROCESS-CPU-NUM (PROCESS-INDEX)
             CONTINUE
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3315-20-COMPUTE-A could also apply
** to the equivalent procedure 3315-20-COMPUTE-A-Y. Please check.
 3315-20-COMPUTE-A.
    COMPUTE W05 OF CSV-W-BINARY (TITLE-INDEX)            =
         W05 OF CSV-W-BINARY (TITLE-INDEX)                +
         CPU-BUSY-TIME OF PROCESS-DEFINITION *
         CPU-POWER (CPU-INDEX)                            /
         CPU-POWER-VALUE
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W21 OF CSV-W-BINARY (TITLE-INDEX)            =
         W21 OF CSV-W-BINARY (TITLE-INDEX)                +
         CPU-BUSY-TIME OF PROCESS-DEFINITION *
         PRIORITY      OF PROCESS-DEFINITION *
         CPU-POWER (CPU-INDEX)                            /
         CPU-POWER-VALUE
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W21 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
* IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF TNSR-BUSY-TIME OF PROCESS-DEFINITION < PROCESS-PNTR)
      IF (TNSR-BUSY-TIME OF PROCESS-DEFINITION > 0)
        COMPUTE W22 OF CSV-W-BINARY (TITLE-INDEX)            =
           W22 OF CSV-W-BINARY (TITLE-INDEX)                +
           TNSR-BUSY-TIME OF PROCESS-DEFINITION *
           CPU-POWER (CPU-INDEX)                            /
           CPU-POWER-VALUE
           ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W22 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
     END-IF.
     IF (ACCEL-BUSY-TIME OF PROCESS-DEFINITION > 0)
        COMPUTE W23 OF CSV-W-BINARY (TITLE-INDEX)            =
           W23 OF CSV-W-BINARY (TITLE-INDEX)                +
           ACCEL-BUSY-TIME OF PROCESS-DEFINITION *
           CPU-POWER (CPU-INDEX)                            /
           CPU-POWER-VALUE
           ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W23 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        MOVE 1 TO RISC-DATA-PRESENT-FLAG
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3315-30-COMPUTE-B could also apply
** to the equivalent procedure 3315-30-COMPUTE-B-Y. Please check.
 3315-30-COMPUTE-B.
     ADD CPU-BUSY-TIME OF PROCESS-DEFINITION TO
          W05 OF CSV-W-BINARY (TITLE-INDEX)
          ON SIZE ERROR
          MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX).
*IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF TNSR-BUSY-TIME OF PROCESS-DEFINITION < PROCESS-PNTR)
      IF (TNSR-BUSY-TIME OF PROCESS-DEFINITION > 0)
        COMPUTE W22 OF CSV-W-BINARY (TITLE-INDEX)  =
             W22 OF CSV-W-BINARY (TITLE-INDEX)     +
             TNSR-BUSY-TIME OF PROCESS-DEFINITION
             ON SIZE ERROR
             MOVE MAX-VALUE-19 TO W22 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
      END-IF.
     IF (ACCEL-BUSY-TIME OF PROCESS-DEFINITION > 0)
        COMPUTE W23 OF CSV-W-BINARY (TITLE-INDEX)  =
             W23 OF CSV-W-BINARY (TITLE-INDEX)     +
             ACCEL-BUSY-TIME OF PROCESS-DEFINITION
             ON SIZE ERROR
             MOVE MAX-VALUE-19 TO W23 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        MOVE 1 TO RISC-DATA-PRESENT-FLAG
     END-IF.
     COMPUTE W21 OF CSV-W-BINARY (TITLE-INDEX) =
          W21 OF CSV-W-BINARY (TITLE-INDEX) +
          CPU-BUSY-TIME OF PROCESS-DEFINITION *
          PRIORITY      OF PROCESS-DEFINITION
          ON SIZE ERROR
          MOVE MAX-VALUE-19 TO W21 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3315-50-RELEASE could also apply
** to the equivalent procedure 3315-50-RELEASE-Y. Please check.
 3315-50-RELEASE.
     MOVE TITLE-NAME (TITLE-INDEX) TO SORT-WKLD-NAME.
     MOVE SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) TO SORT-SYSTEM-NAME.
     MOVE PROGRAM-FILE-NAME OF PROCESS-DEFINITION
         TO SORT-PROGRAM-FILE-NAME.
     MOVE PROCESS-NAME OF PROCESS-DEFINITION
         TO SORT-PROCESS-NAME.
     MOVE PROCESS-CPU-NUM (PROCESS-INDEX) TO SORT-CPU-NUM.
*    PROCESS-PIN is an unsigned integer, so the NATIVE-2 value can
*    be negative
     IF PROCESS-PIN (PROCESS-INDEX) NEGATIVE
         ADD PROCESS-PIN (PROCESS-INDEX), 65536 GIVING SORT-PIN
     ELSE
         MOVE PROCESS-PIN (PROCESS-INDEX) TO SORT-PIN
     END-IF.
     IF CONVERTTO-PRESENT
         COMPUTE SORT-CPU-BUSY-TIME                           =
             CPU-BUSY-TIME OF PROCESS-DEFINITION *
             CPU-POWER (CPU-INDEX)                            /
             CPU-POWER-VALUE
         END-COMPUTE
     ELSE
         MOVE CPU-BUSY-TIME OF PROCESS-DEFINITION TO
             SORT-CPU-BUSY-TIME
     END-IF.
     MOVE DELTA-TIME OF PROCESS-DEFINITION TO
         SORT-DELTA-TIME.
     RELEASE SORT-FILE-RECORD.
*----------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3315-20-COMPUTE-A-Y could also apply
** to the equivalent procedure 3315-20-COMPUTE-A. Please check.
 3315-20-COMPUTE-A-Y.
    COMPUTE W05 OF CSV-W-BINARY (TITLE-INDEX)            =
         W05 OF CSV-W-BINARY (TITLE-INDEX)                +
         CPU-BUSY-TIME OF ZMSPROC-DEFINITION *
         (CPU-POWER (CPU-INDEX)                            /
         CPU-POWER-VALUE)                    *
         (CONVERTTO-IPU-VALUE                              /
         CPU-IPUCOUNT (CPU-INDEX))
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W21 OF CSV-W-BINARY (TITLE-INDEX)            =
         W21 OF CSV-W-BINARY (TITLE-INDEX)                +
         CPU-BUSY-TIME OF ZMSPROC-DEFINITION *
         PRIORITY      OF ZMSPROC-DEFINITION *
         (CPU-POWER (CPU-INDEX)                            /
         CPU-POWER-VALUE)                    *
         (CONVERTTO-IPU-VALUE                              /
         CPU-IPUCOUNT (CPU-INDEX))
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W21 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION < ZMSPROC-PNTR)
        IF (NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION > 0)
        COMPUTE W22 OF CSV-W-BINARY (TITLE-INDEX)            =
           W22 OF CSV-W-BINARY (TITLE-INDEX)                +
           NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION *
           (CPU-POWER (CPU-INDEX)                            /
           CPU-POWER-VALUE)                       *
           (CONVERTTO-IPU-VALUE                              /
            CPU-IPUCOUNT (CPU-INDEX))
           ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W22 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
      END-IF.
      IF (ACCEL-BUSY-TIME OF ZMSPROC-DEFINITION > 0)
        COMPUTE W23 OF CSV-W-BINARY (TITLE-INDEX)            =
           W23 OF CSV-W-BINARY (TITLE-INDEX)                +
           ACCEL-BUSY-TIME OF ZMSPROC-DEFINITION *
           (CPU-POWER (CPU-INDEX)                            /
           CPU-POWER-VALUE)                    *
           (CONVERTTO-IPU-VALUE                              /
           CPU-IPUCOUNT (CPU-INDEX))
           ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W23 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        MOVE 1 TO RISC-DATA-PRESENT-FLAG
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3315-30-COMPUTE-B-Y could also apply
** to the equivalent procedure 3315-30-COMPUTE-B. Please check.
 3315-30-COMPUTE-B-Y.
     ADD CPU-BUSY-TIME OF ZMSPROC-DEFINITION TO
          W05 OF CSV-W-BINARY (TITLE-INDEX)
          ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX).
*IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION < ZMSPROC-PNTR)
      IF (NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION > 0)
        COMPUTE W22 OF CSV-W-BINARY (TITLE-INDEX)  =
             W22 OF CSV-W-BINARY (TITLE-INDEX)     +
             NATIVE-BUSY-TIME OF ZMSPROC-DEFINITION
             ON SIZE ERROR
             MOVE MAX-VALUE-19 TO W22 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
      END-IF.
      IF (ACCEL-BUSY-TIME OF ZMSPROC-DEFINITION > 0)
        COMPUTE W23 OF CSV-W-BINARY (TITLE-INDEX)  =
             W23 OF CSV-W-BINARY (TITLE-INDEX)     +
             ACCEL-BUSY-TIME OF ZMSPROC-DEFINITION
             ON SIZE ERROR
             MOVE MAX-VALUE-19 TO W23 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        MOVE 1 TO RISC-DATA-PRESENT-FLAG
     END-IF.
     COMPUTE W21 OF CSV-W-BINARY (TITLE-INDEX) =
          W21 OF CSV-W-BINARY (TITLE-INDEX) +
          CPU-BUSY-TIME OF ZMSPROC-DEFINITION *
          PRIORITY      OF ZMSPROC-DEFINITION
          ON SIZE ERROR
          MOVE MAX-VALUE-19 TO W21 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3315-50-RELEASE-Y could also apply
** to the equivalent procedure 3315-50-RELEASE. Please check.
 3315-50-RELEASE-Y.
     MOVE TITLE-NAME (TITLE-INDEX) TO SORT-WKLD-NAME.
     MOVE SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) TO SORT-SYSTEM-NAME.
     MOVE PROGRAM-FILE-NAME OF ZMSPROC-DEFINITION
         TO SORT-PROGRAM-FILE-NAME.
     MOVE PROCESS-NAME OF ZMSPROC-DEFINITION
         TO SORT-PROCESS-NAME.
     MOVE PROCESS-CPU-NUM (PROCESS-INDEX) TO SORT-CPU-NUM.
*    PROCESS-PIN is an unsigned integer, so the NATIVE-2 value can
*    be negative
     IF PROCESS-PIN (PROCESS-INDEX) NEGATIVE
         ADD PROCESS-PIN (PROCESS-INDEX), 65536 GIVING SORT-PIN
     ELSE
         MOVE PROCESS-PIN (PROCESS-INDEX) TO SORT-PIN
     END-IF.
     IF CONVERTTO-PRESENT
         COMPUTE SORT-CPU-BUSY-TIME               =
             CPU-BUSY-TIME OF ZMSPROC-DEFINITION  *
             (CPU-POWER (CPU-INDEX)                /
             CPU-POWER-VALUE)                     *
             (CONVERTTO-IPU-VALUE                  /
             CPU-IPUCOUNT (CPU-INDEX))
         END-COMPUTE
     ELSE
         MOVE CPU-BUSY-TIME OF ZMSPROC-DEFINITION TO
             SORT-CPU-BUSY-TIME
     END-IF.
     MOVE DELTA-TIME OF ZMSPROC-DEFINITION TO
         SORT-DELTA-TIME.
     RELEASE SORT-FILE-RECORD.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 3340-MATCH-WKLD.
* Match a process to a workload
     IF
*          Compare system numbers
         ((WKLD-SYSTEM (WKLD-INDEX) = WC-ASTERISK-NUM       OR
           WKLD-SYSTEM (WKLD-INDEX) = SYSTEM-INDEX                  )  AND
*          Compare CPU numbers
          (WKLD-CPU    (WKLD-INDEX) = WC-ASTERISK-NUM       OR
           WKLD-CPU    (WKLD-INDEX) = PROCESS-CPU-NUM (PROCESS-INDEX)) AND
*          Compare PIN numbers
          (WKLD-PIN    (WKLD-INDEX) = WC-ASTERISK-NUM       OR
           WKLD-PIN    (WKLD-INDEX) = PROCESS-PIN     (PROCESS-INDEX)) AND
*          Compare userid
          (WKLD-USERID-FLAG (WKLD-INDEX)  = WC-ASTERISK-ALFA OR
           (WKLD-USERID-FLAG (WKLD-INDEX) = USER-DEFINED  AND
            WKLD-USER        (WKLD-INDEX) = S-USER        )  OR
           (WKLD-USERID-FLAG (WKLD-INDEX) = GROUP-DEFINED AND
            WKLD-GROUP       (WKLD-INDEX) = S-GROUP       )  OR
           (WKLD-USERID-FLAG (WKLD-INDEX) = SPACE         AND
            WKLD-GROUP       (WKLD-INDEX) = S-GROUP       AND
            WKLD-USER        (WKLD-INDEX) = S-USER        )))
*          Match !
         PERFORM 3342-MATCH-WILD
     END-IF.
*----------------------------------------------------------------------------
 3342-MATCH-WILD.
* Generic rules for wildcard matching
* -----------------------------------
* The presence of a question mark (?) in any part (of the 3 parts) of a
* file name means that any character can occupy that position.
*
* For example, the pattern
*     "$ABC    FIL?REC DATA    "
* matches with the file names
*     "$ABC    FIL1REC DATA    "
*     "$ABC    FILKREC DATA    "
*
* Also, the pattern
*     "$ABC    FILE    DATA?   "
* matches with
*     "$ABC    FILE    DATA1   "
*     "$ABC    FILE    DATA    "
* but not with
*     "$ABC    FILE    DATA33  "
*
* The presence of an asterisk (*) in a any part (of the 3 parts) of a file
* name means that any character can occupy that position or any of the
* remaining positions in that part.
*
* For example, the pattern
*     "$ABC*   FILE    DATA    "
* matches with the file names
*     "$ABCD   FILE    DATA    "
*     "$ABC12  FILE    DATA    "
*     "$ABC    FILE    DATA    "
*
* Any characters that follow the asterisk wildcard up to the next part of the
* file name will be ignored.
*
* For example, the pattern "$ABC    FIL*REC DATA    " is identical to
* "$ABC    FIL*    DATA    ".
* Compare process name character by character
     PERFORM
         VARYING ORDINAL FROM 1 BY 1
         UNTIL ORDINAL > 8
         IF WKLD-PROCESS-NAME (WKLD-INDEX) (ORDINAL:1) = WC-ASTERISK-ALFA
             MOVE 8 TO ORDINAL
         ELSE
             IF WKLD-PROCESS-NAME (WKLD-INDEX) (ORDINAL:1) = WC-QUESTION
                 CONTINUE
             ELSE
                 IF WKLD-PROCESS-NAME (WKLD-INDEX) (ORDINAL:1) NOT =
                     S-PROCESS-NAME (ORDINAL:1)
* No match !
                     MOVE 999 TO ORDINAL
                 END-IF
             END-IF
         END-IF
     END-PERFORM.
     IF ORDINAL NOT > 999
*       Compare program file name, character by character
         PERFORM 3360-MATCH-PART
             VARYING OFFSET FROM ZERO BY 8
             UNTIL OFFSET > 16
         IF ORDINAL NOT > 999
*            All tests completed succesfully so a match is found
             SET MATCH-FOUND TO TRUE
         END-IF
     END-IF.
*----------------------------------------------------------------------------
 3360-MATCH-PART.
* Compare part of program file name
     PERFORM
         VARYING ORDINAL FROM 1 BY 1
         UNTIL ORDINAL > 8
         IF WKLD-PROGRAM-FILENAME (WKLD-INDEX) ((OFFSET + ORDINAL):1) =
             WC-ASTERISK-ALFA
             MOVE 8 TO ORDINAL
         ELSE
             IF WKLD-PROGRAM-FILENAME (WKLD-INDEX) ((OFFSET + ORDINAL):1) =
                 WC-QUESTION
                 CONTINUE
             ELSE
                 IF WKLD-PROGRAM-FILENAME (WKLD-INDEX) ((OFFSET + ORDINAL):1)
                     NOT = S-PROGRAM-FILE-NAME ((OFFSET + ORDINAL):1)
* No match !
                     MOVE 999 TO ORDINAL, OFFSET
                 END-IF
             END-IF
         END-IF
     END-PERFORM.
*----------------------------------------------------------------------------
 3370-PROCESS-TABLE-SORT.
* Sort PROCESS-TABLE in ascending order according to PROCESS-SORT-KEY
* using the Heapsort algorithm
     COPY HEAPSORT REPLACING
         I       BY HEAP-I
         IR      BY HEAP-IR
         J       BY HEAP-J
         L       BY HEAP-L
         N       BY PROCESS-MAX
         INDEX-1 BY PROCESS-INDEX
         INDEX-2 BY PROCESS-INDEX-2
         TABLE   BY PROCESS-TABLE
         TEMP    BY PROCESS-TEMP
         KEY     BY PROCESS-SORT-KEY.
*----------------------------------------------------------------------------
 3380-INSERT-PROCESS-UNIQUE.
* Insert a value into PROCESS-UNIQUE To make every
* (PROCESS-CPU-NUM,PROCESS-PIN) occurence in PROCESS-TABLE unique.
* This allows us to use SEARCH ALL in linking discopens to processes.
     MOVE HIGH-VALUES TO PID-SAVE.
     PERFORM
         VARYING PROCESS-INDEX FROM 1 BY 1
         UNTIL PROCESS-INDEX > PROCESS-MAX
         IF PROCESS-PID (PROCESS-INDEX) = PID-SAVE
*            Since PROCESS-UNIQUE is a NATIVE-2 field, it can only go
*            up to 32767 ...
             IF UNIQUE-COUNTER >= 32767
                  STRING COMPLETION-56       DELIMITED SIZE
                         " (PROCESS-UNIQUE)" DELIMITED SIZE
                         INTO COMPLETION-MESSAGE
                  MOVE 1 TO ABEND-REQUIRED-FLAG
                  PERFORM 9010-SPCOMPLETION
             END-IF
             ADD 1 TO UNIQUE-COUNTER
             MOVE UNIQUE-COUNTER TO PROCESS-UNIQUE (PROCESS-INDEX)
         ELSE
             MOVE ZERO TO UNIQUE-COUNTER
             MOVE UNIQUE-COUNTER TO PROCESS-UNIQUE (PROCESS-INDEX)
             MOVE PROCESS-PID (PROCESS-INDEX) TO PID-SAVE
         END-IF
     END-PERFORM.
*----------------------------------------------------------------------------
 3400-READ-DISCOPEN-INFO.
* Get discopen information
* Check if file is usable.
      IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
         PERFORM 3405-READ-USABLE-FILE
      END-IF.
*----------------------------------------------------------------------------
 3405-READ-USABLE-FILE.
     MOVE ZERO TO FIRSTCALL.
     SET SYSTEM-INDEX-2 TO MEASURE-SYSTEM-NUMBER (MEASURE-INDEX).
* Obtain VERSION-INDEX for current system
     SET VERSION-INDEX TO 1.
     SEARCH VERSION-TABLE
         END
*            This should never occur !
             PERFORM
                 STRING COMPLETION-56     DELIMITED SIZE
                        " (version link)" DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 MOVE 1 TO ABEND-REQUIRED-FLAG
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN VERSION-VALUE (VERSION-INDEX) = SYSTEM-VERSION (SYSTEM-INDEX-2)
             NEXT SENTENCE
     END-SEARCH.
* Read discopen counter record blocks until FIRSTCALL is ZERO.
     PERFORM TEST AFTER UNTIL FIRSTCALL ZERO
*------------MeasTCM Yosemite Change----Start-----------
         IF YOSEMITE-DATAFILE = "Y"
           ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-DISCOPENS,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION
               (SYSTEM-INDEX-2),
               OMITTED,
               ZERO,
               OMITTED,
               OMITTED,
               OMITTED,
               OMITTED,
               ZMSDOPEN-TEMPLATE-VERSION
            GIVING RESULT
         ELSE
*------------MeasTCM Yosemite Change-----End------------
           ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-DISCOPENS,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION
               (SYSTEM-INDEX-2),
               OMITTED,
               ZERO
            GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
         END-IF
*------------MeasTCM Yosemite Change-----End------------
         IF RESULT NOT ZERO
             MOVE RESULT TO NUMBER-DISPLAY
             STRING COMPLETION-52  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
             PERFORM 9010-SPCOMPLETION
         END-IF
         IF BYTESRET NOT ZERO
             PERFORM 3410-TREAT-DISCOPEN-INFO
         END-IF
     END-PERFORM.
*----------------------------------------------------------------------------
 3410-TREAT-DISCOPEN-INFO.
* Treat discopen information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
    IF YOSEMITE-DATAFILE = "Y"
* We use FUNCTION LENGTH() to calculate the length of ZMSDOPEN-DEFINITION as
* MEASGETVERSION() returns legacy style Entity lengths.
        DIVIDE FUNCTION LENGTH(ZMSDOPEN-DEFINITION) INTO BYTESRET
        MOVE ZERO TO ZMSDOPEN-CNTR-START
        SET ZMSDOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
        PERFORM 3415-TREAT-DISCOPEN-ENTITY-Y
        VARYING ENTITY-COUNTER FROM 1 BY 1
        UNTIL   ENTITY-COUNTER > BYTESRET
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        DIVIDE DISCOPEN-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX)
        INTO BYTESRET
        MOVE ZERO TO DISCOPEN-CNTR-START
        MOVE DISCOPEN-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX) TO DISCOPEN-CNTR-END
        SET DISCOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
        PERFORM 3415-TREAT-DISCOPEN-ENTITY
        VARYING ENTITY-COUNTER FROM 1 BY 1
        UNTIL   ENTITY-COUNTER > BYTESRET
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
** Any logical change in procedure 3415-TREAT-DISCOPEN-ENTITY could also apply
** to the equivalent procedure 3415-TREAT-DISCOPEN-ENTITY-Y. Please check.
 3415-TREAT-DISCOPEN-ENTITY.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF DISCOPEN-DEFINITION TO DISCOPEN-PNTR.
     MOVE MEASREAD-BUFFER( DISCOPEN-CNTR-START + 1  : FUNCTION LENGTH(DISCOPEN-DEFINITION) )   TO DISCOPEN-DEFINITION
     ADD DISCOPEN-CNTR-END      TO  DISCOPEN-CNTR-START
*     SET DISCOPEN-PNTR UP BY FUNCTION LENGTH(DISCOPEN-DEFINITION).
* Check for measure allocation error
* Below line commented for Soln 10-000925-0463.
*    IF ENTITY-ERROR OF DISCOPEN-DEFINITION NOT ZERO
* 2 lines inserted for Soln 10-000925-0463. To prevent VOLUME-LINK error due
* to blank index in the VOLUME-TABLE, the IF condition has been modified, to
* also check for a blank Volume-name in FILE-NAME of DISCOPEN-DEFINITION.
     IF (ENTITY-ERROR OF DISCOPEN-DEFINITION NOT ZERO   OR
             VOLUME OF FILE-NAME OF DISCOPEN-DEFINITION = SPACES)
        ADD 1  TO DISCOPEN-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
*         MOVE ENTITY-ERROR OF DISCOPEN-DEFINITION TO NUMBER-DISPLAY
*         STRING COMPLETION-63  DELIMITED SIZE
*                SPACE          DELIMITED SIZE
*                NUMBER-DISPLAY DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
     ELSE
*      GAG.  IPM AAI.  Check if DISCOPEN record is valid.
       IF (FROM-TIMESTAMP OF DISCOPEN-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF DISCOPEN-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3415-00-CONT-DISCOPEN-INFO
       END-IF
     END-IF.
*----------------------------------------------------------------------------
** Any logical change in procedure 3415-00-CONT-DISCOPEN-INFO could also apply
** to the equivalent procedure 3415-00-CONT-DISCOPEN-INFO-Y. Please check.
 3415-00-CONT-DISCOPEN-INFO.
* If the opener process belongs to current system, link using CPU number
* and PIN
     IF (OPENER-SYSTEM-NAME OF DISCOPEN-DEFINITION =
            SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX)) OR
*           In some cases the system name is left blank if the opener was
*           from the local system (TPR S900503 0932 3404). This was
*           solved in T9086C20, 30SEP90
            (OPENER-SYSTEM-NAME OF DISCOPEN-DEFINITION = SPACES
                AND SYSTEM-INDEX = SYSTEM-INDEX-2)
         PERFORM 3415-10-SEARCH-ALL-PROCESS
         PERFORM 3415-50-TREAT-CONTINUED
     ELSE
*        In this case the opener process does not belong to the current
*        system.
         IF SYSTEM-INDEX-2 = SYSTEM-INDEX
             PERFORM 3415-30-SEARCH-SYSTEM
             IF NOT SYSTEM-FOUND
                 PERFORM 3415-50-TREAT-CONTINUED
             END-IF
         END-IF
*            If the current measurement data file has not been produced on
*            the current system, the discopen will be treated later
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-10-SEARCH-ALL-PROCESS could also apply
** to the equivalent procedure 3415-10-SEARCH-ALL-PROCESS-Y. Please check.
 3415-10-SEARCH-ALL-PROCESS.
     SEARCH ALL PROCESS-TABLE
         END
*        When no link is found, we set PROCESS-INDEX to zero
             SET PROCESS-INDEX TO ZERO
         WHEN PROCESS-CPU-NUM (PROCESS-INDEX) =
                  OPENER-CPU OF DISCOPEN-DEFINITION AND
                  PROCESS-PIN     (PROCESS-INDEX) =
                  OPENER-PIN OF DISCOPEN-DEFINITION AND
                  PROCESS-UNIQUE  (PROCESS-INDEX) = ZERO
              PERFORM 3415-20-SEARCH-PROCESS-TABLE
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-20-SEARCH-PROCESS-TABLE could also apply
** to the equivalent procedure 3415-20-SEARCH-PROCESS-TABLE-Y. Please check.
 3415-20-SEARCH-PROCESS-TABLE.
*    Continue searching serially to match the time window
     SEARCH PROCESS-TABLE
         END
*            When no link is found, we set PROCESS-INDEX
*            to zero
             SET PROCESS-INDEX TO ZERO
         WHEN PROCESS-CPU-NUM (PROCESS-INDEX) NOT =
                  OPENER-CPU OF DISCOPEN-DEFINITION
              OR  PROCESS-PIN (PROCESS-INDEX) NOT =
                  OPENER-PIN OF DISCOPEN-DEFINITION
*            When no link is found, we set PROCESS-INDEX
*            to zero
             SET PROCESS-INDEX TO ZERO
         WHEN
*            Process to discopen linking is done
*            according to the algorithm intoduced in the
*            MEASFH AAK IPM (MATCHEM_SUBPROC) First case:
*            process started first
         (     PROCESS-FROM (PROCESS-INDEX) <=
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION
         AND
         (     PROCESS-TO (PROCESS-INDEX) >=
               TO-TIMESTAMP OF DISCOPEN-DEFINITION
         OR
         (     PROCESS-TO (PROCESS-INDEX) >
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION
         AND
         (     (PROCESS-TO (PROCESS-INDEX) - PROCESS-FROM (PROCESS-INDEX))
               >=
               (TO-TIMESTAMP OF DISCOPEN-DEFINITION -
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION)
         OR
               (PROCESS-TO (PROCESS-INDEX) -
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION)
               > 10000000
         ))))
         OR
*              Second case: discopen started first
         (     PROCESS-FROM (PROCESS-INDEX) >
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION
         AND
               PROCESS-FROM (PROCESS-INDEX) <
               TO-TIMESTAMP OF DISCOPEN-DEFINITION
         AND
         (     (PROCESS-TO (PROCESS-INDEX) - PROCESS-FROM (PROCESS-INDEX))
               >=
               (TO-TIMESTAMP OF DISCOPEN-DEFINITION -
               FROM-TIMESTAMP OF DISCOPEN-DEFINITION)
         OR
               (TO-TIMESTAMP OF DISCOPEN-DEFINITION -
               PROCESS-FROM (PROCESS-INDEX)) > 10000000
         ))
*              Bingo !!!
         CONTINUE
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-30-SEARCH-SYSTEM could also apply
** to the equivalent procedure 3415-30-SEARCH-SYSTEM-Y. Please check.
 3415-30-SEARCH-SYSTEM.
     SET SYSTEM-INDEX TO 1.
     SEARCH SYSTEM-TABLE
         END
*            If the current measurement data file has been produced on the
*            current system and opener-process system doesn't exist, then
*            this discopen info should go to process category 99.
             SET PROCESS-INDEX TO ZERO
             SET SYSTEM-INDEX TO SYSTEM-INDEX-2
             ADD 1 TO NUMBER-UNLINKED-DISCOPENS-R
             MOVE ZERO TO SYSTEM-FOUND-FLAG
         WHEN SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) =
              OPENER-SYSTEM-NAME OF DISCOPEN-DEFINITION
             SET SYSTEM-INDEX TO SYSTEM-INDEX-2
             MOVE 1 TO SYSTEM-FOUND-FLAG
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-50-TREAT-CONTINUED could also apply
** to the equivalent procedure 3415-50-TREAT-CONTINUED-Y. Please check.
 3415-50-TREAT-CONTINUED.
* Determine the corresponding TITLE-INDEX
     IF PROCESS-INDEX = ZERO
*        This means no link was found, so discopen information should go
*        to process category 99
         SET TITLE-INDEX TO TITLE-MAX
         ADD 1 TO NUMBER-UNLINKED-DISCOPENS
     ELSE
         ADD 1 TO NUMBER-LINKED-DISCOPENS
         SEARCH ALL TITLE-TABLE
             END
*                This should never happen ...
                 STRING COMPLETION-56  DELIMITED SIZE
                        " (no title) " DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 MOVE 1 TO ABEND-REQUIRED-FLAG
                 PERFORM 9010-SPCOMPLETION
             WHEN TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX) =
                  PROCESS-WKLD-NUMBER (PROCESS-INDEX)
                 NEXT SENTENCE
         END-SEARCH
     END-IF.
* DRIVER-INPUT-CALLS, DRIVER-OUTPUT-CALLS, CACHE-HITS, CACHE-WRITE-HITS can
* be negative since original counters are unsigned
     IF DRIVER-INPUT-CALLS  OF DISCOPEN-DEFINITION NEGATIVE OR
        DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION NEGATIVE OR
        CACHE-HITS          OF DISCOPEN-DEFINITION NEGATIVE OR
        CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION NEGATIVE
         STRING COMPLETION-56                   DELIMITED SIZE
                " (DISCOPEN counters negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Add discopen counters TO CSV-W-BINARY
     ADD CACHE-HITS       OF DISCOPEN-DEFINITION
         CACHE-WRITE-HITS OF DISCOPEN-DEFINITION
         TO W06 OF CSV-W-BINARY (TITLE-INDEX)
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W06 OF CSV-W-BINARY (TITLE-INDEX).
     COMPUTE W07 OF CSV-W-BINARY (TITLE-INDEX)                    =
         W07 OF CSV-W-BINARY (TITLE-INDEX)                        +
         DRIVER-INPUT-CALLS  OF DISCOPEN-DEFINITION +
         DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
         CACHE-HITS          OF DISCOPEN-DEFINITION -
         CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W07 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
* Index the file name into VOLUME-TABLE to get the basic read and write costs
* and disc-to-discopen ratio
     SEARCH ALL VOLUME-TABLE
         END
* Soln 10-010627-1347. Added the binary SEARCH below, to accommodate virtual
* disks for SMF. The DEVICE-NAME field contains the device location of the
* physical file corresponding to the logical file name of the SMF file. It is
* used here to index into the VOLUME-TABLE, when the outer SEARCH with VOLUME
* field (which is blank for SMF files) fails to find a match. Changes begin:
         SEARCH ALL VOLUME-TABLE
            END
*              This should never occur !
               STRING COMPLETION-56    DELIMITED SIZE
                    " (VOLUME LINK)" DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
               MOVE 1 TO ABEND-REQUIRED-FLAG
               PERFORM 9010-SPCOMPLETION
          WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
               VOLUME-NAME (VOLUME-INDEX) = DEVICE-NAME OF DISCOPEN-DEFINITION
                     PERFORM 3415-60-COMPUTE-A
                IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
                    (NO-OF-FILES(VOLUME-INDEX) * 4)
*               In this case the volume is unmirrored
                    PERFORM 3415-70-COMPUTE-B
                ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
                   PERFORM 3415-80-COMPUTE-C
                END-IF
         END-SEARCH
* Soln 10-010627-1347. Changes end here.
         WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
              VOLUME-NAME (VOLUME-INDEX) =
              VOLUME OF DISCOPEN-DEFINITION
                  PERFORM 3415-60-COMPUTE-A
             IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
                 (NO-OF-FILES(VOLUME-INDEX) * 4)
*                in this case the volume is unmirrored
                    PERFORM 3415-70-COMPUTE-B
             ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
                    PERFORM 3415-80-COMPUTE-C
             END-IF
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-60-COMPUTE-A could also apply
** to the equivalent procedure 3415-60-COMPUTE-A-Y. Please check.
 3415-60-COMPUTE-A.
     COMPUTE W13 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W13 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-INPUT-CALLS OF DISCOPEN-DEFINITION  -
          CACHE-HITS         OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-READ-RATIO (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W13 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W08 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
         W08 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-INPUT-CALLS OF DISCOPEN-DEFINITION  -
          CACHE-HITS         OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-READ-RATIO (VOLUME-INDEX)                    *
         DISC-READ-COST (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W08 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-70-COMPUTE-B could also apply
** to the equivalent procedure 3415-70-COMPUTE-B-Y. Please check.
 3415-70-COMPUTE-B.
     COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W14 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W14 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
         W09 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         DISC-WRITE-COST   (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W09 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-80-COMPUTE-C could also apply
** to the equivalent procedure 3415-80-COMPUTE-C-Y. Please check.
 3415-80-COMPUTE-C.
     COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W14 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         2
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W14 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
          W09 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF DISCOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         DISC-WRITE-COST   (VOLUME-INDEX)                          *
         2
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W09 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*------------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3415-TREAT-DISCOPEN-ENTITY-Y could also apply
** to the equivalent procedure 3415-TREAT-DISCOPEN-ENTITY. Please check.
 3415-TREAT-DISCOPEN-ENTITY-Y.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF ZMSDOPEN-DEFINITION TO ZMSDOPEN-PNTR.
     MOVE MEASREAD-BUFFER( ZMSDOPEN-CNTR-START + 1  : FUNCTION LENGTH(ZMSDOPEN-DEFINITION) )   TO ZMSDOPEN-DEFINITION
     ADD FUNCTION LENGTH(ZMSDOPEN-DEFINITION)      TO  ZMSDOPEN-CNTR-START
*     SET ZMSDOPEN-PNTR UP BY FUNCTION LENGTH(ZMSDOPEN-DEFINITION).
* Check for measure allocation error
* 2 lines inserted for Soln 10-000925-0463. To prevent VOLUME-LINK error due
* to blank index in the VOLUME-TABLE, the IF condition has been modified, to
* also check for a blank Volume-name in FILE-NAME of ZMSDOPEN-DEFINITION.
     IF (ENTITY-ERROR OF ZMSDOPEN-DEFINITION NOT ZERO   OR
             VOLUME OF FILE-NAME OF ZMSDOPEN-DEFINITION = SPACES)
        ADD 1  TO DISCOPEN-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
     ELSE
*      GAG.  IPM AAI.  Check if DISCOPEN record is valid.
       IF (FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF ZMSDOPEN-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3415-00-CONT-DISCOPEN-INFO-Y
       END-IF
     END-IF.
*----------------------------------------------------------------------------
** Any logical change in procedure 3415-00-CONT-DISCOPEN-INFO-Y could also apply
** to the equivalent procedure 3415-00-CONT-DISCOPEN-INFO. Please check.
 3415-00-CONT-DISCOPEN-INFO-Y.
* If the opener process belongs to current system, link using CPU number
* and PIN
     IF (OPENER-SYSTEM-NAME OF ZMSDOPEN-DEFINITION =
            SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX)) OR
*           In some cases the system name is left blank if the opener was
*           from the local system (TPR S900503 0932 3404). This was
*           solved in T9086C20, 30SEP90
            (OPENER-SYSTEM-NAME OF ZMSDOPEN-DEFINITION = SPACES
                AND SYSTEM-INDEX = SYSTEM-INDEX-2)
         PERFORM 3415-10-SEARCH-ALL-PROCESS-Y
         PERFORM 3415-50-TREAT-CONTINUED-Y
     ELSE
*        In this case the opener process does not belong to the current
*        system.
         IF SYSTEM-INDEX-2 = SYSTEM-INDEX
             PERFORM 3415-30-SEARCH-SYSTEM-Y
             IF NOT SYSTEM-FOUND
                 PERFORM 3415-50-TREAT-CONTINUED-Y
             END-IF
         END-IF
*            If the current measurement data file has not been produced on
*            the current system, the discopen will be treated later
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-10-SEARCH-ALL-PROCESS-Y could also apply
** to the equivalent procedure 3415-10-SEARCH-ALL-PROCESS. Please check.
 3415-10-SEARCH-ALL-PROCESS-Y.
     SEARCH ALL PROCESS-TABLE
         END
*        When no link is found, we set PROCESS-INDEX to zero
             SET PROCESS-INDEX TO ZERO
         WHEN PROCESS-CPU-NUM (PROCESS-INDEX) =
                  OPENER-CPU OF ZMSDOPEN-DEFINITION AND
                  PROCESS-PIN     (PROCESS-INDEX) =
                  OPENER-PIN OF ZMSDOPEN-DEFINITION AND
                  PROCESS-UNIQUE  (PROCESS-INDEX) = ZERO
              PERFORM 3415-20-SEARCH-PROCESS-TABLE-Y
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-20-SEARCH-PROCESS-TABLE-Y could also apply
** to the equivalent procedure 3415-20-SEARCH-PROCESS-TABLE. Please check.
 3415-20-SEARCH-PROCESS-TABLE-Y.
*    Continue searching serially to match the time window
     SEARCH PROCESS-TABLE
         END
*            When no link is found, we set PROCESS-INDEX
*            to zero
             SET PROCESS-INDEX TO ZERO
         WHEN PROCESS-CPU-NUM (PROCESS-INDEX) NOT =
                  OPENER-CPU OF ZMSDOPEN-DEFINITION
              OR  PROCESS-PIN (PROCESS-INDEX) NOT =
                  OPENER-PIN OF ZMSDOPEN-DEFINITION
*            When no link is found, we set PROCESS-INDEX
*            to zero
             SET PROCESS-INDEX TO ZERO
         WHEN
*            Process to discopen linking is done
*            according to the algorithm intoduced in the
*            MEASFH AAK IPM (MATCHEM_SUBPROC) First case:
*            process started first
         (     PROCESS-FROM (PROCESS-INDEX) <=
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION
         AND
         (     PROCESS-TO (PROCESS-INDEX) >=
               TO-TIMESTAMP OF ZMSDOPEN-DEFINITION
         OR
         (     PROCESS-TO (PROCESS-INDEX) >
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION
         AND
         (     (PROCESS-TO (PROCESS-INDEX) - PROCESS-FROM (PROCESS-INDEX))
               >=
               (TO-TIMESTAMP OF ZMSDOPEN-DEFINITION -
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION)
         OR
               (PROCESS-TO (PROCESS-INDEX) -
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION)
               > 10000000
         ))))
         OR
*              Second case: discopen started first
         (     PROCESS-FROM (PROCESS-INDEX) >
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION
         AND
               PROCESS-FROM (PROCESS-INDEX) <
               TO-TIMESTAMP OF ZMSDOPEN-DEFINITION
         AND
         (     (PROCESS-TO (PROCESS-INDEX) - PROCESS-FROM (PROCESS-INDEX))
               >=
               (TO-TIMESTAMP OF ZMSDOPEN-DEFINITION -
               FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION)
         OR
               (TO-TIMESTAMP OF ZMSDOPEN-DEFINITION -
               PROCESS-FROM (PROCESS-INDEX)) > 10000000
         ))
*              Bingo !!!
         CONTINUE
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-30-SEARCH-SYSTEM-Y could also apply
** to the equivalent procedure 3415-30-SEARCH-SYSTEM. Please check.
 3415-30-SEARCH-SYSTEM-Y.
     SET SYSTEM-INDEX TO 1.
     SEARCH SYSTEM-TABLE
         END
*            If the current measurement data file has been produced on the
*            current system and opener-process system doesn't exist, then
*            this discopen info should go to process category 99.
             SET PROCESS-INDEX TO ZERO
             SET SYSTEM-INDEX TO SYSTEM-INDEX-2
             ADD 1 TO NUMBER-UNLINKED-DISCOPENS-R
             MOVE ZERO TO SYSTEM-FOUND-FLAG
         WHEN SYSTEM-NAME OF SYSTEM-TABLE (SYSTEM-INDEX) =
              OPENER-SYSTEM-NAME OF ZMSDOPEN-DEFINITION
             SET SYSTEM-INDEX TO SYSTEM-INDEX-2
             MOVE 1 TO SYSTEM-FOUND-FLAG
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-50-TREAT-CONTINUED-Y could also apply
** to the equivalent procedure 3415-50-TREAT-CONTINUED. Please check.
 3415-50-TREAT-CONTINUED-Y.
* Determine the corresponding TITLE-INDEX
     IF PROCESS-INDEX = ZERO
*        This means no link was found, so discopen information should go
*        to process category 99
         SET TITLE-INDEX TO TITLE-MAX
         ADD 1 TO NUMBER-UNLINKED-DISCOPENS
     ELSE
         ADD 1 TO NUMBER-LINKED-DISCOPENS
         SEARCH ALL TITLE-TABLE
             END
*                This should never happen ...
                 STRING COMPLETION-56  DELIMITED SIZE
                        " (no title) " DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 MOVE 1 TO ABEND-REQUIRED-FLAG
                 PERFORM 9010-SPCOMPLETION
             WHEN TITLE-NUMBER OF TITLE-TABLE (TITLE-INDEX) =
                  PROCESS-WKLD-NUMBER (PROCESS-INDEX)
                 NEXT SENTENCE
         END-SEARCH
     END-IF.
* DRIVER-INPUT-CALLS, DRIVER-OUTPUT-CALLS, CACHE-HITS, CACHE-WRITE-HITS can
* be negative since original counters are unsigned
     IF DRIVER-INPUT-CALLS  OF ZMSDOPEN-DEFINITION NEGATIVE OR
        DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION NEGATIVE OR
        CACHE-HITS          OF ZMSDOPEN-DEFINITION NEGATIVE OR
        CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION NEGATIVE
         STRING COMPLETION-56                   DELIMITED SIZE
                " (DISCOPEN counters negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Add discopen counters TO CSV-W-BINARY
     ADD CACHE-HITS       OF ZMSDOPEN-DEFINITION
         CACHE-WRITE-HITS OF ZMSDOPEN-DEFINITION
         TO W06 OF CSV-W-BINARY (TITLE-INDEX)
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W06 OF CSV-W-BINARY (TITLE-INDEX).
     COMPUTE W07 OF CSV-W-BINARY (TITLE-INDEX)                    =
         W07 OF CSV-W-BINARY (TITLE-INDEX)                        +
         DRIVER-INPUT-CALLS  OF ZMSDOPEN-DEFINITION +
         DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
         CACHE-HITS          OF ZMSDOPEN-DEFINITION -
         CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W07 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
* Index the file name into VOLUME-TABLE to get the basic read and write costs
* and disc-to-discopen ratio
     SEARCH ALL VOLUME-TABLE
         END
* Soln 10-010627-1347. Added the binary SEARCH below, to accomodate virtual
* disks for SMF. The DEVICE-NAME field contains the device location of the
* physical file corresponding to the logical file name of the SMF file. It is
* used here to index into the VOLUME-TABLE, when the outer SEARCH with VOLUME
* field (which is blank for SMF files) fails to find a match. Changes begin:
         SEARCH ALL VOLUME-TABLE
            END
*              This should never occur !
               STRING COMPLETION-56    DELIMITED SIZE
                    " (VOLUME LINK)" DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
               MOVE 1 TO ABEND-REQUIRED-FLAG
               PERFORM 9010-SPCOMPLETION
          WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
               VOLUME-NAME (VOLUME-INDEX) = DEVICE-NAME OF ZMSDOPEN-DEFINITION
                     PERFORM 3415-60-COMPUTE-A-Y
                IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
                    (NO-OF-FILES(VOLUME-INDEX) * 4)
*               In this case the volume is unmirrored
                    PERFORM 3415-70-COMPUTE-B-Y
                ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
                   PERFORM 3415-80-COMPUTE-C-Y
                END-IF
         END-SEARCH
* Soln 10-010627-1347. Changes end here.
         WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
              VOLUME-NAME (VOLUME-INDEX) =
              VOLUME OF ZMSDOPEN-DEFINITION
                  PERFORM 3415-60-COMPUTE-A-Y
             IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
                 (NO-OF-FILES(VOLUME-INDEX) * 4)
*                in this case the volume is unmirrored
                    PERFORM 3415-70-COMPUTE-B-Y
             ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
                    PERFORM 3415-80-COMPUTE-C-Y
             END-IF
     END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-60-COMPUTE-A-Y could also apply
** to the equivalent procedure 3415-60-COMPUTE-A. Please check.
 3415-60-COMPUTE-A-Y.
     COMPUTE W13 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W13 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-INPUT-CALLS OF ZMSDOPEN-DEFINITION  -
          CACHE-HITS         OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-READ-RATIO (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W13 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W08 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
         W08 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-INPUT-CALLS OF ZMSDOPEN-DEFINITION  -
          CACHE-HITS         OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-READ-RATIO (VOLUME-INDEX)                    *
         DISC-READ-COST (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W08 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-70-COMPUTE-B-Y could also apply
** to the equivalent procedure 3415-70-COMPUTE-B. Please check.
 3415-70-COMPUTE-B-Y.
     COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W14 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W14 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
         W09 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         DISC-WRITE-COST   (VOLUME-INDEX)
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W09 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*---------------------------------------------------------------------------
** Any logical change in procedure 3415-80-COMPUTE-C-Y could also apply
** to the equivalent procedure 3415-80-COMPUTE-C. Please check.
 3415-80-COMPUTE-C-Y.
     COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)                     =
         W14 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         2
         ON SIZE ERROR
           MOVE MAX-VALUE-13 TO W14 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
     COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX) ROUNDED             =
          W09 OF CSV-W-BINARY (TITLE-INDEX)                         +
         (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
          CACHE-WRITE-HITS   OF ZMSDOPEN-DEFINITION) *
         DISC-TO-DOPN-WRITE-RATIO (VOLUME-INDEX)                   *
         DISC-WRITE-COST   (VOLUME-INDEX)                          *
         2
         ON SIZE ERROR
           MOVE MAX-VALUE-19 TO W09 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 3500-READ-DISCOPEN-TOTALS.
* Check if file is usable.
      IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
         PERFORM 3505-READ-USABLE-FILE
      END-IF.
*----------------------------------------------------------------------------
 3505-READ-USABLE-FILE.
* Check the current measurement data file for discopen information for all
* volumes belonging to the system on which this measurement was taken.
     SET SYSTEM-INDEX-2 TO MEASURE-SYSTEM-NUMBER (MEASURE-INDEX).
* Start of commenting for solution:10-080623-4041
*    PERFORM VARYING VOLUME-INDEX FROM 1 BY 1
*            UNTIL VOLUME-INDEX > VOLUME-MAX
*         IF VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) =
*                 MEASURE-SYSTEM-NUMBER (MEASURE-INDEX)
*             PERFORM 3510-READ-DISCOPEN-TOTALS-CONT
*         END-IF
*    END-PERFORM.
* End of commenting for Solution:10-080623-4041
* Start of code change for Solution:10-080623-4041
* Obtain VERSION-INDEX for current system
     SET VERSION-INDEX TO 1.
     SEARCH VERSION-TABLE
         END
*            This should never occur !
             PERFORM
                 STRING COMPLETION-56     DELIMITED SIZE
                        " (version link)" DELIMITED SIZE
                        INTO COMPLETION-MESSAGE
                 MOVE 1 TO ABEND-REQUIRED-FLAG
                 PERFORM 9010-SPCOMPLETION
             END-PERFORM
         WHEN VERSION-VALUE (VERSION-INDEX) = SYSTEM-VERSION(SYSTEM-INDEX-2)
             NEXT SENTENCE
         END-SEARCH.
         PERFORM 3510-READ-DISCOPEN-TOTALS-CONT.
* End of code change for solution:10-080623-4041
*----------------------------------------------------------------------------
 3510-READ-DISCOPEN-TOTALS-CONT.
* Get total discopen information for a particular volume
* Read discopen counter record
* Modified MEASREAD_DIFF_ API call to get individual discopen information to accomodate virtual disk
* read/write busy time
* Start of code change for Solution:10-080623-4041
* Below lines of code commented for Solution:10-080623-4041
*     MOVE VOLUME-NAME (VOLUME-INDEX) TO FILE-NAME OF ALL-DISCOPENS (1:8).
*------------MeasTCM Yosemite Change----Start-----------
*     IF YOSEMITE-DATAFILE = "Y"
*        ENTER TAL "MEASREAD_DIFF_"
*        USING
*           MEASURE-DFNUM (MEASURE-INDEX),
*           ALL-DISCOPENS,
*           MEASREAD-BUFFER,
*           MEASREAD-BUFFER-LENGTH,
*           BYTESRET,
*           FIRSTCALL,
*           MEAS-START,
*           MEAS-STOP,
*           OMITTED,
*           SYSTEM-VERSION
*           (SYSTEM-INDEX-2),
*           OMITTED,
*           ZERO,
*           2,
*           OMITTED,
*           OMITTED,
*           OMITTED,
*           ZMSDOPEN-TEMPLATE-VERSION
*        GIVING RESULT
*     ELSE
*------------MeasTCM Yosemite Change-----End------------
*        ENTER TAL "MEASREAD_DIFF_"
*        USING
*           MEASURE-DFNUM (MEASURE-INDEX),
*           ALL-DISCOPENS,
*           MEASREAD-BUFFER,
*           MEASREAD-BUFFER-LENGTH,
*           BYTESRET,
*           FIRSTCALL,
*           MEAS-START,
*           MEAS-STOP,
*           OMITTED,
*           SYSTEM-VERSION
*           (SYSTEM-INDEX-2),
*           OMITTED,
*           ZERO,
*           2
*        GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
*     END-IF.
*------------MeasTCM Yosemite Change-----End------------
     PERFORM TEST AFTER UNTIL FIRSTCALL ZERO
*------------MeasTCM Yosemite Change----Start-----------
         IF YOSEMITE-DATAFILE = "Y"
           ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-DISCOPENS,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION
               (SYSTEM-INDEX-2),
               OMITTED,
               ZERO,
               OMITTED,
               OMITTED,
               OMITTED,
               OMITTED,
               ZMSDOPEN-TEMPLATE-VERSION
            GIVING RESULT
         ELSE
*------------MeasTCM Yosemite Change-----End------------
           ENTER TAL "MEASREAD_DIFF_"
            USING
               MEASURE-DFNUM (MEASURE-INDEX),
               ALL-DISCOPENS,
               MEASREAD-BUFFER,
               MEASREAD-BUFFER-LENGTH,
               BYTESRET,
               FIRSTCALL,
               MEAS-START,
               MEAS-STOP,
               OMITTED,
               SYSTEM-VERSION
               (SYSTEM-INDEX-2),
               OMITTED,
               ZERO
            GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
         END-IF
*------------MeasTCM Yosemite Change-----End------------
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-52  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF
     IF BYTESRET NOT ZERO
         PERFORM 3411-TREAT-DISCOPEN-T-ENTITY
     END-IF
   END-PERFORM.
* Below lines of code commented for Solution:10-080623-4041
*    IF FIRSTCALL NOT ZERO
*         STRING COMPLETION-56                   DELIMITED SIZE
*                " (discopen totals, firstcall)" DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
*     END-IF.
*     IF BYTESRET NOT ZERO
*        Treat discopen information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
*        IF YOSEMITE-DATAFILE = "Y"
*           SET ZMSDOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
*           PERFORM 3515-TREAT-DISCOPEN-T-INFO-Y
*        ELSE
*------------MeasTCM Yosemite Change-----End------------
*           SET DISCOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
*           PERFORM 3515-TREAT-DISCOPEN-T-INFO
*------------MeasTCM Yosemite Change----Start-----------
*        END-IF
*------------MeasTCM Yosemite Change-----End------------
*     END-IF.
* End of code change for Solution:10-080623-4041
*----------------------------------------------------------------------------
* 3411-TREAT-DISCOPEN-T-ENTITY added for Solution:10-080623-4041 to get individual discopen entity.
 3411-TREAT-DISCOPEN-T-ENTITY.
* Treat discopen information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
         IF YOSEMITE-DATAFILE = "Y"
* We use FUNCTION LENGTH() to calculate the length of ZMSDOPEN-DEFINITION      as
* MEASGETVERSION() returns legacy style Entity lengths.
             DIVIDE FUNCTION LENGTH(ZMSDOPEN-DEFINITION) INTO BYTESRET
                MOVE ZERO TO ZMSDOPEN-CNTR-START
             SET ZMSDOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3515-TREAT-DISCOPEN-T-INFO-Y
             VARYING ENTITY-COUNTER FROM 1 BY 1
             UNTIL   ENTITY-COUNTER > BYTESRET
          ELSE
*------------MeasTCM Yosemite Change-----End------------
             DIVIDE DISCOPEN-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX)
              INTO BYTESRET
             MOVE ZERO TO DISCOPEN-CNTR-START
             MOVE DISCOPEN-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX) TO DISCOPEN-CNTR-END
             SET DISCOPEN-PNTR TO ADDRESS OF MEASREAD-BUFFER
             PERFORM 3515-TREAT-DISCOPEN-T-INFO
             VARYING ENTITY-COUNTER FROM 1 BY 1
             UNTIL   ENTITY-COUNTER > BYTESRET
*------------MeasTCM Yosemite Change----Start-----------
          END-IF.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
** Any logical change in procedure 3515-TREAT-DISCOPEN-T-INFO could also apply
** to the equivalent procedure 3515-TREAT-DISCOPEN-T-INFO-Y. Please check.
 3515-TREAT-DISCOPEN-T-INFO.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF DISCOPEN-DEFINITION TO DISCOPEN-PNTR.
     MOVE MEASREAD-BUFFER( DISCOPEN-CNTR-START + 1  : FUNCTION LENGTH(DISCOPEN-DEFINITION) )   TO DISCOPEN-DEFINITION
     ADD DISCOPEN-CNTR-END      TO  DISCOPEN-CNTR-START
*     SET DISCOPEN-PNTR UP BY FUNCTION LENGTH(DISCOPEN-DEFINITION).
* Check for measure allocation error
* Start of commenting for Solution:10-080623-4041
*     IF ENTITY-ERROR OF DISCOPEN-DEFINITION NOT ZERO
*         MOVE ENTITY-ERROR OF DISCOPEN-DEFINITION TO NUMBER-DISPLAY
*         STRING COMPLETION-63  DELIMITED SIZE
*                SPACE          DELIMITED SIZE
*                NUMBER-DISPLAY DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
*     END-IF.
* End of commenting for Solution:10-080623-4041
* Below check added for Solution:10-080623-4041
* Start of code change for Solution:10-080623-4041
 IF (ENTITY-ERROR OF DISCOPEN-DEFINITION NOT ZERO   OR
             VOLUME OF FILE-NAME OF DISCOPEN-DEFINITION = SPACES)
        ADD 1  TO DISCOPEN-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
     ELSE
*      GAG.  IPM AAI.  Check if DISCOPEN record is valid.
       IF (FROM-TIMESTAMP OF DISCOPEN-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF DISCOPEN-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
        PERFORM 3520-VOLUME-DOPN-UPDAT
       END-IF
     END-IF.
* End of code change for Solution:10-080623-4041
*----------------------------------------------------------------------------
* 3520-VOLUME-DOPN-UPDAT added for Solution:10-080623-4041
* Added the binary SEARCH below, to get virtual disks read/write busy time in SMF Environment.
** Any logical change in procedure 3520-VOLUME-DOPN-UPDAT could also apply
** to the equivalent procedure 3520-VOLUME-DOPN-UPDAT-Y. Please check.
  3520-VOLUME-DOPN-UPDAT.
* DRIVER-INPUT-CALLS, DRIVER-OUTPUT-CALLS, CACHE-HITS, CACHE-WRITE-HITS can
* be negative since original counters are unsigned
     IF DRIVER-INPUT-CALLS  OF DISCOPEN-DEFINITION NEGATIVE OR
        DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION NEGATIVE OR
        CACHE-HITS          OF DISCOPEN-DEFINITION NEGATIVE OR
        CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION NEGATIVE
         STRING COMPLETION-56                   DELIMITED SIZE
                " (DISCOPEN counters negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
        SEARCH ALL VOLUME-TABLE
                 END
            SEARCH ALL VOLUME-TABLE
                    END
*              This should never occur !
                       STRING COMPLETION-56    DELIMITED SIZE
                            " (VOLUME LINK)" DELIMITED SIZE
                            INTO COMPLETION-MESSAGE
                       MOVE 1 TO ABEND-REQUIRED-FLAG
                       PERFORM 9010-SPCOMPLETION
     WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
          VOLUME-NAME (VOLUME-INDEX) = DEVICE-NAME OF DISCOPEN-DEFINITION
     COMPUTE VOLUME-DOPN-READS (VOLUME-INDEX)                      =
          VOLUME-DOPN-READS  (VOLUME-INDEX)                        +
          DRIVER-INPUT-CALLS OF DISCOPEN-DEFINITION  -
          CACHE-HITS         OF DISCOPEN-DEFINITION
     IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT > (NO-OF-FILES(VOLUME-INDEX) * 4)
         COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
              VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
              DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
              CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION
     ELSE
*        In case of a mirrored volume, VOLUME-DOPN-WRITES should be
*        multiplied by 2 to get the actual physical write count
         COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                      =
              VOLUME-DOPN-WRITES (VOLUME-INDEX)                         +
              2                                                         *
              (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
               CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION)
     END-IF
    END-SEARCH
      WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
           VOLUME-NAME (VOLUME-INDEX) =
           VOLUME OF DISCOPEN-DEFINITION
      COMPUTE VOLUME-DOPN-READS (VOLUME-INDEX)                      =
           VOLUME-DOPN-READS  (VOLUME-INDEX)                        +
           DRIVER-INPUT-CALLS OF DISCOPEN-DEFINITION  -
           CACHE-HITS         OF DISCOPEN-DEFINITION
      IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
           (NO-OF-FILES(VOLUME-INDEX) * 4)
*                in this case the volume is unmirrored
      COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
           VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
           DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
           CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION
      ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
      COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
           VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
           2                                                        *
           (DRIVER-OUTPUT-CALLS OF DISCOPEN-DEFINITION -
           CACHE-WRITE-HITS    OF DISCOPEN-DEFINITION)
      END-IF
   END-SEARCH.
*----------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3515-TREAT-DISCOPEN-T-INFO-Y could also apply
** to the equivalent procedure 3515-TREAT-DISCOPEN-T-INFO. Please check.
 3515-TREAT-DISCOPEN-T-INFO-Y.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF ZMSDOPEN-DEFINITION TO ZMSDOPEN-PNTR.
     MOVE MEASREAD-BUFFER( ZMSDOPEN-CNTR-START + 1  : FUNCTION LENGTH(ZMSDOPEN-DEFINITION) )   TO ZMSDOPEN-DEFINITION
     ADD FUNCTION LENGTH(ZMSDOPEN-DEFINITION)      TO  ZMSDOPEN-CNTR-START
*     SET ZMSDOPEN-PNTR UP BY FUNCTION LENGTH(ZMSDOPEN-DEFINITION).
* Check for measure allocation error
* Start of commenting for Solution:10-080623-4041
*     IF ENTITY-ERROR OF ZMSDOPEN-DEFINITION NOT ZERO
*         MOVE ENTITY-ERROR OF ZMSDOPEN-DEFINITION TO NUMBER-DISPLAY
*         STRING COMPLETION-63  DELIMITED SIZE
*                SPACE          DELIMITED SIZE
*                NUMBER-DISPLAY DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
*     END-IF.
* End of commenting for Solution:10-080623-4041
* Below check added for Solution:10-080623-4041
* Start of code change for Solution:10-080623-4041
 IF (ENTITY-ERROR OF ZMSDOPEN-DEFINITION NOT ZERO   OR
             VOLUME OF FILE-NAME OF ZMSDOPEN-DEFINITION = SPACES)
        ADD 1  TO DISCOPEN-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
     ELSE
*      GAG.  IPM AAI.  Check if DISCOPEN record is valid.
       IF (FROM-TIMESTAMP OF ZMSDOPEN-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE( MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF ZMSDOPEN-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
        PERFORM 3520-VOLUME-DOPN-UPDAT-Y
       END-IF
     END-IF.
* End of code change for Solution:10-080623-4041
*----------------------------------------------------------------------------
* 3520-VOLUME-DOPN-UPDAT added for Solution:10-080623-4041
* Added the binary SEARCH below, to get virtual disks read/write busy time in SMF Environment.
** Any logical change in procedure 3520-VOLUME-DOPN-UPDAT could also apply
** to the equivalent procedure 3520-VOLUME-DOPN-UPDAT-Y. Please check.
 3520-VOLUME-DOPN-UPDAT-Y.
* DRIVER-INPUT-CALLS, DRIVER-OUTPUT-CALLS, CACHE-HITS, CACHE-WRITE-HITS can
* be negative since original counters are unsigned
     IF DRIVER-INPUT-CALLS  OF ZMSDOPEN-DEFINITION NEGATIVE OR
        DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION NEGATIVE OR
        CACHE-HITS          OF ZMSDOPEN-DEFINITION NEGATIVE OR
        CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION NEGATIVE
         STRING COMPLETION-56                   DELIMITED SIZE
                " (DISCOPEN counters negative)" DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         MOVE 1 TO ABEND-REQUIRED-FLAG
         PERFORM 9010-SPCOMPLETION
     END-IF.
        SEARCH ALL VOLUME-TABLE
                 END
            SEARCH ALL VOLUME-TABLE
                    END
*              This should never occur !
                       STRING COMPLETION-56    DELIMITED SIZE
                            " (VOLUME LINK)" DELIMITED SIZE
                            INTO COMPLETION-MESSAGE
                       MOVE 1 TO ABEND-REQUIRED-FLAG
                       PERFORM 9010-SPCOMPLETION
     WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
          VOLUME-NAME (VOLUME-INDEX) = DEVICE-NAME OF ZMSDOPEN-DEFINITION
     COMPUTE VOLUME-DOPN-READS (VOLUME-INDEX)                      =
          VOLUME-DOPN-READS  (VOLUME-INDEX)                        +
          DRIVER-INPUT-CALLS OF ZMSDOPEN-DEFINITION  -
          CACHE-HITS         OF ZMSDOPEN-DEFINITION
     IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT > (NO-OF-FILES(VOLUME-INDEX) * 4)
         COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
              VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
              DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
              CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION
     ELSE
*        In case of a mirrored volume, VOLUME-DOPN-WRITES should be
*        multiplied by 2 to get the actual physical write count
         COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                      =
              VOLUME-DOPN-WRITES (VOLUME-INDEX)                         +
              2                                                         *
              (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
               CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION)
     END-IF
    END-SEARCH
      WHEN VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX-2 AND
           VOLUME-NAME (VOLUME-INDEX) =
           VOLUME OF ZMSDOPEN-DEFINITION
      COMPUTE VOLUME-DOPN-READS (VOLUME-INDEX)                      =
           VOLUME-DOPN-READS  (VOLUME-INDEX)                        +
           DRIVER-INPUT-CALLS OF ZMSDOPEN-DEFINITION  -
           CACHE-HITS         OF ZMSDOPEN-DEFINITION
      IF NO-OF-VOLUME-RECS(VOLUME-INDEX) NOT >
          (NO-OF-FILES(VOLUME-INDEX) * 4)
*                in this case the volume is unmirrored
      COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
           VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
           DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
           CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION
      ELSE
*                When the volume is mirrored, the number of writes and
*                write seconds must be doubled
      COMPUTE VOLUME-DOPN-WRITES (VOLUME-INDEX)                     =
           VOLUME-DOPN-WRITES (VOLUME-INDEX)                        +
           2                                                        *
           (DRIVER-OUTPUT-CALLS OF ZMSDOPEN-DEFINITION -
           CACHE-WRITE-HITS    OF ZMSDOPEN-DEFINITION)
      END-IF
    END-SEARCH.
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
 4000-PRINT-REPORT.
     DISPLAY INFO-12.
* Start print loop
     PERFORM 4040-PRINT-TITLES.
     PERFORM 4010-PRINT-LOOP
         UNTIL LAST-RECORD-RETURNED.
*----------------------------------------------------------------------------
 4010-PRINT-LOOP.
* Get next record from sort
     RETURN SORT-FILE
         AT END
             SET LAST-RECORD-RETURNED TO TRUE
             PERFORM 4050-PRINT-TOTAL
             PERFORM 4030-END-OF-PAGE
         NOT AT END
             PERFORM 4015-MAIN-PRINT
     END-RETURN.
*----------------------------------------------------------------------------
 4015-MAIN-PRINT.
* If new process category name detected, print totals
     IF SORT-WKLD-NAME NOT = PREVIOUS-WKLD-NAME AND
         PREVIOUS-WKLD-NAME NOT = SPACES
         PERFORM 4050-PRINT-TOTAL
     END-IF.
* Move fields to detail line
     EVALUATE TRUE
         WHEN SORT-WKLD-NAME NOT = PREVIOUS-WKLD-NAME OR FORCE-FULL-LINE
             PERFORM 4021-PRINT-A
         WHEN SORT-SYSTEM-NAME NOT = PREVIOUS-SYSTEM-NAME
             PERFORM 4022-PRINT-B
         WHEN SORT-VOLUME NOT = PREVIOUS-VOLUME
             PERFORM 4023-PRINT-C
         WHEN SORT-SUBVOLUME NOT = PREVIOUS-SUBVOLUME
             PERFORM 4024-PRINT-D
         WHEN SORT-FILE-NAME NOT = PREVIOUS-FILE-NAME
             PERFORM 4025-PRINT-E
         WHEN SORT-PROCESS-NAME NOT = PREVIOUS-PROCESS-NAME
             PERFORM 4026-PRINT-F
         WHEN SORT-CPU-NUM NOT = PREVIOUS-CPU-NUM
             PERFORM 4027-PRINT-G
         WHEN SORT-PIN NOT = PREVIOUS-PIN
             PERFORM 4028-PRINT-H
         WHEN OTHER
             PERFORM 4029-PRINT-I
     END-EVALUATE.
     DIVIDE SORT-CPU-BUSY-TIME BY 1000000 GIVING P-CPU-BUSY-TIME.
     DIVIDE SORT-DELTA-TIME    BY 1000000 GIVING P-DELTA-TIME.
     ADD  SORT-CPU-BUSY-TIME TO TOTAL-CPU-BUSY-TIME.
* Print detail line
     WRITE SPOOLER-FILE-RECORD FROM P-DETAIL AFTER ADVANCING-LINES
         EOP SET EOP-DETECTED TO TRUE.
     IF EOP-DETECTED
         PERFORM 4030-END-OF-PAGE
         PERFORM 4040-PRINT-TITLES
         SET NO-EOP-DETECTED TO TRUE
     ELSE
         MOVE 1 TO ADVANCING-LINES
     END-IF.
*----------------------------------------------------------------------------
 4021-PRINT-A.
     MOVE SORT-WKLD-NAME         TO P-WKLD-NAME
                                    PREVIOUS-WKLD-NAME.
     MOVE SORT-SYSTEM-NAME       TO P-SYSTEM-NAME
                                    PREVIOUS-SYSTEM-NAME.
     MOVE SORT-PROGRAM-FILE-NAME TO P-PROGRAM-FILE-NAME
                                    PREVIOUS-PROGRAM-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
     SET NO-FULL-LINE-REQUIRED TO TRUE.
*----------------------------------------------------------------------------
 4022-PRINT-B.
     MOVE SPACES                 TO P-WKLD-NAME.
     MOVE SORT-SYSTEM-NAME       TO P-SYSTEM-NAME
                                    PREVIOUS-SYSTEM-NAME.
     MOVE SORT-PROGRAM-FILE-NAME TO P-PROGRAM-FILE-NAME
                                    PREVIOUS-PROGRAM-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4023-PRINT-C.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME.
     MOVE SORT-PROGRAM-FILE-NAME TO P-PROGRAM-FILE-NAME
                                    PREVIOUS-PROGRAM-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4024-PRINT-D.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-VOLUME.
     MOVE SORT-SUBVOLUME         TO P-SUBVOLUME
                                    PREVIOUS-SUBVOLUME.
     MOVE SORT-FILE-NAME         TO P-FILE-NAME
                                    PREVIOUS-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4025-PRINT-E.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-VOLUME
                                    P-SUBVOLUME.
     MOVE SORT-FILE-NAME         TO P-FILE-NAME
                                    PREVIOUS-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4026-PRINT-F.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-PROGRAM-FILE-NAME.
     MOVE SORT-PROCESS-NAME      TO P-PROCESS-NAME
                                    PREVIOUS-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4027-PRINT-G.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-PROGRAM-FILE-NAME
                                    P-PROCESS-NAME.
     MOVE SORT-CPU-NUM           TO SCRATCH-Z9
                                    PREVIOUS-CPU-NUM.
     MOVE SCRATCH-Z9             TO P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4028-PRINT-H.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-PROGRAM-FILE-NAME
                                    P-PROCESS-NAME
                                    P-CPU-NUM.
     MOVE SORT-PIN               TO SCRATCH-ZZZZ9
                                    PREVIOUS-PIN.
     MOVE SCRATCH-ZZZZ9          TO P-PIN.
*----------------------------------------------------------------------------
 4029-PRINT-I.
     MOVE SPACES                 TO P-WKLD-NAME
                                    P-SYSTEM-NAME
                                    P-PROGRAM-FILE-NAME
                                    P-PROCESS-NAME
                                    P-CPU-NUM
                                    P-PIN.
*----------------------------------------------------------------------------
 4030-END-OF-PAGE.
* Action to be taken when EOP is detected during write to spooler
     ADD 1 TO PAGE-NUMBER.
     MOVE PAGE-NUMBER TO PAGE-NUMBER-Z.
     SUBTRACT LINAGE-COUNTER FROM BODY GIVING ADVANCING-LINES.
     WRITE SPOOLER-FILE-RECORD FROM P-FOOT AFTER ADVANCING-LINES.
*----------------------------------------------------------------------------
 4040-PRINT-TITLES.
* Print title information at top of new page
     IF ADVANCING-LINES ZERO
*        Skip the initial page feed
         WRITE SPOOLER-FILE-RECORD FROM P-TITLE-1
     ELSE
         WRITE SPOOLER-FILE-RECORD FROM P-TITLE-1 AFTER PAGE
     END-IF.
     WRITE SPOOLER-FILE-RECORD FROM P-TITLE-2.
     WRITE SPOOLER-FILE-RECORD FROM P-TITLE-21.
     WRITE SPOOLER-FILE-RECORD FROM P-TITLE-3 AFTER 2.
     WRITE SPOOLER-FILE-RECORD FROM P-TITLE-4 AFTER ZERO.
     MOVE 2 TO ADVANCING-LINES.
     SET FORCE-FULL-LINE TO TRUE.
*----------------------------------------------------------------------------
 4050-PRINT-TOTAL.
* Print total cpu busy time for process category
     DIVIDE TOTAL-CPU-BUSY-TIME BY 1000000 GIVING P-CPU-BUSY-TIME-TOTAL.
     WRITE SPOOLER-FILE-RECORD FROM P-TOTAL-1 AFTER ZERO.
     WRITE SPOOLER-FILE-RECORD FROM P-TOTAL-2
         EOP SET EOP-DETECTED TO TRUE.
     IF EOP-DETECTED
         IF NOT LAST-RECORD-RETURNED
             PERFORM 4030-END-OF-PAGE
             PERFORM 4040-PRINT-TITLES
         END-IF
         SET NO-EOP-DETECTED TO TRUE
     ELSE
         MOVE 2 TO ADVANCING-LINES
     END-IF.
     MOVE ZERO TO TOTAL-CPU-BUSY-TIME.
*----------------------------------------------------------------------------
 5000-CLOSE-MEASDATA.
* Close all measurement data files
     DISPLAY INFO-05.
     PERFORM
         VARYING MEASURE-INDEX FROM 1 BY 1
         UNTIL MEASURE-INDEX > MEASURE-MAX
         ENTER TAL "MEASCLOSE"
             USING MEASURE-DFNUM (MEASURE-INDEX)
             GIVING RESULT
         IF RESULT NOT ZERO
             MOVE RESULT TO NUMBER-DISPLAY
             STRING COMPLETION-50  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
             PERFORM 9010-SPCOMPLETION
         END-IF
         MOVE ZERO TO MEASURE-DFNUM (MEASURE-INDEX)
     END-PERFORM.
*----------------------------------------------------------------------------
 6000-WRITE-CSV.
     DISPLAY INFO-07, SPACE, CSVDATA.
* Purge any existing CSV file
     ENTER TAL "FNAMEEXPAND"
         USING     CSVDATA,
                   INTERNAL-FILENAME,
                   DEFAULT-NAMES
         GIVING RESULT.
     IF RESULT ZERO
         MOVE COMPLETION-70 TO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     ENTER TAL "PURGE" USING INTERNAL-FILENAME.
     ENTER TAL "FILEINFO" USING -1, RESULT.
     IF NOT (RESULT ZERO OR RESULT = 11)
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-71  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Soln 10-000602-8415. I10 now contains the base OS-version and not the version
* of Measurement data file. If I10 is not set in 3115-TREAT-CPU-ENTITY, then
* use parameter2 of CONVERTTO. Display error message if parameter2 is invalid
* for the cpu in parameter1. The cpu-type and the cpu-subtype is evaluated from
* the CPU-TYPE-POWER-TABLE using the parameter1 of CONVERTTO.
* Changes start here.
     IF CONVERTTO-PRESENT
      IF VERSION-LETTER OF I10 = SPACES OR VERSION-NUMBER OF I10 = SPACES
       IF (TEMP-OS-VERSION-LETTER = SPACES OR TEMP-OS-VERSION-NUMBER = SPACES)
             MOVE COMPLETION-89 TO COMPLETION-MESSAGE
             PERFORM 9010-SPCOMPLETION
       ELSE
* Perform the validation of I10 below only if CPUFACTOR is absent.
         IF FLAG-CPUFACTOR-NEW-CPU = 0
* Check for G-series NSK version
           IF TEMP-OS-VERSION-LETTER = "G" OR "g"
* Search the G table for CONVERTTO CPU-type
              IF TEMP-OS-VERSION-NUMBER (1:2) = "02" OR "03" OR "05"
                SET G-INDEX TO 1
                SEARCH G-CPU-TYPE-TABLE
                  AT END
                   PERFORM 8999-OS-VERSION-ERROR
                 WHEN G-CPU-TYPE (G-INDEX) = CONVERTTO-CPU-NAME
                   CONTINUE
                END-SEARCH
              ELSE
* Search the G06 table for CONVERTTO CPU-type
               IF TEMP-OS-VERSION-NUMBER (1:2) = "06"
                SET G06-INDEX TO 1
                SEARCH G06-CPU-TYPE-TABLE
                  AT END
                   PERFORM 8999-OS-VERSION-ERROR
                 WHEN G06-CPU-TYPE (G06-INDEX) = CONVERTTO-CPU-NAME
                   CONTINUE
                END-SEARCH
               ELSE
* CONVERTTO CPU-type not found in any G-series OS-table.
                  PERFORM 8999-OS-VERSION-ERROR
               END-IF
              END-IF
           END-IF
*------------MeasTCM Yosemite Change----Start-----------
* Check for H-series NSK version
           IF TEMP-OS-VERSION-LETTER = "H" OR "h"
* Search the H table for CONVERTTO CPU-type
             IF TEMP-OS-VERSION-NUMBER (1:2) = "06"
               SET H-INDEX TO 1
               SEARCH H-CPU-TYPE-TABLE
                 AT END
                  PERFORM 8999-OS-VERSION-ERROR
                WHEN H-CPU-TYPE (H-INDEX) = CONVERTTO-CPU-NAME
                  CONTINUE
               END-SEARCH
             ELSE
* CONVERTTO CPU-type not found in any H-series OS-table.
                PERFORM 8999-OS-VERSION-ERROR
             END-IF
           END-IF
*------------MeasTCM Yosemite Change----End-------------
* Start of code change for J-Series Blades
* Check for J-series NSK version
           IF TEMP-OS-VERSION-LETTER = "J" OR "j"
* Search the J table for CONVERTTO CPU-type
             IF TEMP-OS-VERSION-NUMBER (1:2) = "06"
               SET J-INDEX TO 1
               SEARCH J-CPU-TYPE-TABLE
                 AT END
                  PERFORM 8999-OS-VERSION-ERROR
                WHEN J-CPU-TYPE (J-INDEX) = CONVERTTO-CPU-NAME
                  CONTINUE
               END-SEARCH
             ELSE
* CONVERTTO CPU-type not found in any J-series OS-table.
                PERFORM 8999-OS-VERSION-ERROR
             END-IF
           END-IF
*  End of code change for J-Series Blades
         END-IF
* Valid OS. Write to I10.
         MOVE TEMP-OS-VERSION-LETTER TO VERSION-LETTER OF I10
         MOVE TEMP-OS-VERSION-NUMBER TO VERSION-NUMBER OF I10
       END-IF
      END-IF
     END-IF.
* Changes end here - Soln 10-000602-8415.
* Create CSV file
     ENTER TAL "CREATE" USING INTERNAL-FILENAME, OMITTED, 101.
     ENTER TAL "FILEINFO" USING -1, RESULT.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-72  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
* Open CSV file
     ENTER "COBOLASSIGN" OF COBOLLIB
         USING     CSV-FILE,
                   CSVDATA
         GIVING RESULT.
     IF RESULT NOT ZERO
         MOVE RESULT TO NUMBER-DISPLAY
         STRING COMPLETION-24  DELIMITED SIZE
                SPACE          DELIMITED SIZE
                NUMBER-DISPLAY DELIMITED SIZE
                INTO COMPLETION-MESSAGE
         PERFORM 9010-SPCOMPLETION
     END-IF.
     OPEN OUTPUT CSV-FILE.
* Write CSV-I-HEADER
     WRITE CSV-FILE-RECORD FROM CSV-I-HEADER.
* Complete CSV-I-DATA
* Determine I10 (the "lowest" measurement data file version)
     PERFORM
         VARYING VERSION-INDEX FROM 1 BY 1
         UNTIL VERSION-INDEX > VERSION-MAX
         IF VERSION-VALUE (VERSION-INDEX) < DFVERSION-SAVE
             MOVE VERSION-VALUE (VERSION-INDEX) TO DFVERSION-SAVE
         END-IF
     END-PERFORM.
* Below 2 lines commented for Soln 10-000602-8415.
*     MOVE VERSION-LETTER OF DFVERSION-SAVE-RED TO VERSION-LETTER OF I10.
     MOVE LOW-VALUES TO VERSION-LETTER OF DFVERSION-SAVE-RED.
*     MOVE DFVERSION-SAVE TO VERSION-NUMBER OF I10.
* If debug mode and convertto used a D option and no D data was present
* then insert D20 into the title.
* 7 lines commented for Soln 10-000602-8415.
*     IF DEBUG-MODE
*        AND CONVERTTO-PRESENT
*        AND VERSION-LETTER OF I10 = "C"
*        AND CONVERT-GUARDIAN-VERSION = "D"
*            MOVE "D" TO VERSION-LETTER OF I10
*            MOVE "20" TO VERSION-NUMBER OF I10
*     END-IF.
* Fill in I11 (MEASTCM version)
     MOVE MEASTCM-VERSION TO I11.
* Write CSV-I-DATA
     WRITE CSV-FILE-RECORD FROM CSV-I-DATA.
*    GAG IPM AAK.      Line 5 is now replaced by DEV-TYPE line.
*     WRITE CSV-FILE-RECORD FROM FOUR-SPACES.
     PERFORM VARYING TEMP-INDEX FROM 1 BY 1
             UNTIL TEMP-INDEX > NO-DEV-TYPE-ENTRIES
       MOVE SPACES TO CSV-V-TYPE-ENTRIES (TEMP-INDEX)
     END-PERFORM.
     MOVE ZERO TO TEMP-INDEX.
     SET VOLUME-INDEX TO 1.
     PERFORM TEST AFTER UNTIL TEMP-INDEX IS ZERO
       SEARCH VOLUME-TABLE VARYING VOLUME-INDEX
         END MOVE ZERO TO TEMP-INDEX
         WHEN VOLUME-DEV-TYPE (VOLUME-INDEX) > 0
           PERFORM 6005-CALC-DEVTYPE
       END-SEARCH
     END-PERFORM.
     WRITE CSV-FILE-RECORD FROM CSV-V-DATA.
* Complete CSV-F-DATA
* Fill in F01
* Added IPU count for multi-core support
* Fill in F04 with IPU count
     IF CONVERTTO-PRESENT
         MOVE CPU-TYPE-ALFA (CPU-TYPE-POWER-CONVERTTO) TO F01
         IF CONVERTTO-IPU-VALUE = 1
                MOVE "NA" TO F04
         ELSE
                STRING CONVERTTO-IPU-VALUE DELIMITED BY SPACE INTO F04
         END-IF
     ELSE
*        GAG 21AUG98  IPM AAJ.  If CONVERTTO not used, CPU-TYPE-ALPHA
*        is in CPU-TYPE-ALPHA-SAVE
         MOVE CPU-TYPE-ALPHA-SAVE TO F01
         IF CPU-IPUNUM-SAVE  = 1
                MOVE "NA" TO F04
         ELSE
                MOVE CPU-IPUNUM-SAVE TO TEMPIPU
                STRING TEMPIPU DELIMITED BY SPACE INTO F04
         END-IF
     END-IF.
* Fill in F03
     MOVE F03 OF CSV-F-COMP TO F03 OF CSV-F-DATA.
* Write CSV-F-DATA
     WRITE CSV-FILE-RECORD FROM CSV-F-DATA.
     WRITE CSV-FILE-RECORD FROM FOUR-SPACES.
* Complete CSV-C-DATA
* Calculate C02 and C03
     DIVIDE C02 OF CSV-C-BINARY BY 1000000 GIVING C02 OF CSV-C-DATA.
     DIVIDE C03 OF CSV-C-BINARY BY 1000000 GIVING C03 OF CSV-C-DATA.
* Write CSV-C-DATA
     WRITE CSV-FILE-RECORD FROM CSV-C-DATA.
     WRITE CSV-FILE-RECORD FROM FOUR-SPACES.
* Soln 10-020415-8203 : start
* Complete CSV-D-DATA
* Fill in D03
     IF DISKCONVERTTO-PRESENT
         MOVE DISKTO-DISK-MODEL-NAME TO D03
     ELSE
         MOVE ACTUAL-DISK-MODEL-NAME TO D03
     END-IF.
* Soln 10-020415-8203 : END
* Added for CEP RFE-start
* Fill in D04 with WCE status
     IF DISKCONVERTTO-PRESENT
         MOVE DISKTO-DISK-WCE TO D04
     ELSE
         MOVE ACTUAL-DISK-WCE TO D04
     END-IF.
* Fill in D05 with TMF audit trail count
    MOVE NUMTRAILS TO D05
* Added for CEP RFE-end
* Write CSV-D-DATA
     WRITE CSV-FILE-RECORD FROM CSV-D-DATA.
* Write CSV-W-HEADER
     WRITE CSV-FILE-RECORD FROM CSV-W-HEADER.
* Fill in CSV-W-DATA
*-----------Soln 10-060505-6280--start----
* The loop runs through the title table to determine if there is any category
* with the title "SYSTEM" and accordingly toggles the SYS-FLAG.
     PERFORM VARYING TITLE-INDEX FROM 1 BY 1
       UNTIL TITLE-INDEX > TITLE-MAX
       IF TITLE-NAME (TITLE-INDEX) = "SYSTEM"
       MOVE 1 TO SYS-FLAG
       END-IF
     END-PERFORM.
*-----------Soln 10-060505-6280--end----
     PERFORM 6010-TITLE
       VARYING TITLE-INDEX FROM 1 BY 1
       UNTIL TITLE-INDEX > TITLE-MAX.
* Write an empty record (this replaces _TOTAL which is not needed anymore)
     WRITE csv-file-record FROM four-spaces.
* Write CSV-T-HEADER
     IF TXN-MAX > ZERO
         WRITE CSV-FILE-RECORD FROM CSV-T-HEADER
*        Write CSV-T-DATA
         PERFORM
           VARYING TXN-INDEX FROM 1 BY 1
           UNTIL TXN-INDEX > TXN-MAX
             MOVE TXN-NAME (TXN-INDEX) TO T01
             MOVE TXN-TYPE (TXN-INDEX) TO T02
             WRITE CSV-FILE-RECORD FROM CSV-T-DATA
         END-PERFORM
     END-IF.
* Close CSV file
     CLOSE CSV-FILE.
*----------------------------------------------------------------------------
*   GAG   IPM AAK.    Done to calculate number of volumes for type.
 6005-CALC-DEVTYPE.
     ADD 1 TO TEMP-INDEX.
     MOVE "," TO V01-COMMA1 (TEMP-INDEX).
     IF TEMP-INDEX >= NO-DEV-TYPE-ENTRIES
       MOVE 0 TO V02-SUBTYPE (TEMP-INDEX)
     ELSE
       MOVE VOLUME-DEV-SUBTYPE (VOLUME-INDEX) TO V02-SUBTYPE (TEMP-INDEX)
     END-IF.
     MOVE "," TO V03-COMMA2 (TEMP-INDEX).
     MOVE ZERO TO V04-COUNT (TEMP-INDEX).
     PERFORM VARYING VOLUME-INDEX-2 FROM VOLUME-INDEX BY 1
               UNTIL VOLUME-INDEX-2 > VOLUME-MAX
       IF VOLUME-DEV-SUBTYPE (VOLUME-INDEX-2) > 0
         IF TEMP-INDEX >= NO-DEV-TYPE-ENTRIES
           ADD 1 TO V04-COUNT (TEMP-INDEX)
           MOVE ZERO TO VOLUME-DEV-TYPE (VOLUME-INDEX-2)
           MOVE ZERO TO VOLUME-DEV-SUBTYPE (VOLUME-INDEX-2)
         ELSE
           IF VOLUME-DEV-SUBTYPE (VOLUME-INDEX-2) = V02-SUBTYPE (TEMP-INDEX)
             ADD 1 TO V04-COUNT (TEMP-INDEX)
             MOVE ZERO TO VOLUME-DEV-TYPE (VOLUME-INDEX-2)
             MOVE ZERO TO VOLUME-DEV-SUBTYPE (VOLUME-INDEX-2)
           END-IF
         END-IF
       END-IF
     END-PERFORM.
     IF TEMP-INDEX >= NO-DEV-TYPE-ENTRIES
       MOVE ZERO TO TEMP-INDEX
     END-IF.
     SET VOLUME-INDEX TO 1.
*----------------------------------------------------------------------------
 6010-TITLE.
     MOVE TITLE-NAME (TITLE-INDEX) TO W01.
     MOVE TITLE-TYPE (TITLE-INDEX) TO W02.
*------------MeasTCM Yosemite Change----Start-----------
* Following code stores 19th most significant digit of W03, W04, W06 & W07,
* in W03-19, W04-19, W06-19 & W07-19 respectively, if any.
     MOVE 0 TO W03-19 OF CSV-W-DATA.
     MOVE 0 TO W04-19 OF CSV-W-DATA.
     MOVE 0 TO W06-19 OF CSV-W-DATA.
     MOVE 0 TO W07-19 OF CSV-W-DATA.
     DIVIDE W03 OF CSV-W-BINARY (TITLE-INDEX) BY DIV-VALUE
     GIVING W03-19 OF CSV-W-DATA.
     DIVIDE W04 OF CSV-W-BINARY (TITLE-INDEX) BY DIV-VALUE
     GIVING W04-19 OF CSV-W-DATA.
     DIVIDE W06 OF CSV-W-BINARY (TITLE-INDEX) BY DIV-VALUE
     GIVING W06-19 OF CSV-W-DATA.
     DIVIDE W07 OF CSV-W-BINARY (TITLE-INDEX) BY DIV-VALUE
     GIVING W07-19 OF CSV-W-DATA.
*------------MeasTCM Yosemite Change----End-------------
     MOVE W03 OF CSV-W-BINARY (TITLE-INDEX) TO W03 OF CSV-W-DATA.
     MOVE W04 OF CSV-W-BINARY (TITLE-INDEX) TO W04 OF CSV-W-DATA.
     MOVE W06 OF CSV-W-BINARY (TITLE-INDEX) TO W06 OF CSV-W-DATA.
     MOVE W07 OF CSV-W-BINARY (TITLE-INDEX) TO W07 OF CSV-W-DATA.
*    Soln 10-020415-8203 : start
* Modified the to use disk power conversions to individual
* disk values. Here its not required for totals.
     IF DISKCONVERTTO-PRESENT
     IF YOSEMITE-DATAFILE = "Y"
        COMPUTE W08 OF CSV-W-BINARY (TITLE-INDEX)=
                        W08 OF CSV-W-BINARY (TITLE-INDEX) * 1
                ON SIZE ERROR
                MOVE MAX-VALUE-19 TO W08 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX)=
                        W09 OF CSV-W-BINARY (TITLE-INDEX) * 1
                        ON SIZE ERROR
                        MOVE MAX-VALUE-19 TO W09 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        COMPUTE W13 OF CSV-W-BINARY (TITLE-INDEX)=
                        W13 OF CSV-W-BINARY (TITLE-INDEX) * 1
                        ON SIZE ERROR
                        MOVE MAX-VALUE-13 TO W13 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
        COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)=
                    W14 OF CSV-W-BINARY (TITLE-INDEX) * 1
                ON SIZE ERROR
                MOVE MAX-VALUE-13 TO W14 OF CSV-W-BINARY (TITLE-INDEX)
        END-COMPUTE
*     END-IF.
* Soln 10-020415-8203 : end
* Soln no 10-061115-0524 change:::start
*     IF DISKCONVERTTO-PRESENT
     ELSE
        COMPUTE W08 OF CSV-W-BINARY (TITLE-INDEX)=
                W08 OF CSV-W-BINARY (TITLE-INDEX) * 1
        END-COMPUTE
        COMPUTE W09 OF CSV-W-BINARY (TITLE-INDEX)=
                W09 OF CSV-W-BINARY (TITLE-INDEX) * 1
        END-COMPUTE
        COMPUTE W13 OF CSV-W-BINARY (TITLE-INDEX)=
                W13 OF CSV-W-BINARY (TITLE-INDEX) * 1
        END-COMPUTE
        COMPUTE W14 OF CSV-W-BINARY (TITLE-INDEX)=
                W14 OF CSV-W-BINARY (TITLE-INDEX) * 1
        END-COMPUTE
     END-IF
     END-IF.
* Soln no 10-061115-0524 change:::end
     MOVE W13 OF CSV-W-BINARY (TITLE-INDEX) TO W13 OF CSV-W-DATA.
     MOVE W14 OF CSV-W-BINARY (TITLE-INDEX) TO W14 OF CSV-W-DATA.
*-----------Soln 10-060505-6280--start----
* Removed as all 255 processes are reported as interrupts
* This clause arbitrates the priority 255 processes to be allocated
* between the SYSTEM or OTHER category bucket.
*     IF SYS-FLAG = 1
*        IF  TITLE-NAME (TITLE-INDEX) = "SYSTEM"
*            PERFORM 9990-ADD-AUX-TO-CAT
*        END-IF
*     ELSE
*        IF  TITLE-NAME (TITLE-INDEX) = "OTHER"
*            PERFORM 9990-ADD-AUX-TO-CAT
*        END-IF
*     END-IF.
*-----------Soln 10-060505-6280--end----
     DIVIDE W05 OF CSV-W-BINARY (TITLE-INDEX) BY 1000000
         GIVING W05 OF CSV-W-DATA.
     DIVIDE W08 OF CSV-W-BINARY (TITLE-INDEX) BY 1000000
         GIVING W08 OF CSV-W-DATA.
     DIVIDE W09 OF CSV-W-BINARY (TITLE-INDEX) BY 1000000
         GIVING W09 OF CSV-W-DATA.
     IF W05 OF CSV-W-BINARY (TITLE-INDEX) ZERO
         MOVE ZERO TO W21 OF CSV-W-DATA
     ELSE
         DIVIDE W21 OF CSV-W-BINARY (TITLE-INDEX)
             BY W05 OF CSV-W-BINARY (TITLE-INDEX)
             GIVING W21 OF CSV-W-DATA
     END-IF.
     IF RISC-DATA-PRESENT
*        TNSR-BUSY-TIME secs
         DIVIDE W22 OF CSV-W-BINARY (TITLE-INDEX) BY 1000000
             GIVING W22 OF CSV-W-DATA
*        ACCEL-BUSY-TIME secs
         DIVIDE W23 OF CSV-W-BINARY (TITLE-INDEX) BY 1000000
             GIVING W23 OF CSV-W-DATA
     ELSE
*        Indicate NULL fields for no RISC data
         MOVE SPACES TO W22-NULL
         MOVE SPACES TO W23-NULL
     END-IF.
*    Write CSV-W-DATA
     WRITE CSV-FILE-RECORD FROM CSV-W-DATA.
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 8999-OS-VERSION-ERROR.
* Procedure added for soln 10-000602-8415 to handle errors in OS version.
     MOVE COMPLETION-90 TO COMPLETION-MESSAGE.
     PERFORM 9010-SPCOMPLETION.
*----------------------------------------------------------------------------
 9010-SPCOMPLETION.
        CALL SPCOMPLETION.
*----------------------------------------------------------------------------
*-----------Soln 10-060505-6280--start----
* This module adds the cpu busy time of priority 255 processes to
* a temporary variable.
 9980-COMPUTE-INTR-AUX.
     IF CONVERTTO-PRESENT
        COMPUTE INTR-AUX-BUSY                             =
         INTR-AUX-BUSY                                    +
         CPU-BUSY-TIME OF ZMSPROC-DEFINITION *
         (CPU-POWER (CPU-INDEX)                            /
         CPU-POWER-VALUE)                    *
         (CONVERTTO-IPU-VALUE                              /
         CPU-IPUCOUNT (CPU-INDEX))
         ON SIZE ERROR
         MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX)
     END-COMPUTE
     ELSE
     ADD CPU-BUSY-TIME OF ZMSPROC-DEFINITION TO INTR-AUX-BUSY
     END-IF.
*-----------Soln 10-060505-6280--end----
*-----------Soln 10-060505-6280--start----
* Removed as part of Capacity Planning Enhancements program as
* all 255 priority processes are reported as interrupt processes.
* This module modifies the cpu busy counter of the SYSTEM or OTHER category
* to account for some priority 255 processes which incidentally
* are not Interrupts.
* 9990-ADD-AUX-TO-CAT.
*     IF ( INTR-AUX-BUSY - C02 OF CSV-C-BINARY) > 0
*        COMPUTE W05 OF CSV-W-BINARY (TITLE-INDEX)             =
*           W05 OF CSV-W-BINARY (TITLE-INDEX)                  +
*           ( INTR-AUX-BUSY - C02 OF CSV-C-BINARY)
*           ON SIZE ERROR
*           MOVE MAX-VALUE-19 TO W05 OF CSV-W-BINARY (TITLE-INDEX)
*        END-COMPUTE
*     END-IF.
*-----------Soln 10-060505-6280--end----
*----------------------------------------------------------------------------
 IDENTIFICATION DIVISION.
 PROGRAM-ID. SPDISKINFO.
 AUTHOR. Sangeetha
 INSTALLATION. HP NonStop Systems.
* Moving disk related logic here
*      3200-READ-DISC-INFO.                Read DISC data and process.
*----------------------------------------------------------------------------
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01  DISC-PNTR       USAGE POINTER VALUE IS NULL.
 01  ZMSDISC-PNTR    USAGE POINTER VALUE IS NULL.
 01 DISC-CNTRS.
     05  DISC-CNTR-START                NATIVE-2 VALUE ZERO.
     05  DISC-CNTR-END                  NATIVE-2 VALUE ZERO.
     05  ZMSDISC-CNTR-START             NATIVE-2 VALUE ZERO.
     05  ZMSDISC-CNTR-END               NATIVE-2 VALUE ZERO.
* LINKAGE SECTION.
 COPY DISC-DEFINITION.
 COPY ZMSDISC-DEFINITION.
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 PROCEDURE DIVISION.
 3200-READ-DISC-INFO.
* Check if file is usable.
      IF MEASURE-VALID-FILE(MEASURE-INDEX) = "Y"
        PERFORM 3205-READ-USABLE-DISC-INFO
        EXIT PROGRAM
      END-IF.
*----------------------------------------------------------------------------
 3205-READ-USABLE-DISC-INFO.
* Get disc information
     MOVE ZERO TO FIRSTCALL.
     SET SYSTEM-INDEX TO MEASURE-SYSTEM-NUMBER (MEASURE-INDEX).
* Obtain VERSION-INDEX for current system
     SET VERSION-INDEX TO 1.
     SEARCH VERSION-TABLE
         END
*            This should never occur !
             STRING COMPLETION-56     DELIMITED SIZE
                    " (version link)" DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
*             PERFORM 9000-COMPLETION
              CALL SPCOMPLETION
         WHEN VERSION-VALUE (VERSION-INDEX) = SYSTEM-VERSION (SYSTEM-INDEX)
             NEXT SENTENCE
     END-SEARCH.
* Read disc counter blocks until FIRSTCALL is ZERO.
     PERFORM TEST AFTER UNTIL FIRSTCALL ZERO
*------------MeasTCM Yosemite Change----Start-----------
        IF YOSEMITE-DATAFILE = "Y"
          ENTER TAL "MEASREAD_DIFF_"
          USING   MEASURE-DFNUM (MEASURE-INDEX),
             ALL-DISCS,
             MEASREAD-BUFFER,
             MEASREAD-BUFFER-LENGTH,
             BYTESRET,
             FIRSTCALL,
             MEAS-START,
             MEAS-STOP,
             OMITTED,
             SYSTEM-VERSION (SYSTEM-INDEX),
             OMITTED,
             1,
             OMITTED,
             OMITTED,
             OMITTED,
             OMITTED,
             ZMSDISC-TEMPLATE-VERSION
          GIVING RESULT
        ELSE
*------------MeasTCM Yosemite Change-----End------------
          ENTER TAL "MEASREAD_DIFF_"
          USING   MEASURE-DFNUM (MEASURE-INDEX),
             ALL-DISCS,
             MEASREAD-BUFFER,
             MEASREAD-BUFFER-LENGTH,
             BYTESRET,
             FIRSTCALL,
             MEAS-START,
             MEAS-STOP,
             OMITTED,
             SYSTEM-VERSION (SYSTEM-INDEX)
             OMITTED,
             1
          GIVING RESULT
*------------MeasTCM Yosemite Change----Start-----------
        END-IF
*------------MeasTCM Yosemite Change-----End------------
         IF RESULT NOT ZERO
             MOVE RESULT TO NUMBER-DISPLAY
             STRING COMPLETION-52  DELIMITED SIZE
                    SPACE          DELIMITED SIZE
                    NUMBER-DISPLAY DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
*             PERFORM 9000-COMPLETION
             CALL SPCOMPLETION
         END-IF
         IF BYTESRET NOT ZERO
             PERFORM 3210-TREAT-DISC-INFO
         END-IF
     END-PERFORM.
*----------------------------------------------------------------------------
 3210-TREAT-DISC-INFO.
* Treat disc information according to measurement data version
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
* We use FUNCTION LENGTH() to calculate the length of ZMSDISC-DEFINITION as
* MEASGETVERSION() returns legacy style Entity lengths.
          DIVIDE FUNCTION LENGTH(ZMSDISC-DEFINITION) INTO BYTESRET
          MOVE ZERO TO ZMSDISC-CNTR-START
          SET ZMSDISC-PNTR TO ADDRESS OF MEASREAD-BUFFER
          PERFORM 3215-TREAT-DISC-ENTITY-Y
          VARYING ENTITY-COUNTER FROM 1 BY 1
          UNTIL   ENTITY-COUNTER > BYTESRET
     ELSE
*------------MeasTCM Yosemite Change-----End-----------
          DIVIDE DISC-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX)
          INTO BYTESRET
          MOVE ZERO TO DISC-CNTR-START
          MOVE DISC-ENTITY-LENGTH OF VERSION-TABLE (VERSION-INDEX) TO DISC-CNTR-END
          SET DISC-PNTR TO ADDRESS OF MEASREAD-BUFFER
          PERFORM 3215-TREAT-DISC-ENTITY
          VARYING ENTITY-COUNTER FROM 1 BY 1
          UNTIL   ENTITY-COUNTER > BYTESRET
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*---------------------------------------------------------------------------
** Any logical change in procedure 3215-TREAT-DISC-ENTITY could also apply
** to the equivalent procedure 3215-TREAT-DISC-ENTITY-Y. Please check.
 3215-TREAT-DISC-ENTITY.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF DISC-DEFINITION TO DISC-PNTR.
     MOVE MEASREAD-BUFFER( DISC-CNTR-START + 1  : FUNCTION LENGTH(DISC-DEFINITION) )   TO DISC-DEFINITION
     ADD DISC-CNTR-END      TO  DISC-CNTR-START
*     SET DISC-PNTR UP BY FUNCTION LENGTH(DISC-DEFINITION).
* Check for measure allocation error
* Soln 10-000518-8168. Check MEASURE counters. If 32-bit counters overflow,
* use 64-bit counters.
     MOVE 0 TO CONDITION.
     MOVE 1 TO ARRAY-CTR.
     PERFORM UNTIL ARRAY-CTR = 5
*       IF (ADDRESS OF BLKS OF CN OF DISC-DEFINITION (ARRAY-CTR) < DISC-PNTR AND
         IF (BLKS OF CN OF DISC-DEFINITION (ARRAY-CTR) < 0) OR
*          (ADDRESS OF BLKS OF CN OF DISC-DEFINITION (ARRAY-CTR) > DISC-PNTR AND
            (BLKS OF C OF DISC-DEFINITION (ARRAY-CTR) < 0)
          MOVE 1 TO CONDITION
       END-IF
       ADD 1 TO ARRAY-CTR
     END-PERFORM.
*IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF INPUT-BYTES-F OF DISC-DEFINITION < DISC-PNTR AND
      IF ((INPUT-BYTES-F OF DISC-DEFINITION < 0) AND
*        (ADDRESS OF INPUT-BYTES-F OF DISC-DEFINITION > DISC-PNTR AND
         (INPUT-BYTES OF DISC-DEFINITION < 0 )) OR
*        (ADDRESS OF OUTPUT-BYTES-F OF DISC-DEFINITION < DISC-PNTR AND
         ((OUTPUT-BYTES-F OF DISC-DEFINITION < 0) AND
*        (ADDRESS OF OUTPUT-BYTES-F OF DISC-DEFINITION > DISC-PNTR AND
         (OUTPUT-BYTES OF DISC-DEFINITION < 0 ))
        MOVE 1 TO CONDITION
     END-IF.
* Line commented for Soln 10-000518-8168
*     IF ENTITY-ERROR OF DISC-DEFINITION NOT ZERO
      IF (ENTITY-ERROR OF DISC-DEFINITION > ZERO) OR CONDITION = 1
* End of part of the fix of Soln 10-000518-8168.
        ADD 1  TO DISC-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
*         MOVE ENTITY-ERROR OF DISC-DEFINITION TO NUMBER-DISPLAY
*         STRING COMPLETION-53  DELIMITED SIZE
*                SPACE          DELIMITED SIZE
*                NUMBER-DISPLAY DELIMITED SIZE
*                INTO COMPLETION-MESSAGE
*         MOVE 1 TO ABEND-REQUIRED-FLAG
*         PERFORM 9000-COMPLETION
     ELSE
*      GAG.  IPM AAI.  Check if DISC record is valid.
       IF (FROM-TIMESTAMP OF DISC-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE (MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF DISC-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3215-00-CONT-DISC-INFO
       END-IF
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3215-00-CONT-DISC-INFO could also apply
** to the equivalent procedure 3215-00-CONT-DISC-INFO-Y. Please check.
 3215-00-CONT-DISC-INFO.
*    GAG.  IPM AAJ.  Use addresses for new counters.
*IF CONDITION MODIFIED BY SANGEETHA
*     IF ADDRESS OF READ-QBUSY-TIME OF DISC-DEFINITION < DISC-PNTR
      IF (READ-QBUSY-TIME OF DISC-DEFINITION > 0)
       MOVE READ-QBUSY-TIME OF DISC-DEFINITION
         TO READ-BUSY-TIME  OF DISC-DEFINITION
     END-IF.
*     IF ADDRESS OF WRITE-QBUSY-TIME OF DISC-DEFINITION < DISC-PNTR
      IF (WRITE-QBUSY-TIME OF DISC-DEFINITION > 0)
       MOVE WRITE-QBUSY-TIME OF DISC-DEFINITION
         TO WRITE-BUSY-TIME  OF DISC-DEFINITION
     END-IF.
     IF DEVICE-NAME OF DISC-DEFINITION NOT = SPACES
*        READS/WRITES/SEEKS can be negative since original counters
*        are unsigned
         IF READS  OF DISC-DEFINITION NEGATIVE OR
            WRITES OF DISC-DEFINITION NEGATIVE
             STRING COMPLETION-56              DELIMITED SIZE
                    " (READS/WRITES negative)" DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
*             PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
         END-IF
*        Check if the volume name already exists
         SET VOLUME-INDEX TO 1
         SEARCH VOLUME-TABLE
             END
                 PERFORM 3215-10-NO-VOLUME
             WHEN VOLUME-NAME (VOLUME-INDEX) =
                      DEVICE-NAME OF DISC-DEFINITION AND
                  VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX
                 PERFORM 3215-20-VOLUME
         END-SEARCH
     END-IF.
*---------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3215-TREAT-DISC-ENTITY-Y could also apply
** to the equivalent procedure 3215-TREAT-DISC-ENTITY. Please check.
 3215-TREAT-DISC-ENTITY-Y.
* Set the addresses to point to the current entity.  Prepare PNTR for next one.
*     SET ADDRESS OF ZMSDISC-DEFINITION TO ZMSDISC-PNTR.
     MOVE MEASREAD-BUFFER( ZMSDISC-CNTR-START + 1  : FUNCTION LENGTH(ZMSDISC-DEFINITION) )   TO ZMSDISC-DEFINITION
     ADD FUNCTION LENGTH(ZMSDISC-DEFINITION)      TO  ZMSDISC-CNTR-START
*     SET ZMSDISC-PNTR UP BY FUNCTION LENGTH(ZMSDISC-DEFINITION).
* Check for measure allocation error
* Soln 10-000518-8168. Check MEASURE counters. If 32-bit counters overflow,
* use 64-bit counters.
     MOVE 0 TO CONDITION.
     MOVE 1 TO ARRAY-CTR.
     PERFORM UNTIL ARRAY-CTR = 9
       IF (ADDRESS OF BLKS OF C OF ZMSDISC-DEFINITION (ARRAY-CTR) < ZMSDISC-PNTR
           AND BLKS OF C OF ZMSDISC-DEFINITION (ARRAY-CTR) < 0)
          MOVE 1 TO CONDITION
       END-IF
       ADD 1 TO ARRAY-CTR
     END-PERFORM.
*IF CONDITION MODIFIED BY SANGEETHA
*     IF (ADDRESS OF INPUT-BYTES OF ZMSDISC-DEFINITION < ZMSDISC-PNTR AND
      IF  (INPUT-BYTES OF ZMSDISC-DEFINITION < 0) OR
*        (ADDRESS OF OUTPUT-BYTES OF ZMSDISC-DEFINITION < ZMSDISC-PNTR AND
         (OUTPUT-BYTES OF ZMSDISC-DEFINITION < 0)
         MOVE 1 TO CONDITION
     END-IF.
     IF (ENTITY-ERROR OF ZMSDISC-DEFINITION > ZERO) OR CONDITION = 1
        ADD 1  TO DISC-OVERFLOW-COUNT
        MOVE 1 TO OVERFLOW-FLAG
     ELSE
       IF (FROM-TIMESTAMP OF ZMSDISC-DEFINITION + USEC-MINUTE) <
            MEASURE-START OF MEASURE-TABLE (MEASURE-INDEX)
        OR
          (TO-TIMESTAMP OF ZMSDISC-DEFINITION - USEC-MINUTE) >
            MEASURE-STOP OF MEASURE-TABLE (MEASURE-INDEX)
         DISPLAY INFO-25
         DISPLAY MEASURE-EXTERNAL-NAME (MEASURE-INDEX), " now marked invalid."
         MOVE INFO-25 TO CSV-TEMP-3
         MOVE "N" TO MEASURE-VALID-FILE (MEASURE-INDEX)
         MOVE 1 TO MEASURE-FILE-OVERFLOW
         MOVE ZERO TO BYTESRET, FIRSTCALL
       ELSE
         PERFORM 3215-00-CONT-DISC-INFO-Y
       END-IF
     END-IF.
*---------------------------------------------------------------------------
** Any logical change in procedure 3215-00-CONT-DISC-INFO-Y could also apply
** to the equivalent procedure 3215-00-CONT-DISC-INFO. Please check.
 3215-00-CONT-DISC-INFO-Y.
     IF DEVICE-NAME OF ZMSDISC-DEFINITION NOT = SPACES
*        READS/WRITES/SEEKS can be negative since original counters
*        are unsigned
         IF READS  OF ZMSDISC-DEFINITION NEGATIVE OR
            WRITES OF ZMSDISC-DEFINITION NEGATIVE
             STRING COMPLETION-56              DELIMITED SIZE
                    " (READS/WRITES negative)" DELIMITED SIZE
                    INTO COMPLETION-MESSAGE
             MOVE 1 TO ABEND-REQUIRED-FLAG
*             PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
         END-IF
*        Check if the volume name already exists
         SET VOLUME-INDEX TO 1
         SEARCH VOLUME-TABLE
             END
                 PERFORM 3215-10-NO-VOLUME
             WHEN VOLUME-NAME (VOLUME-INDEX) =
                      DEVICE-NAME OF ZMSDISC-DEFINITION AND
                  VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) = SYSTEM-INDEX
                 PERFORM 3215-20-VOLUME-Y
         END-SEARCH
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
*---------------------------------------------------------------------------
 3215-10-NO-VOLUME.
     ADD 1 TO VOLUME-MAX.
     IF VOLUME-MAX > VOLUME-CEILING
         MOVE COMPLETION-61 TO COMPLETION-MESSAGE
*         PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
     END-IF.
     SET VOLUME-INDEX TO VOLUME-MAX.
*    Insert new volume information
     SET VOLUME-SYSTEM-NUMBER (VOLUME-INDEX) TO SYSTEM-INDEX.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        MOVE DEVICE-NAME     OF ZMSDISC-DEFINITION
        TO VOLUME-NAME  (VOLUME-INDEX)
        MOVE MODULE OF GMS OF ZMSDISC-DEFINITION
        TO VOLUME-UNIT-1  (VOLUME-INDEX)
     ELSE
*------------MeasTCM Yosemite Change-----End------------
        MOVE DEVICE-NAME     OF DISC-DEFINITION
        TO VOLUME-NAME  (VOLUME-INDEX)
        MOVE UNIT-NUMBER     OF DISC-DEFINITION
        TO VOLUME-UNIT-1  (VOLUME-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
        MOVE -1 TO VOLUME-UNIT-2 (VOLUME-INDEX).
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
*    GAG   IPM AAK.   Now store the type and subtype.
        MOVE DEVICE-TYPE     OF ZMSDISC-DEFINITION
        TO VOLUME-DEV-TYPE (VOLUME-INDEX)
        MOVE DEVICE-SUBTYPE  OF ZMSDISC-DEFINITION
        TO VOLUME-DEV-SUBTYPE (VOLUME-INDEX)
     ELSE
*------------MeasTCM Yosemite Change-----End------------
*    GAG   IPM AAK.   Now store the type and subtype.
        MOVE DEVICE-TYPE     OF DISC-DEFINITION
        TO VOLUME-DEV-TYPE (VOLUME-INDEX)
        MOVE DEVICE-SUBTYPE  OF DISC-DEFINITION
        TO VOLUME-DEV-SUBTYPE (VOLUME-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
* Soln 10-020415-8203 : start
     IF DISK-SUBTYPE-SAVE ZERO
         MOVE VOLUME-DEV-SUBTYPE (VOLUME-INDEX) TO DISK-SUBTYPE-SAVE
         MOVE VOLUME-DEV-SUBTYPE (VOLUME-INDEX) TO DISK-SUBTYPE-SEARCH-KEY
     ELSE
         MOVE DISK-SUBTYPE-SEARCH-KEY TO DISK-SUBTYPE-SAVE
         MOVE VOLUME-DEV-SUBTYPE (VOLUME-INDEX) TO DISK-SUBTYPE-SEARCH-KEY
     END-IF.
     IF (DISK-SUBTYPE-SEARCH-KEY NOT = DISK-SUBTYPE-SAVE)
                                  AND (NOT DISKCONVERTTO-PRESENT)
*         DISKCONVERTTO should have been specified in control file
          MOVE COMPLETION-95 TO COMPLETION-MESSAGE
*          PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
     END-IF.
    IF (DISK-SUBTYPE-SEARCH-KEY = 42)
       IF NOT ACTUALDISK42-PRESENT
*         ACTUALDISK42 keyword is necessary.
          PERFORM
             MOVE COMPLETION-103 TO COMPLETION-MESSAGE
*             PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
          END-PERFORM
       ELSE
          MOVE ACTUALDISK42-ENTERED TO ACTUAL-DISK-MODEL-NAME
          PERFORM 3225-15-SET-RPM-CONTROLLER
          MOVE ZERO TO XPDISK-FLAG
       END-IF
    ELSE IF DISK-SUBTYPE-SEARCH-KEY = 43
       IF NOT ACTUALDISK43-PRESENT
*         ACTUALDISK43 keyword is necessary.
          PERFORM
              MOVE COMPLETION-104 TO COMPLETION-MESSAGE
*              PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
          END-PERFORM
        ELSE
           MOVE ACTUALDISK43-ENTERED TO ACTUAL-DISK-MODEL-NAME
           PERFORM 3225-15-SET-RPM-CONTROLLER
           MOVE ZERO TO XPDISK-FLAG
        END-IF
    ELSE IF DISK-SUBTYPE-SEARCH-KEY = 44
       IF NOT ACTUALDISK44-PRESENT
*          ACTUALDISK44 keyword is necessary.
           PERFORM
               MOVE COMPLETION-105 TO COMPLETION-MESSAGE
*               PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
           END-PERFORM
       ELSE
           MOVE ACTUALDISK44-ENTERED TO ACTUAL-DISK-MODEL-NAME
           PERFORM 3225-15-SET-RPM-CONTROLLER
           MOVE ZERO TO XPDISK-FLAG
       END-IF
*------------MeasTCM Yosemite Change----Start-----------
* JBOD Disc support (Subtype 53).
    ELSE IF DISK-SUBTYPE-SEARCH-KEY = 53
       IF NOT ACTUALDISK53-PRESENT
*          ACTUALDISK53 keyword is necessary.
           PERFORM
               MOVE COMPLETION-108 TO COMPLETION-MESSAGE
*               PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
           END-PERFORM
       ELSE
           MOVE ACTUALDISK53-ENTERED TO ACTUAL-DISK-MODEL-NAME
           PERFORM 3225-15-SET-RPM-CONTROLLER
           MOVE ZERO TO XPDISK-FLAG
       END-IF
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for CEP RFE.
* SAS Disc support (Subtype 51).
    ELSE IF DISK-SUBTYPE-SEARCH-KEY = 51
       IF NOT ACTUALDISK51-PRESENT
*          ACTUALDISK51 keyword is necessary.
           PERFORM
               MOVE COMPLETION-112 TO COMPLETION-MESSAGE
               CALL  SPCOMPLETION
           END-PERFORM
       ELSE
           MOVE ACTUALDISK51-ENTERED TO ACTUAL-DISK-MODEL-NAME
           PERFORM 3225-15-SET-RPM-CONTROLLER
           MOVE ZERO TO XPDISK-FLAG
       END-IF
* XP Disc support (Subtype 52).
    ELSE IF DISK-SUBTYPE-SEARCH-KEY = 52
       IF NOT ACTUALDISK52-PRESENT
*          ACTUALDISK51 keyword is necessary.
                IF NOT XPDISKFACTOR-PRESENT
                PERFORM
                        MOVE COMPLETION-122 TO COMPLETION-MESSAGE
                        CALL  SPCOMPLETION
                END-PERFORM
                ELSE
                MOVE XPDISK-ENTERED TO ACTUAL-DISK-MODEL-NAME
                PERFORM 2510-SET-XP-POWERVALUE
                MOVE 1 TO XPDISK-FLAG
                END-IF
       ELSE
           MOVE ACTUALDISK52-ENTERED TO ACTUAL-DISK-MODEL-NAME
           PERFORM 2510-SET-XP-POWERVALUE
           MOVE 1 TO XPDISK-FLAG
       END-IF
    ELSE
      SET DISK-SUBTYPE-INDEX TO 1
      SEARCH DISK-TYPE-POWER-TABLE
        END
         PERFORM
           MOVE COMPLETION-96 TO COMPLETION-MESSAGE
*           PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
         END-PERFORM
        WHEN DISK-SUBTYPE-NUMBER(DISK-SUBTYPE-INDEX) = DISK-SUBTYPE-SEARCH-KEY
        MOVE DISK-TYPE-ALFA(DISK-SUBTYPE-INDEX) TO ACTUAL-DISK-MODEL-NAME
        MOVE DISK-RPM(DISK-SUBTYPE-INDEX) TO ACTUAL-DISK-RPM
        MOVE DISK-CONTROLLER(DISK-SUBTYPE-INDEX) TO ACTUAL-DISK-CNT
        MOVE DISK-READSEEK(DISK-SUBTYPE-INDEX) TO ACTUAL-READ-SEEK-VALUE
        MOVE DISK-WRITESEEK(DISK-SUBTYPE-INDEX) TO ACTUAL-WRITE-SEEK-VALUE
      END-SEARCH
     END-IF.
*    Save the controller factor of ACTUAL disk controller type
     SET CNT-TYPE-POWER-INDEX TO 1.
     SEARCH CONTROLLER-TYPE-POWER-TABLE
          END
          PERFORM
              MOVE COMPLETION-92 TO COMPLETION-MESSAGE
*              PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
          END-PERFORM
         WHEN CNT-TYPE-ALFA(CNT-TYPE-POWER-INDEX) = ACTUAL-DISK-CNT
         MOVE CNT-POWER(CNT-TYPE-POWER-INDEX) TO ACTUAL-CNT-POWER-VALUE
     END-SEARCH.
* Soln no 10-061115-0524 change:::start
* Save calulate DISK-POWER-VALUE for considering each disk measured.
*
*     IF ACTUAL-DISK-MODEL-NAME NOT = DISKTO-DISK-MODEL-NAME
*       COMPUTE DISK-POWER-VALUE = DISK-POWER-VALUE + (ACTUAL-DISK-RPM /
*         DISKTO-RPM-VALUE) * (ACTUAL-CNT-POWER-VALUE / DISKTO-CNT-POWER-VALUE)
*       END-COMPUTE
*     END-IF.
* Added for Solution:10-090116-8480
* Added condition to check DISKCONVERTTO-PRESENT
    IF DISKCONVERTTO-PRESENT
* Start of code change for CEP RFE.
* Below COMPUTE DISK-POWER-VALUE commented as part of CEP RFE change
*       COMPUTE DISK-POWER-VALUE = (ACTUAL-DISK-RPM /
*         DISKTO-RPM-VALUE) * (ACTUAL-CNT-POWER-VALUE / DISKTO-CNT-POWER-VALUE)
*       END-COMPUTE
* Below procedure calculates DISK POWER VALUE considering read and write seek times.
        PERFORM 2440-CALCULATE-DISKPOWER-VALUE
   END-IF.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        IF DISKCONVERTTO-PRESENT
        COMPUTE READ-QBUSY-TIME  OF ZMSDISC-DEFINITION =
             READ-QBUSY-TIME  OF ZMSDISC-DEFINITION * DISK-READPOWER-VALUE
        END-COMPUTE
        COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
             WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION * DISK-WRITEPOWER-VALUE
        END-COMPUTE
* If WCE is enabled in actual disk and disabled in target disk,
* degrade WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION by 20%.
        IF ((ACTUAL-DISK-WCE EQUAL TO "ON" OR "on") AND
           (DISKTO-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na"))
           COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
                   WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION +
                   (0.2 * WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION)
           END-COMPUTE
* If WCE is disabled in actual disk and enabled in target disk,
* increment WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION by 20%.
        ELSE IF ((ACTUAL-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na") AND
                (DISKTO-DISK-WCE EQUAL TO "ON" OR "on"))
           COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
                   WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION -
                   (0.2 * WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION)
           END-COMPUTE
        END-IF
        COMPUTE READS           OF ZMSDISC-DEFINITION =
            READS           OF ZMSDISC-DEFINITION * 1
        END-COMPUTE
        COMPUTE WRITES          OF ZMSDISC-DEFINITION =
            WRITES          OF ZMSDISC-DEFINITION * 1
        END-COMPUTE
        END-IF
        MOVE READ-QBUSY-TIME  OF ZMSDISC-DEFINITION
        TO VOLUME-READ-BUSY-TIME  (VOLUME-INDEX)
        MOVE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION
        TO VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX)
        MOVE READS           OF ZMSDISC-DEFINITION
        TO VOLUME-READS           (VOLUME-INDEX)
        MOVE WRITES          OF ZMSDISC-DEFINITION
        TO VOLUME-WRITES          (VOLUME-INDEX)
     ELSE
*------------MeasTCM Yosemite Change-----End------------
* Start of code change for Solution:10-090116-8480
* Added below lines for Solution:10-090116-8480
        IF DISKCONVERTTO-PRESENT
* Modified below set of COMPUTE statements to use disk read and write power values for CEP RFE
        COMPUTE READ-BUSY-TIME  OF DISC-DEFINITION =
             READ-BUSY-TIME  OF DISC-DEFINITION * DISK-READPOWER-VALUE
        END-COMPUTE
        COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
             WRITE-BUSY-TIME OF DISC-DEFINITION * DISK-WRITEPOWER-VALUE
        END-COMPUTE
* If WCE is enabled in actual disk and disabled in target disk,
* degrade WRITE-BUSY-TIME OF DISC-DEFINITION by 20%.
        IF ((ACTUAL-DISK-WCE EQUAL TO "ON" OR "on") AND
           (DISKTO-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na"))
           COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
                   WRITE-BUSY-TIME OF DISC-DEFINITION +
                   (0.2 * WRITE-BUSY-TIME OF DISC-DEFINITION)
           END-COMPUTE
* If WCE is disabled in actual disk and enabled in target disk,
* increment WRITE-BUSY-TIME OF DISC-DEFINITION by 20%.
        ELSE IF ((ACTUAL-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na") AND
                (DISKTO-DISK-WCE EQUAL TO "ON" OR "on"))
           COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
                   WRITE-BUSY-TIME OF DISC-DEFINITION -
                   (0.2 * WRITE-BUSY-TIME OF DISC-DEFINITION)
           END-COMPUTE
        END-IF
        COMPUTE SEEK-BUSY-TIME OF DISC-DEFINITION =
            SEEK-BUSY-TIME OF DISC-DEFINITION *
            (ACTUAL-READ-SEEK-VALUE + ACTUAL-WRITE-SEEK-VALUE) /
            (DISKTO-READ-SEEK-VALUE + DISKTO-WRITE-SEEK-VALUE)
        END-COMPUTE
        COMPUTE READS           OF DISC-DEFINITION =
            READS           OF DISC-DEFINITION * 1
        END-COMPUTE
        COMPUTE WRITES          OF DISC-DEFINITION =
            WRITES          OF DISC-DEFINITION * 1
        END-COMPUTE
        END-IF
* End of code change for Solution:10-090116-8480
        MOVE READ-BUSY-TIME  OF DISC-DEFINITION
        TO VOLUME-READ-BUSY-TIME  (VOLUME-INDEX)
        MOVE WRITE-BUSY-TIME OF DISC-DEFINITION
        TO VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX)
        MOVE SEEK-BUSY-TIME OF DISC-DEFINITION
        TO VOLUME-SEEK-BUSY-TIME  (VOLUME-INDEX)
        MOVE READS           OF DISC-DEFINITION
        TO VOLUME-READS           (VOLUME-INDEX)
        MOVE WRITES          OF DISC-DEFINITION
        TO VOLUME-WRITES          (VOLUME-INDEX)
*------------MeasTCM Yosemite Change----Start-----------
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
     MOVE ZERO TO VOLUME-DOPN-READS  (VOLUME-INDEX),
                  VOLUME-DOPN-WRITES (VOLUME-INDEX).
     MOVE 1 TO    NO-OF-VOLUME-RECS(VOLUME-INDEX)
                  NO-OF-FILES(VOLUME-INDEX).
     MOVE MEASURE-DATAFILE(MEASURE-INDEX)
        TO PREVIOUS-MEAS-FILE(VOLUME-INDEX).
*---------------------------------------------------------------------------
* Soln 10-020415-8203 : START
 3225-15-SET-RPM-CONTROLLER.
     SET DISK-SUBTYPE-INDEX TO 1.
     SEARCH DISK-TYPE-POWER-TABLE
      END
      PERFORM
         MOVE COMPLETION-96 TO COMPLETION-MESSAGE
*         PERFORM 9000-COMPLETION
                CALL SPCOMPLETION
      END-PERFORM
      WHEN DISK-TYPE-ALFA(DISK-SUBTYPE-INDEX) = ACTUAL-DISK-MODEL-NAME
      MOVE DISK-RPM(DISK-SUBTYPE-INDEX) TO ACTUAL-DISK-RPM
      MOVE DISK-CONTROLLER(DISK-SUBTYPE-INDEX) TO ACTUAL-DISK-CNT
      MOVE DISK-READSEEK(DISK-SUBTYPE-INDEX) TO ACTUAL-READ-SEEK-VALUE
      MOVE DISK-WRITESEEK(DISK-SUBTYPE-INDEX) TO ACTUAL-WRITE-SEEK-VALUE
    END-SEARCH.
* Soln 10-020415-8203 : end
*---------------------------------------------------------------------------
 2510-SET-XP-POWERVALUE.
     SET XPDISK-TYPE-INDEX TO 1.
     SEARCH XPDISK-POWER-TABLE
      END
      PERFORM
         MOVE COMPLETION-96 TO COMPLETION-MESSAGE
         CALL SPCOMPLETION
      END-PERFORM
      WHEN XPDISK-TYPE-ALFA (XPDISK-TYPE-INDEX) = ACTUAL-DISK-MODEL-NAME
        PERFORM
        MOVE XPDISK-FACTOR (XPDISK-TYPE-INDEX) TO XPDISK-POWER-VALUE
        PERFORM 3225-15-SET-RPM-CONTROLLER
        END-PERFORM
    END-SEARCH.
*---------------------------------------------------------------------------
** Any logical change in procedure 3215-20-VOLUME could also apply
** to the equivalent procedure 3215-20-VOLUME-Y. Please check.
 3215-20-VOLUME.
*    If unit number is not registered yet, enter it
     IF VOLUME-UNIT-2 (VOLUME-INDEX) = -1 AND
        UNIT-NUMBER OF DISC-DEFINITION NOT =
        VOLUME-UNIT-1 (VOLUME-INDEX)
         MOVE UNIT-NUMBER OF DISC-DEFINITION TO
         VOLUME-UNIT-2 (VOLUME-INDEX)
     END-IF.
* Soln no 10-061115-0524 change:::start
* Added IF condition for Solution:10-090116-8480
   IF DISKCONVERTTO-PRESENT
* Below COMPUTE DISK-POWER-VALUE commented as part of CEP RFE change
*       COMPUTE DISK-POWER-VALUE = (ACTUAL-DISK-RPM /
*         DISKTO-RPM-VALUE) * (ACTUAL-CNT-POWER-VALUE / DISKTO-CNT-POWER-VALUE)
*       END-COMPUTE
* Below procedure calculates DISK POWER VALUE considering read and write seek times.
        PERFORM 2440-CALCULATE-DISKPOWER-VALUE
* Modified below compute statements to use disk read and write power values for CEP RFE.
     COMPUTE READ-BUSY-TIME  OF DISC-DEFINITION =
          READ-BUSY-TIME  OF DISC-DEFINITION * DISK-READPOWER-VALUE
     END-COMPUTE
     COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
         WRITE-BUSY-TIME OF DISC-DEFINITION * DISK-WRITEPOWER-VALUE
     END-COMPUTE
* If WCE is enabled in actual disk and disabled in target disk,
* degrade WRITE-BUSY-TIME OF DISC-DEFINITION by 20%.
        IF ((ACTUAL-DISK-WCE EQUAL TO "ON" OR "on") AND
           (DISKTO-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na"))
           COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
                   WRITE-BUSY-TIME OF DISC-DEFINITION +
                   (0.2 * WRITE-BUSY-TIME OF DISC-DEFINITION)
           END-COMPUTE
* If WCE is disabled in actual disk and enabled in target disk,
* increment WRITE-BUSY-TIME OF DISC-DEFINITION by 20%.
        ELSE IF ((ACTUAL-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na") AND
                (DISKTO-DISK-WCE EQUAL TO "ON" OR "on"))
           COMPUTE WRITE-BUSY-TIME OF DISC-DEFINITION =
                   WRITE-BUSY-TIME OF DISC-DEFINITION -
                   (0.2 * WRITE-BUSY-TIME OF DISC-DEFINITION)
           END-COMPUTE
        END-IF
     COMPUTE SEEK-BUSY-TIME OF DISC-DEFINITION =
             SEEK-BUSY-TIME OF DISC-DEFINITION *
             (ACTUAL-READ-SEEK-VALUE + ACTUAL-WRITE-SEEK-VALUE) /
             (DISKTO-READ-SEEK-VALUE + DISKTO-WRITE-SEEK-VALUE)
     END-COMPUTE
     COMPUTE READS           OF DISC-DEFINITION =
             READS           OF DISC-DEFINITION * 1
     END-COMPUTE
     COMPUTE WRITES          OF DISC-DEFINITION =
             WRITES          OF DISC-DEFINITION * 1
     END-COMPUTE
   END-IF.
* Soln no 10-061115-0524 change:::end
*    Increment volume information
     ADD READ-BUSY-TIME  OF DISC-DEFINITION
       TO VOLUME-READ-BUSY-TIME  (VOLUME-INDEX).
     ADD WRITE-BUSY-TIME OF DISC-DEFINITION
       TO VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX).
     ADD SEEK-BUSY-TIME  OF DISC-DEFINITION
       TO VOLUME-SEEK-BUSY-TIME  (VOLUME-INDEX).
     ADD READS           OF DISC-DEFINITION
       TO VOLUME-READS           (VOLUME-INDEX).
     ADD WRITES          OF DISC-DEFINITION
       TO  VOLUME-WRITES          (VOLUME-INDEX).
*    Increment the number of occurrances of this volume.
*    If the file name is changed, increment the number
*    of files in which this volume occurs.
     ADD 1 TO NO-OF-VOLUME-RECS(VOLUME-INDEX).
     IF MEASURE-DATAFILE(MEASURE-INDEX) NOT =
                           PREVIOUS-MEAS-FILE(VOLUME-INDEX)
         ADD 1 TO NO-OF-FILES(VOLUME-INDEX)
     END-IF.
     MOVE MEASURE-DATAFILE(MEASURE-INDEX)
        TO PREVIOUS-MEAS-FILE(VOLUME-INDEX).
*---------------------------------------------------------------------------
*------------MeasTCM Yosemite Change----Start-----------
** Any logical change in procedure 3215-20-VOLUME-Y could also apply
** to the equivalent procedure 3215-20-VOLUME. Please check.
 3215-20-VOLUME-Y.
*    If unit number is not registered yet, enter it
     IF VOLUME-UNIT-2 (VOLUME-INDEX) = -1 AND
        MODULE OF GMS OF ZMSDISC-DEFINITION NOT =
        VOLUME-UNIT-1 (VOLUME-INDEX)
         MOVE MODULE OF GMS OF ZMSDISC-DEFINITION TO
         VOLUME-UNIT-2 (VOLUME-INDEX)
     END-IF.
* Soln no 10-061115-0524 change:::start
* Added IF condition for Solution:10-090116-8480
     IF DISKCONVERTTO-PRESENT
* Below COMPUTE DISK-POWER-VALUE commented as part of CEP RFE change
*       COMPUTE DISK-POWER-VALUE = (ACTUAL-DISK-RPM /
*         DISKTO-RPM-VALUE) * (ACTUAL-CNT-POWER-VALUE / DISKTO-CNT-POWER-VALUE)
*       END-COMPUTE
* Below procedure calculates DISK POWER VALUE considering read and write seek times.
        PERFORM 2440-CALCULATE-DISKPOWER-VALUE
        COMPUTE READ-QBUSY-TIME  OF ZMSDISC-DEFINITION =
             READ-QBUSY-TIME  OF ZMSDISC-DEFINITION * DISK-READPOWER-VALUE
        END-COMPUTE
        COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
             WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION * DISK-WRITEPOWER-VALUE
        END-COMPUTE
* If WCE is enabled in actual disk and disabled in target disk,
* degrade WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION by 20%.
        IF ((ACTUAL-DISK-WCE EQUAL TO "ON" OR "on") AND
           (DISKTO-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na"))
           COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
                   WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION +
                   (0.2 * WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION)
           END-COMPUTE
* If WCE is disabled in actual disk and enabled in target disk,
* increment WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION by 20%.
        ELSE IF ((ACTUAL-DISK-WCE EQUAL TO "OFF" OR "off" OR "NA" or "na") AND
                (DISKTO-DISK-WCE EQUAL TO "ON" OR "on"))
           COMPUTE WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION =
                   WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION -
                   (0.2 * WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION)
           END-COMPUTE
        END-IF
        COMPUTE READS           OF ZMSDISC-DEFINITION =
            READS           OF ZMSDISC-DEFINITION * 1
        END-COMPUTE
        COMPUTE WRITES          OF ZMSDISC-DEFINITION =
            WRITES          OF ZMSDISC-DEFINITION * 1
        END-COMPUTE
     END-IF.
*    Increment volume information
     ADD READ-QBUSY-TIME  OF ZMSDISC-DEFINITION
       TO VOLUME-READ-BUSY-TIME  (VOLUME-INDEX).
     ADD WRITE-QBUSY-TIME OF ZMSDISC-DEFINITION
       TO VOLUME-WRITE-BUSY-TIME (VOLUME-INDEX).
     ADD READS           OF ZMSDISC-DEFINITION
       TO VOLUME-READS           (VOLUME-INDEX).
     ADD WRITES          OF ZMSDISC-DEFINITION
       TO  VOLUME-WRITES          (VOLUME-INDEX).
*    Increment the number of occurrances of this volume.
*    If the file name is changed, increment the number
*    of files in which this volume occurs.
     ADD 1 TO NO-OF-VOLUME-RECS(VOLUME-INDEX).
     IF MEASURE-DATAFILE(MEASURE-INDEX) NOT =
                           PREVIOUS-MEAS-FILE(VOLUME-INDEX)
         ADD 1 TO NO-OF-FILES(VOLUME-INDEX)
     END-IF.
     MOVE MEASURE-DATAFILE(MEASURE-INDEX)
        TO PREVIOUS-MEAS-FILE(VOLUME-INDEX).
*------------MeasTCM Yosemite Change-----End------------
*----------------------------------------------------------------------------
* This module added as part of CEP change.
* This module calculates the disk power value.
 2440-CALCULATE-DISKPOWER-VALUE.
 IF (XPDISK-FLAG NOT ZERO)
        MOVE  XPDISK-POWER-VALUE TO DISK-READPOWER-VALUE
        MOVE  XPDISK-POWER-VALUE TO DISK-WRITEPOWER-VALUE
 ELSE
        COMPUTE DISK-RPM-RATIO = ACTUAL-DISK-RPM /
                                 DISKTO-RPM-VALUE
        END-COMPUTE
        COMPUTE DISK-CNT-POWER-RATIO = ACTUAL-CNT-POWER-VALUE/
                                       DISKTO-CNT-POWER-VALUE
        END-COMPUTE
        COMPUTE DISK-READSEEK-RATIO = DISKTO-READ-SEEK-VALUE /
                                      ACTUAL-READ-SEEK-VALUE
        END-COMPUTE
        COMPUTE DISK-WRITESEEK-RATIO = DISKTO-WRITE-SEEK-VALUE /
                                       ACTUAL-WRITE-SEEK-VALUE
        END-COMPUTE
        COMPUTE DISK-READPOWER-VALUE = DISK-RPM-RATIO * DISK-CNT-POWER-RATIO * DISK-READSEEK-RATIO
        END-COMPUTE
        COMPUTE DISK-WRITEPOWER-VALUE = DISK-RPM-RATIO * DISK-CNT-POWER-RATIO * DISK-WRITESEEK-RATIO
        END-COMPUTE
 END-IF.
 END PROGRAM SPDISKINFO.
*----------------------------------------------------------------------------
*----------------------------------------------------------------------------
 IDENTIFICATION DIVISION.
 PROGRAM-ID. SPCOMPLETION COMMON.
 AUTHOR. Sangeetha
 INSTALLATION. HP NonStop Systems.
* Moving 9000-COMPLETION and the related modules here
*      9000-COMPLETION.                    Shutdown processing.
*----------------------------------------------------------------------------
 PROCEDURE DIVISION.
*----------------------------------------------------------------------------
 9000-COMPLETION.
* Close control file
     IF NOT CONTROL-FILE-CLOSED
         CLOSE CONTROL-FILE
     END-IF.
* Close measurement data files
     PERFORM
         VARYING MEASURE-INDEX FROM 1 BY 1
         UNTIL MEASURE-INDEX > MEASURE-MAX
         IF MEASURE-DFNUM (MEASURE-INDEX) NOT ZERO
             ENTER TAL "MEASCLOSE"
                 USING MEASURE-DFNUM (MEASURE-INDEX)
                 GIVING RESULT
         END-IF
     END-PERFORM.
** Output run summary.
* Soln 10-000602-8415. Print COMPLETION-89/90 message and do not print the
* run summary if COMPLETION-89 or 90 is encountered.
   IF COMPLETION-MESSAGE (1:2) NOT = "89" AND "90"
     IF C-WRITE-RUN-SUMMARY
*        PERFORM 7000-DISPLAY-SUMMARY
     END-IF
     IF C-SPOOL-FILE-OPEN
        PERFORM 8000-WRITE-SUMMARY
     END-IF
* Soln 10-040510-5889 : start
     IF DISKCONVERTTO-PRESENT
      DISPLAY "WARNING: The Disk Count has not been scaled, only the Disk Busy Seconds"
      DISPLAY "have been scaled according to the DISKCONVERTTO Type."
      DISPLAY "  "
     END-IF
* Soln 10-040510-5889 : end
     PERFORM 8500-CHECK-OVERFLOW-VALUES
   END-IF.
     MOVE TERMINATION-INFO-D TO TERMINATION-INFO
     IF NOT ABEND-REQUIRED
*        Normal termination
         MOVE ZERO TO ABEND-OR-STOP, COMPLETION-CODE
     ELSE
*        Error termination
         MOVE 3 TO ABEND-OR-STOP, COMPLETION-CODE
     END-IF.
*------------MeasTCM Yosemite Change----Start-----------
     IF YOSEMITE-DATAFILE = "Y"
        MOVE CURRENTVERSION-YOSEMITE TO Z-VERSION OF STCM-VAL-SSID
     ELSE
        MOVE CURRENTVERSION TO Z-VERSION OF STCM-VAL-SSID
     END-IF.
*------------MeasTCM Yosemite Change-----End------------
     ENTER "COBOL85^COMPLETION" OF CBL85UTL
         USING     ABEND-OR-STOP,
                   COMPLETION-CODE,
                   TERMINATION-INFO,
                   STCM-VAL-SSID,
                   80,
                   TERMINATION-TEXT.
    EXIT PROGRAM.
*----------------------------------------------------------------------------
 7000-DISPLAY-SUMMARY.
      DISPLAY SPACE.
      DISPLAY RUN-SUM-HEADING.
      DISPLAY SPACE.
      DISPLAY RUN-SUM-HEADING-2.
      DISPLAY SPACE.
      PERFORM
         VARYING TEMP-INDEX FROM 1 BY 1
         UNTIL   RUN-MEAS-LINE-1(TEMP-INDEX) = SPACES OR
                 TEMP-INDEX > MEASURE-MAX
          DISPLAY RUN-MEAS-LINE-1(TEMP-INDEX)
          DISPLAY RUN-MEAS-LINE-2(TEMP-INDEX)
          PERFORM
             VARYING RUN-MEAS-MSG-INDX FROM 1 BY 1
             UNTIL RUN-MEAS-MSG-INDX > 7
             IF RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX) NOT = SPACE
                DISPLAY RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
             END-IF
          END-PERFORM
          DISPLAY SPACE
      END-PERFORM.
      DISPLAY RUN-MEAS-FILE-ADV.
      DISPLAY SPACE
      IF NOT C-EXIT-PROGRAM
         PERFORM 7010-SUMMARY-PART-2
      END-IF.
*----------------------------------------------------------------------------
 7010-SUMMARY-PART-2.
      DISPLAY RUN-SUM-CSV-HEAD.
      DISPLAY SPACE.
      DISPLAY RUN-SUM-CSV-LINE-1.
      DISPLAY RUN-SUM-CSV-LINE-2.
      DISPLAY RUN-SUM-CSV-LINE.
      DISPLAY SPACE.
      IF NOT C-EXIT-PROGRAM
         PERFORM 7020-SUMMARY-PART-3
      END-IF.
*----------------------------------------------------------------------------
 7020-SUMMARY-PART-3.
      DISPLAY RUN-SUM-OUTPUT-HEAD.
      DISPLAY RUN-SUM-OUTPUT-LINE-1.
      DISPLAY RUN-SUM-OUTPUT-LINE-2.
      DISPLAY RUN-SUM-OUTPUT-LINE-3.
      DISPLAY SPACE.
      PERFORM
        VARYING TEMP-INDEX FROM 1 BY 1
        UNTIL RUN-CSV-LINE-1(TEMP-INDEX) = SPACES
             OR TEMP-INDEX > NUM-CSVS-ACTUAL
          DISPLAY RUN-CSV-LINE-1(TEMP-INDEX)
          DISPLAY RUN-CSV-LINE-2(TEMP-INDEX)
          IF RUN-CSV-ADV(TEMP-INDEX) NOT = SPACES
             DISPLAY RUN-CSV-ADV(TEMP-INDEX)
          END-IF
          DISPLAY SPACE
      END-PERFORM.
*----------------------------------------------------------------------------
 8000-WRITE-SUMMARY.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING AFTER ADVANCING PAGE.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING-2
         AFTER ADVANCING 2 LINES.
      MOVE ALL "-" TO RUN-UND-1
                      RUN-UND-2.
      WRITE SPOOLER-FILE-RECORD FROM RUN-UND-1.
      MOVE 4 TO LINE-CNT.
      PERFORM 8005-MEAS-SUMMARY
          VARYING TEMP-INDEX FROM 1 BY 1
          UNTIL RUN-MEAS-LINE-1(TEMP-INDEX) = SPACES
             OR TEMP-INDEX > MEASURE-MAX.
      IF LINE-CNT > 56
         WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING
                      AFTER ADVANCING PAGE
          MOVE 1 TO LINE-CNT
      END-IF
      WRITE SPOOLER-FILE-RECORD FROM RUN-MEAS-FILE-ADV
         AFTER ADVANCING 2 LINES.
      WRITE SPOOLER-FILE-RECORD from RUN-SUM-HEADING-2
      IF C-EXIT-PROGRAM
         CLOSE SPOOLER-FILE
      ELSE
         PERFORM 8010-SUMMARY-PART-2
      END-IF.
*----------------------------------------------------------------------------
 8005-MEAS-SUMMARY.
      IF LINE-CNT > 47
         WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING
                  AFTER ADVANCING PAGE
         MOVE 1 TO LINE-CNT
      END-IF.
      WRITE SPOOLER-FILE-RECORD FROM RUN-MEAS-LINE-1(TEMP-INDEX)
         AFTER ADVANCING 2 LINES.
      ADD 2 TO LINE-CNT.
      WRITE SPOOLER-FILE-RECORD FROM RUN-MEAS-LINE-2(TEMP-INDEX).
      ADD 1 TO LINE-CNT.
      PERFORM
         VARYING RUN-MEAS-MSG-INDX FROM 1 BY 1
         UNTIL RUN-MEAS-MSG-INDX > 7
        IF RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX) NOT = SPACE
           WRITE SPOOLER-FILE-RECORD
              FROM RUN-MEAS-ADV(TEMP-INDEX, RUN-MEAS-MSG-INDX)
           ADD 1 TO LINE-CNT
        END-IF
      END-PERFORM.
*----------------------------------------------------------------------------
 8010-SUMMARY-PART-2.
      ADD 2 TO LINE-CNT.
      IF LINE-CNT > 50
          WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING
                      AFTER ADVANCING PAGE
          MOVE 1 TO LINE-CNT
      END-IF.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-CSV-HEAD AFTER ADVANCING 2 LINES.
      ADD 2 TO LINE-CNT.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-CSV-LINE-1.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-CSV-LINE-2.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-CSV-LINE.
      IF C-EXIT-PROGRAM
         CLOSE SPOOLER-FILE
      ELSE
         PERFORM 8020-SUMMARY-PART-3
      END-IF.
*----------------------------------------------------------------------------
 8020-SUMMARY-PART-3.
      ADD 3 TO LINE-CNT.
      IF LINE-CNT > 51
          WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING
                      AFTER ADVANCING PAGE
          MOVE 1 TO LINE-CNT
      END-IF.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-OUTPUT-HEAD
          AFTER ADVANCING 2 LINES.
      WRITE SPOOLER-FILE-RECORD FROM RUN-UND-2.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-OUTPUT-LINE-1
          AFTER ADVANCING 2 LINES.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-OUTPUT-LINE-2.
      WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-OUTPUT-LINE-3.
      ADD 7 TO LINE-CNT.
      PERFORM 8030-CSV-SUMMARY
          VARYING TEMP-INDEX FROM 1 BY 1
          UNTIL RUN-CSV-LINE-1(TEMP-INDEX) = SPACES
              OR TEMP-INDEX > NUM-CSVS-ACTUAL.
      MOVE SPACES TO SPOOLER-FILE-RECORD.
      WRITE SPOOLER-FILE-RECORD.
      PERFORM 8050-SPOOL-OVERFLOW-VALUES.
      CLOSE SPOOLER-FILE.
*----------------------------------------------------------------------------
 8030-CSV-SUMMARY.
      IF LINE-CNT > 53
         WRITE SPOOLER-FILE-RECORD FROM RUN-SUM-HEADING
                  AFTER ADVANCING PAGE
         MOVE 1 TO LINE-CNT
      END-IF.
      WRITE SPOOLER-FILE-RECORD FROM RUN-CSV-LINE-1(TEMP-INDEX)
           AFTER ADVANCING 2 LINES.
      ADD 2 TO LINE-CNT.
      WRITE SPOOLER-FILE-RECORD FROM RUN-CSV-LINE-2(TEMP-INDEX).
      ADD 1 TO LINE-CNT.
      IF RUN-CSV-ADV(TEMP-INDEX) NOT = SPACE
         WRITE SPOOLER-FILE-RECORD FROM RUN-CSV-ADV(TEMP-INDEX)
         ADD 1 TO LINE-CNT
      END-IF.
*----------------------------------------------------------------------------
 8050-SPOOL-OVERFLOW-VALUES.
*   NOTE:  No need to check CPU as this can not happen at this time.
    IF OVERFLOW-OCCURED
       MOVE "TERMINATION WARNING:" TO SPOOLER-FILE-RECORD
       WRITE SPOOLER-FILE-RECORD AFTER ADVANCING PAGE
       MOVE "--------------------" TO SPOOLER-FILE-RECORD
       WRITE SPOOLER-FILE-RECORD
    END-IF.
	
    IF PROCESS-OVERFLOW-COUNT > 0
       MOVE PROCESS-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-55  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       WRITE SPOOLER-FILE-RECORD FROM TERMINATION-TEXT
    END-IF.
	
    IF DISC-OVERFLOW-COUNT > 0
       MOVE DISC-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-53  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       WRITE SPOOLER-FILE-RECORD FROM TERMINATION-TEXT
    END-IF.
	
    IF DISCOPEN-OVERFLOW-COUNT > 0
       MOVE DISCOPEN-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-63  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       WRITE SPOOLER-FILE-RECORD FROM TERMINATION-TEXT
    END-IF.
*----------------------------------------------------------------------------


 
 
 
 
 
 
 
 
 8500-CHECK-OVERFLOW-VALUES.
*   NOTE:  No need to check CPU as this can not happen at this time.
    IF OVERFLOW-OCCURED
       DISPLAY SPACE
       DISPLAY "TERMINATION WARNING:"
       DISPLAY "--------------------"
    END-IF.
	
    IF PROCESS-OVERFLOW-COUNT > 0
       MOVE PROCESS-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-55  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       DISPLAY TERMINATION-TEXT
    END-IF.
	
    IF DISC-OVERFLOW-COUNT > 0
       MOVE DISC-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-53  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       DISPLAY TERMINATION-TEXT
    END-IF.
	
    IF DISCOPEN-OVERFLOW-COUNT > 0
       MOVE DISCOPEN-OVERFLOW-COUNT TO NUMBER-DISPLAY
       STRING COMPLETION-63  DELIMITED BY SIZE
              NUMBER-DISPLAY DELIMITED BY SIZE
              " TIMES."      DELIMITED BY SIZE
       INTO COMPLETION-MESSAGE
       DISPLAY TERMINATION-TEXT
    END-IF.
	
    IF OVERFLOW-OCCURED
       MOVE COMPLETION-87 TO COMPLETION-MESSAGE
       DISPLAY SPACE
    END-IF.
 END PROGRAM SPCOMPLETION.
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
*----------------------------------------------------------------------------
 END PROGRAM MEASTCM.
?ENDUNIT