*******************************************************************************
*
* Program: XCB53P0
*
* Purpose: This program has a main program with a nested "sub main" program,
*          a sub-program with two levels of nested sub-programs, and a
*          sub-program with no nested sub-programs.
*
?symbols
 identification division.
 program-id.  main-program.

 data division.
 working-storage section.

 01 MAIN-ALPHA-A              PIC A VALUE "a".
 01 MAIN-ALPHA-A26            PIC A(26) VALUE "abcdefghijklmnopqrstuvwxyz".

 01 MAIN-ALPHANUMERIC-A499    PIC A(4)99 VALUE "fred02".
 01 MAIN-ALPHANUMERIC-X37     PIC X(37) VALUE "abcdefghijklmnopqrstuvwxyz1234567890 ".

 01 MAIN-REC-01-L01.
   05 EDITEDNUMERIC-1         PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
   05 EDITEDNUMERIC-2         PIC $999 VALUE "$555".
   05 EDITEDNUMERIC-4         PIC 99/99/9999 VALUE "11/28/2005".
   05 EDITEDNUMERIC-6         PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
   05 EDITEDALPHA-2           PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
   05 EDITEDALPHA-3           PIC X0X0X0X0X0X VALUE "10203040506".

 01 MAIN-EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
 01 MAIN-EDITEDNUMERIC-2      PIC $999 VALUE "$555".
 01 MAIN-EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
 01 MAIN-EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
 01 MAIN-EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
 01 MAIN-EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 MAIN-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate VALUE -20.
 01 MAIN-BINARY-9             BINARY PIC 9 VALUE 5.
 01 MAIN-DEFAULT-S99          PIC S99 VALUE 17.
 01 MAIN-COMP-999V9           COMP PIC 999V9 VALUE 234.5.
 01 MAIN-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate VALUE -1.
 01 MAIN-COMP-9999            COMP PIC 9(4) VALUE 1234.
 01 MAIN-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate VALUE -129.

 01 MAIN-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate VALUE -19.
 01 MAIN-DISPLAY-MIN          PIC S9(16)V99 VALUE -9999999999999999.99.
 01 MAIN-DISPLAY-999PP        DISPLAY PIC 999PP VALUE 78900.
 01 MAIN-DISPLAY-S99-LE       DISPLAY PIC S99 Leading VALUE -99.
 01 MAIN-DISPLAY-S916V99      DISPLAY PIC S9(16)V99 VALUE -1234567890123456.78.
 01 MAIN-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate VALUE -1234.
 01 MAIN-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4) VALUE -7891.

 01 MAIN-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T           DISPLAY PIC S99 Trailing VALUE -16.
     10 DISPLAY-S9-LE           DISPLAY PIC S9 Leading VALUE 1.
     10 COMP-S9999              COMP PIC S9(4) VALUE -1234.
     10 COMPUTATIONAL-9999      COMPUTATIONAL PIC 9(4) VALUE 7891.
     10 DEFAULT-99              PIC 99 VALUE 22.
     10 DISPLAY-S9-TS           DISPLAY PIC S9 Trailing Separate VALUE -5.
     10 DISPLAY-S999-LENEG      DISPLAY PIC S9(3) Leading VALUE -999.
     10 DEFAULT-S99V9           PIC S99V9 VALUE 22.1.
     10 DISPLAY-MAX             PIC S9(16)V99 VALUE 9999999999999999.99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS      DISPLAY PIC S9(3) Leading VALUE 999.
       15 DISPLAY-S9              DISPLAY PIC S9 VALUE -1.
       15 DISPLAY-S99-LS          DISPLAY PIC S99 Leading Separate VALUE -19.
     10 DEFAULT-999V99          PIC 999V99 VALUE 123.45.
     10 COMP-9999PP             COMP PIC S999PP VALUE 71700.
     10 BINARY-S9               BINARY PIC S9 VALUE -5.
   05 COMP-99P                COMP PIC 99PP VALUE 220.
   05 COMP-S999V9             COMP PIC S999V9 VALUE -234.5.

 procedure division.
 begin-main-program.

    DISPLAY "Main-Program".

    DISPLAY MAIN-ALPHA-A.
    DISPLAY MAIN-ALPHA-A26.
    DISPLAY MAIN-ALPHANUMERIC-A499.
    DISPLAY MAIN-ALPHANUMERIC-X37.
    DISPLAY EDITEDNUMERIC-1 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-4 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-6 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-3 OF MAIN-REC-01-L01.

    PERFORM  main-program-tp-01.

    CALL nested-sub-main-program using BY REFERENCE MAIN-ALPHA-A,
                                       BY CONTENT MAIN-ALPHA-A26,
                                       BY REFERENCE MAIN-ALPHANUMERIC-A499,
                                       BY CONTENT MAIN-ALPHANUMERIC-X37,
                                       BY REFERENCE MAIN-REC-01-L01.

    DISPLAY MAIN-ALPHA-A.
    DISPLAY MAIN-ALPHA-A26.
    DISPLAY MAIN-ALPHANUMERIC-A499.
    DISPLAY MAIN-ALPHANUMERIC-X37.
    DISPLAY EDITEDNUMERIC-1 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-4 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-6 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-3 OF MAIN-REC-01-L01.

    PERFORM  main-program-tp-01.

    CALL nested-sub-main-program using BY CONTENT MAIN-ALPHA-A,
                                       BY REFERENCE MAIN-ALPHA-A26,
                                       BY CONTENT MAIN-ALPHANUMERIC-A499,
                                       BY REFERENCE MAIN-ALPHANUMERIC-X37,
                                       BY CONTENT MAIN-REC-01-L01.

    DISPLAY MAIN-ALPHA-A.
    DISPLAY MAIN-ALPHA-A26.
    DISPLAY MAIN-ALPHANUMERIC-A499.
    DISPLAY MAIN-ALPHANUMERIC-X37.
    DISPLAY EDITEDNUMERIC-1 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-4 OF MAIN-REC-01-L01.
    DISPLAY EDITEDNUMERIC-6 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-2 OF MAIN-REC-01-L01.
    DISPLAY EDITEDALPHA-3 OF MAIN-REC-01-L01.

    PERFORM  main-program-tp-01.

    DISPLAY MAIN-EDITEDNUMERIC-1.
    DISPLAY MAIN-EDITEDNUMERIC-2.
    DISPLAY MAIN-EDITEDNUMERIC-4.
    DISPLAY MAIN-EDITEDNUMERIC-6.
    DISPLAY MAIN-EDITEDALPHA-2.
    DISPLAY MAIN-EDITEDALPHA-3.

    PERFORM  main-program-tp-01.

    CALL sub-program-one using BY REFERENCE MAIN-EDITEDNUMERIC-1,
                               BY REFERENCE MAIN-EDITEDNUMERIC-2,
                               BY REFERENCE MAIN-EDITEDNUMERIC-4,
                               BY REFERENCE MAIN-EDITEDNUMERIC-6,
                               BY REFERENCE MAIN-EDITEDALPHA-2,
                               BY REFERENCE MAIN-EDITEDALPHA-3.

    DISPLAY MAIN-EDITEDNUMERIC-1.
    DISPLAY MAIN-EDITEDNUMERIC-2.
    DISPLAY MAIN-EDITEDNUMERIC-4.
    DISPLAY MAIN-EDITEDNUMERIC-6.
    DISPLAY MAIN-EDITEDALPHA-2.
    DISPLAY MAIN-EDITEDALPHA-3.

    PERFORM  main-program-tp-01.

    DISPLAY DISPLAY-S99-T OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-LE OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-S9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMPUTATIONAL-9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-TS OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LENEG OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-S99V9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-MAX OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-999V99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-9999PP OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY BINARY-S9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-99P OF MAIN-REC-02-L01.
    DISPLAY COMP-S999V9 OF MAIN-REC-02-L01.

    PERFORM  main-program-tp-01.

    CALL sub-program-two using BY CONTENT MAIN-REC-02-L01.

    DISPLAY DISPLAY-S99-T OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-LE OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-S9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMPUTATIONAL-9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-TS OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LENEG OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-S99V9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-MAX OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-999V99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-9999PP OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY BINARY-S9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-99P OF MAIN-REC-02-L01.
    DISPLAY COMP-S999V9 OF MAIN-REC-02-L01.

    PERFORM  main-program-tp-01.

    CALL sub-program-two using BY REFERENCE MAIN-REC-02-L01.

    DISPLAY DISPLAY-S99-T OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-LE OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-S9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMPUTATIONAL-9999 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9-TS OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LENEG OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-S99V9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-MAX OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY DEFAULT-999V99 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-9999PP OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY BINARY-S9 OF REC-02-L02 OF MAIN-REC-02-L01.
    DISPLAY COMP-99P OF MAIN-REC-02-L01.
    DISPLAY COMP-S999V9 OF MAIN-REC-02-L01.

    PERFORM  main-program-tp-01.

    STOP RUN.

 main-program-tp-01.

    DISPLAY "MAIN TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-main-program.

 data division.
 working-storage section.

 01 N-S-MAIN-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T        DISPLAY PIC S99 Trailing VALUE -16.
     10 DISPLAY-S9-LE        DISPLAY PIC S9 Leading VALUE 1.
     10 COMP-S9999           COMP PIC S9(4) VALUE -1234.
     10 COMPUTATIONAL-9999   COMPUTATIONAL PIC 9(4) VALUE 7891.
     10 DEFAULT-99           PIC 99 VALUE 22.
     10 DISPLAY-S9-TS        DISPLAY PIC S9 Trailing Separate VALUE -5.
     10 DISPLAY-S999-LENEG   DISPLAY PIC S9(3) Leading VALUE -999.
     10 DEFAULT-S99V9        PIC S99V9 VALUE 22.1.
     10 DISPLAY-MAX          PIC S9(16)V99 VALUE 9999999999999999.99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3) Leading VALUE 999.
       15 DISPLAY-S9           DISPLAY PIC S9 VALUE -1.
       15 DISPLAY-S99-LS       DISPLAY PIC S99 Leading Separate VALUE -19.
     10 DEFAULT-999V99       PIC 999V99 VALUE 123.45.
     10 COMP-9999PP          COMP PIC S999PP VALUE 71700.
     10 BINARY-S9            BINARY PIC S9 VALUE -5.
   05 COMP-99P             COMP PIC 99PP VALUE 220.
   05 COMP-S999V9          COMP PIC S999V9 VALUE -234.5.

 01 N-S-MAIN-EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
 01 N-S-MAIN-EDITEDNUMERIC-2      PIC $999 VALUE "$555".
 01 N-S-MAIN-EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
 01 N-S-MAIN-EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
 01 N-S-MAIN-EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
 01 N-S-MAIN-EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 N-S-MAIN-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate VALUE -20.
 01 N-S-MAIN-BINARY-9             BINARY PIC 9 VALUE 5.
 01 N-S-MAIN-DEFAULT-S99          PIC S99 VALUE 17.
 01 N-S-MAIN-COMP-999V9           COMP PIC 999V9 VALUE 234.5.
 01 N-S-MAIN-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate VALUE -1.
 01 N-S-MAIN-COMP-9999            COMP PIC 9(4) VALUE 1234.
 01 N-S-MAIN-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate VALUE -129.

 01 N-S-MAIN-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate VALUE -19.
 01 N-S-MAIN-DISPLAY-MIN          PIC S9(16)V99 VALUE -9999999999999999.99.
 01 N-S-MAIN-DISPLAY-999PP        DISPLAY PIC 999PP VALUE 78900.
 01 N-S-MAIN-DISPLAY-S99-LE       DISPLAY PIC S99 Leading VALUE -99.
 01 N-S-MAIN-DISPLAY-S916V99      DISPLAY PIC S9(16)V99 VALUE -1234567890123456.78.
 01 N-S-MAIN-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate VALUE -1234.
 01 N-S-MAIN-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4) VALUE -7891.

 linkage section.

 01 N-S-MAIN-ALPHA-A              PIC A.
 01 N-S-MAIN-ALPHA-A26            PIC A(26).

 01 N-S-MAIN-ALPHANUMERIC-A499    PIC A(4)99.
 01 N-S-MAIN-ALPHANUMERIC-X37     PIC X(37).

 01 N-S-MAIN-REC-01-L01.
   05 EDITEDNUMERIC-1             PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2             PIC $999.
   05 EDITEDNUMERIC-4             PIC 99/99/9999.
   05 EDITEDNUMERIC-6             PIC 9(3)B9(3)B9(4).
   05 EDITEDALPHA-2               PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3               PIC X0X0X0X0X0X.

 procedure division using N-S-MAIN-ALPHA-A,
                          N-S-MAIN-ALPHA-A26,
                          N-S-MAIN-ALPHANUMERIC-A499,
                          N-S-MAIN-ALPHANUMERIC-X37,
                          N-S-MAIN-REC-01-L01.

 begin-nested-sub-main-program.

   DISPLAY "Nested-Sub-Main-Program".

   DISPLAY N-S-MAIN-ALPHA-A.
   DISPLAY N-S-MAIN-ALPHA-A26.
   DISPLAY N-S-MAIN-ALPHANUMERIC-A499.
   DISPLAY N-S-MAIN-ALPHANUMERIC-X37.
   DISPLAY EDITEDNUMERIC-1 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDNUMERIC-2 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDNUMERIC-4 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDNUMERIC-6 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDALPHA-2 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDALPHA-3 OF N-S-MAIN-REC-01-L01.

   PERFORM nested-sub-main-tp-01.

   PERFORM nested-sub-main-set-data.

   DISPLAY N-S-MAIN-ALPHA-A.
   DISPLAY N-S-MAIN-ALPHA-A26.
   DISPLAY N-S-MAIN-ALPHANUMERIC-A499.
   DISPLAY N-S-MAIN-ALPHANUMERIC-X37.
   DISPLAY EDITEDNUMERIC-1 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-4 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDALPHA-2 OF N-S-MAIN-REC-01-L01.
   DISPLAY EDITEDALPHA-3.

   PERFORM nested-sub-main-tp-01.

   EXIT PROGRAM.

 nested-sub-main-set-data.

   MOVE "Z" TO N-S-MAIN-ALPHA-A.
   MOVE "aBcDeFgHiJkLmNoPqRsTuVwXyZ" TO N-S-MAIN-ALPHA-A26.
   MOVE "mary99" TO N-S-MAIN-ALPHANUMERIC-A499.
   MOVE "aBcDeFgHiJkLmNoPqRsTuVwXyZ3216548760 " TO N-S-MAIN-ALPHANUMERIC-X37.

   MOVE 1000.50 TO EDITEDNUMERIC-1 OF N-S-MAIN-REC-01-L01.
   MOVE 333 TO EDITEDNUMERIC-2 OF N-S-MAIN-REC-01-L01.
   MOVE 01302006 TO EDITEDNUMERIC-4 OF N-S-MAIN-REC-01-L01.
   MOVE 8005551234 TO EDITEDNUMERIC-6 OF N-S-MAIN-REC-01-L01.
   MOVE "321654" TO EDITEDALPHA-2 OF N-S-MAIN-REC-01-L01.
   MOVE "456123" TO EDITEDALPHA-3 OF N-S-MAIN-REC-01-L01.

 nested-sub-main-tp-01.

    DISPLAY "NESTED SUB-MAIN TEST POINT 01".

 end program nested-sub-main-program.
*****************************************************************************

 end program main-program.
******************************************************************************

 identification division.
 program-id.  sub-program-one.

 data division.
 working-storage section.

 01 S-P-ONE-ALPHA-A              PIC A VALUE "a".
 01 S-P-ONE-ALPHA-A26            PIC A(26) VALUE "abcdefghijklmnopqrstuvwxyz".

 01 S-P-ONE-ALPHANUMERIC-A499    PIC A(4)99 VALUE "fred02".
 01 S-P-ONE-ALPHANUMERIC-X37     PIC X(37) VALUE "abcdefghijklmnopqrstuvwxyz1234567890 ".

 01 S-P-ONE-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate VALUE -20.
 01 S-P-ONE-BINARY-9             BINARY PIC 9 VALUE 5.
 01 S-P-ONE-DEFAULT-S99          PIC S99 VALUE 17.
 01 S-P-ONE-COMP-999V9           COMP PIC 999V9 VALUE 234.5.
 01 S-P-ONE-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate VALUE -1.
 01 S-P-ONE-COMP-9999            COMP PIC 9(4) VALUE 1234.
 01 S-P-ONE-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate VALUE -129.

 01 S-P-ONE-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate VALUE -19.
 01 S-P-ONE-DISPLAY-MIN          PIC S9(16)V99 VALUE -9999999999999999.99.
 01 S-P-ONE-DISPLAY-999PP        DISPLAY PIC 999PP VALUE 78900.
 01 S-P-ONE-DISPLAY-S99-LE       DISPLAY PIC S99 Leading VALUE -99.
 01 S-P-ONE-DISPLAY-S916V99      DISPLAY PIC S9(16)V99 VALUE -1234567890123456.78.
 01 S-P-ONE-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate VALUE -1234.
 01 S-P-ONE-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4) VALUE -7891.

 01 S-P-ONE-REC-01-L01.
   05 EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
   05 EDITEDNUMERIC-2      PIC $999 VALUE "$555".
   05 EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
   05 EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
   05 EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
   05 EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 S-P-ONE-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T        DISPLAY PIC S99 Trailing VALUE -16.
     10 DISPLAY-S9-LE        DISPLAY PIC S9 Leading VALUE 1.
     10 COMP-S9999           COMP PIC S9(4) VALUE -1234.
     10 COMPUTATIONAL-9999   COMPUTATIONAL PIC 9(4) VALUE 7891.
     10 DEFAULT-99           PIC 99 VALUE 22.
     10 DISPLAY-S9-TS        DISPLAY PIC S9 Trailing Separate VALUE -5.
     10 DISPLAY-S999-LENEG   DISPLAY PIC S9(3) Leading VALUE -999.
     10 DEFAULT-S99V9        PIC S99V9 VALUE 22.1.
     10 DISPLAY-MAX          PIC S9(16)V99 VALUE 9999999999999999.99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3) Leading VALUE 999.
       15 DISPLAY-S9           DISPLAY PIC S9 VALUE -1.
       15 DISPLAY-S99-LS       DISPLAY PIC S99 Leading Separate VALUE -19.
     10 DEFAULT-999V99       PIC 999V99 VALUE 123.45.
     10 COMP-9999PP          COMP PIC S999PP VALUE 71700.
     10 BINARY-S9            BINARY PIC S9 VALUE -5.
   05 COMP-99P             COMP PIC 99PP VALUE 220.
   05 COMP-S999V9          COMP PIC S999V9 VALUE -234.5.

 linkage section.

 01 S-P-ONE-EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99.
 01 S-P-ONE-EDITEDNUMERIC-2      PIC $999.
 01 S-P-ONE-EDITEDNUMERIC-4      PIC 99/99/9999.
 01 S-P-ONE-EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4).
 01 S-P-ONE-EDITEDALPHA-2        PIC XBXBXBXBXBX.
 01 S-P-ONE-EDITEDALPHA-3        PIC X0X0X0X0X0X.

 procedure division using  S-P-ONE-EDITEDNUMERIC-1,
                           S-P-ONE-EDITEDNUMERIC-2,
                           S-P-ONE-EDITEDNUMERIC-4,
                           S-P-ONE-EDITEDNUMERIC-6,
                           S-P-ONE-EDITEDALPHA-2,
                           S-P-ONE-EDITEDALPHA-3.

 begin-sub-program-one.

   DISPLAY "Sub-Program-One".

   DISPLAY S-P-ONE-EDITEDNUMERIC-1.
   DISPLAY S-P-ONE-EDITEDNUMERIC-2.
   DISPLAY S-P-ONE-EDITEDNUMERIC-4.
   DISPLAY S-P-ONE-EDITEDNUMERIC-6.
   DISPLAY S-P-ONE-EDITEDALPHA-2.
   DISPLAY S-P-ONE-EDITEDALPHA-3.

   PERFORM sub-program-one-tp-01.

   DISPLAY S-P-ONE-DISPLAY-S9999-TS.
   DISPLAY S-P-ONE-BINARY-9.
   DISPLAY S-P-ONE-DEFAULT-S99.
   DISPLAY S-P-ONE-COMP-999V9.
   DISPLAY S-P-ONE-DISPLAY-S9-LS.
   DISPLAY S-P-ONE-COMP-9999.
   DISPLAY S-P-ONE-DISPLAY-S999-LS.

   PERFORM sub-program-one-tp-01.

   CALL nested-sub-program-levelOne using BY REFERENCE S-P-ONE-DISPLAY-S9999-TS,
                                          BY CONTENT S-P-ONE-BINARY-9,
                                          BY REFERENCE S-P-ONE-DEFAULT-S99,
                                          BY CONTENT S-P-ONE-COMP-999V9,
                                          BY REFERENCE S-P-ONE-DISPLAY-S9-LS,
                                          BY CONTENT S-P-ONE-COMP-9999,
                                          BY REFERENCE S-P-ONE-DISPLAY-S999-LS.

   DISPLAY S-P-ONE-DISPLAY-S9999-TS.
   DISPLAY S-P-ONE-BINARY-9.
   DISPLAY S-P-ONE-DEFAULT-S99.
   DISPLAY S-P-ONE-COMP-999V9.
   DISPLAY S-P-ONE-DISPLAY-S9-LS.
   DISPLAY S-P-ONE-COMP-9999.
   DISPLAY S-P-ONE-DISPLAY-S999-LS.

   PERFORM sub-program-one-tp-01.

   PERFORM sub-program-one-set-data.

   DISPLAY S-P-ONE-EDITEDNUMERIC-1.
   DISPLAY S-P-ONE-EDITEDNUMERIC-2.
   DISPLAY S-P-ONE-EDITEDNUMERIC-4.
   DISPLAY S-P-ONE-EDITEDNUMERIC-6.
   DISPLAY S-P-ONE-EDITEDALPHA-2.
   DISPLAY S-P-ONE-EDITEDALPHA-3.

   PERFORM sub-program-one-tp-01.

   EXIT PROGRAM.

 sub-program-one-set-data.

   MOVE 5000000.10 TO S-P-ONE-EDITEDNUMERIC-1.
   MOVE 111 TO S-P-ONE-EDITEDNUMERIC-2.
   MOVE 07161985 TO S-P-ONE-EDITEDNUMERIC-4.
   MOVE 4087672676 TO S-P-ONE-EDITEDNUMERIC-6.
   MOVE "654321" TO S-P-ONE-EDITEDALPHA-2.
   MOVE "654321" TO S-P-ONE-EDITEDALPHA-3.

 sub-program-one-tp-01.

    DISPLAY "SUB-PROGRAM ONE TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-program-levelOne.

 data division.
 working-storage section.

 01 N-S-P-ONE-ALPHA-A              PIC A VALUE "a".
 01 N-S-P-ONE-ALPHA-A26            PIC A(26) VALUE "abcdefghijklmnopqrstuvwxyz".

 01 N-S-P-ONE-ALPHANUMERIC-A499    PIC A(4)99 VALUE "fred02".
 01 N-S-P-ONE-ALPHANUMERIC-X37     PIC X(37) VALUE "abcdefghijklmnopqrstuvwxyz1234567890 ".

 01 N-S-P-ONE-REC-01-L01.
   05 EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
   05 EDITEDNUMERIC-2      PIC $999 VALUE "$555".
   05 EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
   05 EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
   05 EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
   05 EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 N-S-P-ONE-EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
 01 N-S-P-ONE-EDITEDNUMERIC-2 PIC $999 VALUE "$555".
 01 N-S-P-ONE-EDITEDNUMERIC-4 PIC 99/99/9999 VALUE "11/28/2005".
 01 N-S-P-ONE-EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
 01 N-S-P-ONE-EDITEDALPHA-2   PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
 01 N-S-P-ONE-EDITEDALPHA-3   PIC X0X0X0X0X0X VALUE "10203040506".

 01 N-S-P-ONE-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate VALUE -19.
 01 N-S-P-ONE-DISPLAY-MIN          PIC S9(16)V99 VALUE -9999999999999999.99.
 01 N-S-P-ONE-DISPLAY-999PP        DISPLAY PIC 999PP VALUE 78900.
 01 N-S-P-ONE-DISPLAY-S99-LE       DISPLAY PIC S99 Leading VALUE -99.
 01 N-S-P-ONE-DISPLAY-S916V99      DISPLAY PIC S9(16)V99 VALUE -1234567890123456.78.
 01 N-S-P-ONE-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate VALUE -1234.
 01 N-S-P-ONE-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4) VALUE -7891.

 01 N-S-P-ONE-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T        DISPLAY PIC S99 Trailing VALUE -16.
     10 DISPLAY-S9-LE        DISPLAY PIC S9 Leading VALUE 1.
     10 COMP-S9999           COMP PIC S9(4) VALUE -1234.
     10 COMPUTATIONAL-9999   COMPUTATIONAL PIC 9(4) VALUE 7891.
     10 DEFAULT-99           PIC 99 VALUE 22.
     10 DISPLAY-S9-TS        DISPLAY PIC S9 Trailing Separate VALUE -5.
     10 DISPLAY-S999-LENEG   DISPLAY PIC S9(3) Leading VALUE -999.
     10 DEFAULT-S99V9        PIC S99V9 VALUE 22.1.
     10 DISPLAY-MAX          PIC S9(16)V99 VALUE 9999999999999999.99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3) Leading VALUE 999.
       15 DISPLAY-S9           DISPLAY PIC S9 VALUE -1.
       15 DISPLAY-S99-LS       DISPLAY PIC S99 Leading Separate VALUE -19.
     10 DEFAULT-999V99       PIC 999V99 VALUE 123.45.
     10 COMP-9999PP          COMP PIC S999PP VALUE 71700.
     10 BINARY-S9            BINARY PIC S9 VALUE -5.
   05 COMP-99P             COMP PIC 99PP VALUE 220.
   05 COMP-S999V9          COMP PIC S999V9 VALUE -234.5.

 linkage section.

 01 N-S-P-ONE-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
 01 N-S-P-ONE-BINARY-9             BINARY PIC 9.
 01 N-S-P-ONE-DEFAULT-S99          PIC S99.
 01 N-S-P-ONE-COMP-999V9           COMP PIC 999V9.
 01 N-S-P-ONE-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate.
 01 N-S-P-ONE-COMP-9999            COMP PIC 9(4).
 01 N-S-P-ONE-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate.

 procedure division using N-S-P-ONE-DISPLAY-S9999-TS,
                          N-S-P-ONE-BINARY-9,
                          N-S-P-ONE-DEFAULT-S99,
                          N-S-P-ONE-COMP-999V9,
                          N-S-P-ONE-DISPLAY-S9-LS,
                          N-S-P-ONE-COMP-9999,
                          N-S-P-ONE-DISPLAY-S999-LS.

 begin-nested-sub-levelOne.

   DISPLAY "Nested-Sub-Program-LevelOne".

   DISPLAY N-S-P-ONE-DISPLAY-S9999-TS.
   DISPLAY N-S-P-ONE-BINARY-9.
   DISPLAY N-S-P-ONE-DEFAULT-S99.
   DISPLAY N-S-P-ONE-COMP-999V9.
   DISPLAY N-S-P-ONE-DISPLAY-S9-LS.
   DISPLAY N-S-P-ONE-COMP-9999.
   DISPLAY N-S-P-ONE-DISPLAY-S999-LS.

   PERFORM nested-levelOne-tp-01.

   DISPLAY N-S-P-ONE-DISPLAY-S999-TS.
   DISPLAY N-S-P-ONE-DISPLAY-MIN.
   DISPLAY N-S-P-ONE-DISPLAY-999PP.
   DISPLAY N-S-P-ONE-DISPLAY-S99-LE.
   DISPLAY N-S-P-ONE-DISPLAY-S916V99.
   DISPLAY N-S-P-ONE-DISPLAY-S9999-LS.
   DISPLAY N-S-P-ONE-COMPUTATIONAL-S9999.

   PERFORM nested-levelOne-tp-01.

   CALL nested-sub-program-levelTwo using BY REFERENCE N-S-P-ONE-DISPLAY-S999-TS,
                                          BY REFERENCE N-S-P-ONE-DISPLAY-MIN,
                                          BY REFERENCE N-S-P-ONE-DISPLAY-999PP,
                                          BY REFERENCE N-S-P-ONE-DISPLAY-S99-LE,
                                          BY CONTENT N-S-P-ONE-DISPLAY-S916V99,
                                          BY CONTENT N-S-P-ONE-DISPLAY-S9999-LS,
                                          BY CONTENT N-S-P-ONE-COMPUTATIONAL-S9999.

   DISPLAY N-S-P-ONE-DISPLAY-S999-TS.
   DISPLAY N-S-P-ONE-DISPLAY-MIN.
   DISPLAY N-S-P-ONE-DISPLAY-999PP.
   DISPLAY N-S-P-ONE-DISPLAY-S99-LE.
   DISPLAY N-S-P-ONE-DISPLAY-S916V99.
   DISPLAY N-S-P-ONE-DISPLAY-S9999-LS.
   DISPLAY N-S-P-ONE-COMPUTATIONAL-S9999.

   PERFORM nested-levelOne-tp-01.

   PERFORM nested-levelOne-set-data.

   DISPLAY N-S-P-ONE-DISPLAY-S9999-TS.
   DISPLAY N-S-P-ONE-BINARY-9.
   DISPLAY N-S-P-ONE-DEFAULT-S99.
   DISPLAY N-S-P-ONE-COMP-999V9.
   DISPLAY N-S-P-ONE-DISPLAY-S9-LS.
   DISPLAY N-S-P-ONE-COMP-9999.
   DISPLAY N-S-P-ONE-DISPLAY-S999-LS.

   PERFORM nested-levelOne-tp-01.

   EXIT PROGRAM.

 nested-levelOne-set-data.

   MOVE -40 TO N-S-P-ONE-DISPLAY-S9999-TS.
   MOVE 7 TO N-S-P-ONE-BINARY-9.
   MOVE -17 TO N-S-P-ONE-DEFAULT-S99.
   MOVE 543.2 TO N-S-P-ONE-COMP-999V9.
   MOVE -6 TO N-S-P-ONE-DISPLAY-S9-LS.
   MOVE 4321 TO N-S-P-ONE-COMP-9999.
   MOVE -921 TO N-S-P-ONE-DISPLAY-S999-LS.

 nested-levelOne-tp-01.

    DISPLAY "NESTED SUB-PROGRAM LEVEL ONE TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-program-levelTwo.

 data division.
 working-storage section.

 01 N-S-P-TWO-ALPHA-A              PIC A VALUE "a".
 01 N-S-P-TWO-ALPHA-A26            PIC A(26) VALUE "abcdefghijklmnopqrstuvwxyz".

 01 N-S-P-TWO-ALPHANUMERIC-A499    PIC A(4)99 VALUE "fred02".
 01 N-S-P-TWO-ALPHANUMERIC-X37     PIC X(37) VALUE "abcdefghijklmnopqrstuvwxyz1234567890 ".

 01 N-S-P-TWO-REC-01-L01.
   05 EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
   05 EDITEDNUMERIC-2      PIC $999 VALUE "$555".
   05 EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
   05 EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
   05 EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
   05 EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 N-S-P-TWO-EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
 01 N-S-P-TWO-EDITEDNUMERIC-2      PIC $999 VALUE "$555".
 01 N-S-P-TWO-EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
 01 N-S-P-TWO-EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
 01 N-S-P-TWO-EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
 01 N-S-P-TWO-EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 N-S-P-TWO-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate VALUE -20.
 01 N-S-P-TWO-BINARY-9             BINARY PIC 9 VALUE 5.
 01 N-S-P-TWO-DEFAULT-S99          PIC S99 VALUE 17.
 01 N-S-P-TWO-COMP-999V9           COMP PIC 999V9 VALUE 234.5.
 01 N-S-P-TWO-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate VALUE -1.
 01 N-S-P-TWO-COMP-9999            COMP PIC 9(4) VALUE 1234.
 01 N-S-P-TWO-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate VALUE -129.

 01 N-S-P-TWO-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T        DISPLAY PIC S99 Trailing VALUE -16.
     10 DISPLAY-S9-LE        DISPLAY PIC S9 Leading VALUE 1.
     10 COMP-S9999           COMP PIC S9(4) VALUE -1234.
     10 COMPUTATIONAL-9999   COMPUTATIONAL PIC 9(4) VALUE 7891.
     10 DEFAULT-99           PIC 99 VALUE 22.
     10 DISPLAY-S9-TS        DISPLAY PIC S9 Trailing Separate VALUE -5.
     10 DISPLAY-S999-LENEG   DISPLAY PIC S9(3) Leading VALUE -999.
     10 DEFAULT-S99V9        PIC S99V9 VALUE 22.1.
     10 DISPLAY-MAX          PIC S9(16)V99 VALUE 9999999999999999.99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3) Leading VALUE 999.
       15 DISPLAY-S9           DISPLAY PIC S9 VALUE -1.
       15 DISPLAY-S99-LS       DISPLAY PIC S99 Leading Separate VALUE -19.
     10 DEFAULT-999V99       PIC 999V99 VALUE 123.45.
     10 COMP-9999PP          COMP PIC S999PP VALUE 71700.
     10 BINARY-S9            BINARY PIC S9 VALUE -5.
   05 COMP-99P             COMP PIC 99PP VALUE 220.
   05 COMP-S999V9          COMP PIC S999V9 VALUE -234.5.

 linkage section.

 01 N-S-P-TWO-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate.
 01 N-S-P-TWO-DISPLAY-MIN          PIC S9(16)V99.
 01 N-S-P-TWO-DISPLAY-999PP        DISPLAY PIC 999PP.
 01 N-S-P-TWO-DISPLAY-S99-LE       DISPLAY PIC S99 Leading.
 01 N-S-P-TWO-DISPLAY-S916V99      DISPLAY PIC S9(16)V99.
 01 N-S-P-TWO-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate.
 01 N-S-P-TWO-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

  procedure division using N-S-P-TWO-DISPLAY-S999-TS,
                           N-S-P-TWO-DISPLAY-MIN,
                           N-S-P-TWO-DISPLAY-999PP,
                           N-S-P-TWO-DISPLAY-S99-LE,
                           N-S-P-TWO-DISPLAY-S916V99,
                           N-S-P-TWO-DISPLAY-S9999-LS,
                           N-S-P-TWO-COMPUTATIONAL-S9999.

 begin-nested-sub-levelTwo.

   DISPLAY "Nested-Sub-Program-LevelTwo".

   DISPLAY N-S-P-TWO-DISPLAY-S999-TS.
   DISPLAY N-S-P-TWO-DISPLAY-MIN.
   DISPLAY N-S-P-TWO-DISPLAY-999PP.
   DISPLAY N-S-P-TWO-DISPLAY-S99-LE.
   DISPLAY N-S-P-TWO-DISPLAY-S916V99.
   DISPLAY N-S-P-TWO-DISPLAY-S9999-LS.
   DISPLAY N-S-P-TWO-COMPUTATIONAL-S9999.

   PERFORM nested-levelTwo-tp-01.

   PERFORM nested-levelTwo-set-data.

   DISPLAY N-S-P-TWO-DISPLAY-S999-TS.
   DISPLAY N-S-P-TWO-DISPLAY-MIN.
   DISPLAY N-S-P-TWO-DISPLAY-999PP.
   DISPLAY N-S-P-TWO-DISPLAY-S99-LE.
   DISPLAY N-S-P-TWO-DISPLAY-S916V99.
   DISPLAY N-S-P-TWO-DISPLAY-S9999-LS.
   DISPLAY N-S-P-TWO-COMPUTATIONAL-S9999.

   PERFORM nested-levelTwo-tp-01.

   EXIT PROGRAM.

 nested-levelTwo-set-data.

   MOVE 91 TO N-S-P-TWO-DISPLAY-S999-TS.
   MOVE -1111111111111111.11 TO N-S-P-TWO-DISPLAY-MIN.
   MOVE 98700 TO N-S-P-TWO-DISPLAY-999PP.
   MOVE -88 TO N-S-P-TWO-DISPLAY-S99-LE.
   MOVE +8765432109876543.21 TO N-S-P-TWO-DISPLAY-S916V99.
   MOVE -4321 TO N-S-P-TWO-DISPLAY-S9999-LS.
   MOVE +1987 TO N-S-P-TWO-COMPUTATIONAL-S9999.

 nested-levelTwo-tp-01.

    DISPLAY "NESTED SUB-PROGRAM LEVEL TWO TEST POINT 01".

 end program nested-sub-program-levelTwo.
*****************************************************************************

 end program nested-sub-program-levelOne.
*****************************************************************************

 end program sub-program-one.
*****************************************************************************

 identification division.
 program-id.  sub-program-two.

 data division.
 working-storage section.

 01 S-P-TWO-ALPHA-A              PIC A VALUE "a".
 01 S-P-TWO-ALPHA-A26            PIC A(26) VALUE "abcdefghijklmnopqrstuvwxyz".

 01 S-P-TWO-ALPHANUMERIC-A499    PIC A(4)99 VALUE "fred02".
 01 S-P-TWO-ALPHANUMERIC-X37     PIC X(37) VALUE "abcdefghijklmnopqrstuvwxyz1234567890 ".

 01 S-P-TWO-REC-01-L01.
   05 EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
   05 EDITEDNUMERIC-2      PIC $999 VALUE "$555".
   05 EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
   05 EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
   05 EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
   05 EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 S-P-TWO-EDITEDNUMERIC-1      PIC ZZZ,ZZZ,ZZZ.99 VALUE "  1,000,000.50".
 01 S-P-TWO-EDITEDNUMERIC-2      PIC $999 VALUE "$555".
 01 S-P-TWO-EDITEDNUMERIC-4      PIC 99/99/9999 VALUE "11/28/2005".
 01 S-P-TWO-EDITEDNUMERIC-6      PIC 9(3)B9(3)B9(4) VALUE "408 285 5000".
 01 S-P-TWO-EDITEDALPHA-2        PIC XBXBXBXBXBX VALUE "1 2 3 4 5 6".
 01 S-P-TWO-EDITEDALPHA-3        PIC X0X0X0X0X0X VALUE "10203040506".

 01 S-P-TWO-DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate VALUE -20.
 01 S-P-TWO-BINARY-9             BINARY PIC 9 VALUE 5.
 01 S-P-TWO-DEFAULT-S99          PIC S99 VALUE 17.
 01 S-P-TWO-COMP-999V9           COMP PIC 999V9 VALUE 234.5.
 01 S-P-TWO-DISPLAY-S9-LS        DISPLAY PIC S9 Leading Separate VALUE -1.
 01 S-P-TWO-COMP-9999            COMP PIC 9(4) VALUE 1234.
 01 S-P-TWO-DISPLAY-S999-LS      DISPLAY PIC S9(3) Leading Separate VALUE -129.

 01 S-P-TWO-DISPLAY-S999-TS      DISPLAY PIC S9(3) Trailing Separate VALUE -19.
 01 S-P-TWO-DISPLAY-MIN          PIC S9(16)V99 VALUE -9999999999999999.99.
 01 S-P-TWO-DISPLAY-999PP        DISPLAY PIC 999PP VALUE 78900.
 01 S-P-TWO-DISPLAY-S99-LE       DISPLAY PIC S99 Leading VALUE -99.
 01 S-P-TWO-DISPLAY-S916V99      DISPLAY PIC S9(16)V99 VALUE -1234567890123456.78.
 01 S-P-TWO-DISPLAY-S9999-LS     DISPLAY PIC S9(4) Leading Separate VALUE -1234.
 01 S-P-TWO-COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4) VALUE -7891.

 linkage section.

 01 S-P-TWO-REC-02-L01.
   05 REC-02-L02.
     10 DISPLAY-S99-T        DISPLAY PIC S99 Trailing.
     10 DISPLAY-S9-LE        DISPLAY PIC S9 Leading.
     10 COMP-S9999           COMP PIC S9(4).
     10 COMPUTATIONAL-9999   COMPUTATIONAL PIC 9(4).
     10 DEFAULT-99           PIC 99.
     10 DISPLAY-S9-TS        DISPLAY PIC S9 Trailing Separate.
     10 DISPLAY-S999-LENEG   DISPLAY PIC S9(3) Leading.
     10 DEFAULT-S99V9        PIC S99V9.
     10 DISPLAY-MAX          PIC S9(16)V99.
     10 REC-02-L03.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3) Leading.
       15 DISPLAY-S9           DISPLAY PIC S9.
       15 DISPLAY-S99-LS       DISPLAY PIC S99 Leading Separate.
     10 DEFAULT-999V99       PIC 999V99.
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMP-S999V9          COMP PIC S999V9.

 procedure division using S-P-TWO-REC-02-L01.

 begin-sub-program-two.

   DISPLAY "Sub-Program-Two".

   DISPLAY DISPLAY-S99-T OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9-LE OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMPUTATIONAL-9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9-TS OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S999-LENEG OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-S99V9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-MAX OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-999V99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-99P OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-S999V9 OF S-P-TWO-REC-02-L01.

   PERFORM sub-program-two-tp-01.

   PERFORM sub-program-two-set-data.

   DISPLAY DISPLAY-S99-T OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9-LE OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMPUTATIONAL-9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9-TS OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S999-LENEG OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-S99V9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-MAX OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY DEFAULT-999V99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-99P OF S-P-TWO-REC-02-L01.
   DISPLAY COMP-S999V9 OF S-P-TWO-REC-02-L01.

   PERFORM sub-program-two-tp-01.

   EXIT PROGRAM.

 sub-program-two-set-data.

   MOVE -61 TO DISPLAY-S99-T OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 5 TO DISPLAY-S9-LE OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -4321 TO COMP-S9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 1987 TO COMPUTATIONAL-9999 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 44 TO DEFAULT-99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -9 TO DISPLAY-S9-TS OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -777 TO DISPLAY-S999-LENEG OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -11.2 TO DEFAULT-S99V9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 8888888888888888.88 TO DISPLAY-MAX OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 222 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 3 TO DISPLAY-S9 OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -91 TO DISPLAY-S99-LS OF REC-02-L03 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 543.21 TO DEFAULT-999V99 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 17100 TO COMP-9999PP OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE -8 TO BINARY-S9 OF REC-02-L02 OF S-P-TWO-REC-02-L01.
   MOVE 330 TO COMP-99P OF S-P-TWO-REC-02-L01.
   MOVE -543.2 TO COMP-S999V9 OF S-P-TWO-REC-02-L01.

 sub-program-two-tp-01.

    DISPLAY "SUB-PROGRAM TWO TEST POINT 01".

 end program sub-program-two.
*****************************************************************************
