IDENTIFICATION DIVISION.
 PROGRAM-ID.
      SUB-PRO
-GRAM-
-UNIT-12.  

 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION.

 SOURCE-COMPUTER.
      TANDEM NONSTOP.

 OBJECT-COMPUTER.
      TANDEM NONSTOP.

 INPUT-OUTPUT SECTION.
 
 PROCEDURE DIVISION.
  
 end program SUB-PROGRAM-UNIT-12. 
 
 IDENTIFICATION DIVISION.
 PROGRAM-ID.
      UNIT3.  

 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION.

 SOURCE-COMPUTER.
      TANDEM NONSTOP.

 OBJECT-COMPUTER.
      TANDEM NONSTOP.

 INPUT-OUTPUT SECTION.
 
 PROCEDURE DIVISION.
  CALL SUB-PROGRAM-UNIT-12.
 end program UNIT3.