IDENTIFICATION DIVISION.
 PROGRAM-ID.
      UNIT1.  

 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION.

 SOURCE-COMPUTER.
      TANDEM NONSTOP.

 OBJECT-COMPUTER.
      TANDEM NONSTOP.

 INPUT-OUTPUT SECTION.
 
 PROCEDURE DIVISION. 
  CALL SUB-PROGRAM-UNIT-12.  
 end program UNIT1. 
  