?symbols,inspect,env common
 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXAMPLE.

 ENVIRONMENT DIVISION.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 FILE-STATUSES.
  05 RECEIVE-FILE-STATUS-fails.
   88 RECEIVE-FILE-OK-fails VALUE IS "00".
   10 R-STAT-1 PIC X.
   10 R-STAT-2 PIC X.
  05 RECEIVE-FILE-STATUS-works PIC XX.
   88 RECEIVE-FILE-OK-works VALUE IS "00".

 PROCEDURE DIVISION.
 MAIN SECTION.
  SET RECEIVE-FILE-OK-fails TO TRUE.
  SET RECEIVE-FILE-OK-works TO TRUE.
  DISPLAY RECEIVE-FILE-STATUS-fails.
  DISPLAY RECEIVE-FILE-STATUS-works.
  STOP RUN.
