*******************************************************************************
*
* Program: XCB52P0
*
* Purpose: This program has a main program with a nested "sub main" program,
*          a sub-program with two levels of nested sub-programs, and a
*          sub-program with no nested sub-programs.  The program units have
*          a set of EXTERNAL data items that they share.  Some of the
*          EXTERNAL data items are grouped into a record strcuture at
*          different levels.
*
?symbols
 identification division.
 program-id.  main-program.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 01 param-item-00 native-4 value 2.

 procedure division.
 begin-main-program.

    DISPLAY "MAIN: ENTER".

    PERFORM  main-program-set-data.

    PERFORM  main-program-tp-01.

    PERFORM  main-program-display-data.

    DISPLAY "MAIN: Calling NESTED-SUB-MAIN-PROGRAM".
    CALL nested-sub-main-program using param-item-00.
    DISPLAY "MAIN: Returned from NESTED-SUB-MAIN-PROGRAM".

    PERFORM  main-program-tp-01.

    PERFORM  main-program-display-data.

    DISPLAY "MAIN: Calling SUB-PROGRAM-ONE".
    CALL sub-program-one using param-item-00.
    DISPLAY "MAIN: Returned from SUB-PROGRAM-ONE".

    PERFORM  main-program-tp-01.

    PERFORM  main-program-display-data.

    DISPLAY "MAIN: Calling SUB-PROGRAM-TWO".
    CALL sub-program-two using param-item-00.
    DISPLAY "MAIN: Returned from SUB-PROGRAM-TWO".

    PERFORM  main-program-tp-01.

    PERFORM  main-program-display-data.

    DISPLAY "MAIN: EXIT".

    STOP RUN.

 main-program-set-data.

    MOVE "a" TO ALPHA-A.
    MOVE "abcdefghijklmnopqrstuvwxyz" TO ALPHA-A26.
    MOVE "fred02" TO ALPHANUMERIC-A499.
    MOVE "X" TO ALPHANUMERIC-X.
    MOVE "abcdefghijklmnopqrstuvwxyz1234567890 " TO ALPHANUMERIC-X37.

    MOVE 1000000.50 TO EDITEDNUMERIC-1.
    MOVE 555 TO EDITEDNUMERIC-2.
    MOVE 294 TO EDITEDNUMERIC-3.
    MOVE 11282005 TO EDITEDNUMERIC-4.
    MOVE 00123 TO EDITEDNUMERIC-5.
    MOVE 4082855000 TO EDITEDNUMERIC-6.
    MOVE +12300.01 TO EDITEDNUMERIC-7.
    MOVE -12300.01 TO EDITEDNUMERIC-8.
    MOVE "11282005" TO EDITEDALPHA-1.
    MOVE "123456" TO EDITEDALPHA-2.
    MOVE "123456" TO EDITEDALPHA-3.

    MOVE -20 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
    MOVE -1234 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
    MOVE 78900 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
    MOVE 999 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
    MOVE 71700 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
    MOVE -5 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
    MOVE 220 TO COMP-99P OF REC-02-L01.
    MOVE -7891 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 main-program-display-data.

    DISPLAY ALPHA-A.
    DISPLAY ALPHA-A26.
    DISPLAY ALPHANUMERIC-A499.
    DISPLAY ALPHANUMERIC-X.
    DISPLAY ALPHANUMERIC-X37.

    DISPLAY EDITEDNUMERIC-1.
    DISPLAY EDITEDNUMERIC-2.
    DISPLAY EDITEDNUMERIC-3.
    DISPLAY EDITEDNUMERIC-4.
    DISPLAY EDITEDNUMERIC-5.
    DISPLAY EDITEDNUMERIC-6.
    DISPLAY EDITEDNUMERIC-7.
    DISPLAY EDITEDNUMERIC-8.
    DISPLAY EDITEDALPHA-1.
    DISPLAY EDITEDALPHA-2.
    DISPLAY EDITEDALPHA-3.

    DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
    DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
    DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
    DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
    DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
    DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
    DISPLAY COMP-99P OF REC-02-L01.
    DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 main-program-tp-01.

    DISPLAY "MAIN TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-main-program.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 linkage section.
 01 param-item-01 native-4.

 procedure division using param-item-01.
 begin-nested-sub-main-program.

   DISPLAY "NESTED-SUB-MAIN-PROGRAM: ENTER".

   PERFORM nested-sub-main-set-data.

   PERFORM nested-sub-main-tp-01.

   PERFORM nested-sub-main-display-data.

   DISPLAY "NESTED-SUB-MAIN-PROGRAM: EXIT".

   EXIT PROGRAM.

 nested-sub-main-set-data.

   MOVE "Z" TO ALPHA-A.
   MOVE "aBcDeFgHiJkLmNoPqRsTuVwXyZ" TO ALPHA-A26.
   MOVE "mary99" TO ALPHANUMERIC-A499.
   MOVE "3" TO ALPHANUMERIC-X.
   MOVE "aBcDeFgHiJkLmNoPqRsTuVwXyZ3216548760 " TO ALPHANUMERIC-X37.

   MOVE 1000.50 TO EDITEDNUMERIC-1.
   MOVE 333 TO EDITEDNUMERIC-2.
   MOVE -294 TO EDITEDNUMERIC-3.
   MOVE 01302006 TO EDITEDNUMERIC-4.
   MOVE 00123 TO EDITEDNUMERIC-5.
   MOVE 8005551234 TO EDITEDNUMERIC-6.
   MOVE -98700.99 TO EDITEDNUMERIC-7.
   MOVE -98700.88 TO EDITEDNUMERIC-8.
   MOVE "01302006" TO EDITEDALPHA-1.
   MOVE "321654" TO EDITEDALPHA-2.
   MOVE "456123" TO EDITEDALPHA-3.

   MOVE +40 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   MOVE -4321 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   MOVE 98700 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 888 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 17100 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   MOVE -8 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   MOVE 440 TO COMP-99P OF REC-02-L01.
   MOVE -9871 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-sub-main-display-data.

   DISPLAY ALPHA-A.
   DISPLAY ALPHA-A26.
   DISPLAY ALPHANUMERIC-A499.
   DISPLAY ALPHANUMERIC-X.
   DISPLAY ALPHANUMERIC-X37.

   DISPLAY EDITEDNUMERIC-1.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-3.
   DISPLAY EDITEDNUMERIC-4.
   DISPLAY EDITEDNUMERIC-5.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDNUMERIC-7.
   DISPLAY EDITEDNUMERIC-8.
   DISPLAY EDITEDALPHA-1.
   DISPLAY EDITEDALPHA-2.
   DISPLAY EDITEDALPHA-3.

   DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-99P OF REC-02-L01.
   DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-sub-main-tp-01.

    DISPLAY "NESTED SUB-MAIN TEST POINT 01".

 end program nested-sub-main-program.
*****************************************************************************

 end program main-program.
******************************************************************************

 identification division.
 program-id.  sub-program-one.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 linkage section.
 01 param-item-02 native-4.

 procedure division using param-item-02.
 begin-sub-program-one.

   DISPLAY "SUB-PROGRAM-ONE: ENTER".

   DISPLAY "SUB-PROGRAM-ONE: Calling NESTED-SUB-PROGRAM-LEVELONE".
   CALL nested-sub-program-levelOne USING param-item-02.
   DISPLAY "SUB-PROGRAM-ONE: Returned from NESTED-SUB-PROGRAM-LEVELONE".

   PERFORM sub-program-one-tp-01.

   PERFORM sub-program-one-display-data.

   PERFORM sub-program-one-set-data.

   PERFORM sub-program-one-tp-01.

   PERFORM sub-program-one-display-data.

   DISPLAY "SUB-PROGRAM-ONE: EXIT".

   EXIT PROGRAM.

 sub-program-one-set-data.

   MOVE "A" TO ALPHA-A.
   MOVE "ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO ALPHA-A26.
   MOVE "02FRED" TO ALPHANUMERIC-A499.
   MOVE "x" TO ALPHANUMERIC-X.
   MOVE " 1234567890ABCDEFGHIJKLMNOPQRSTUVWXYZ" TO ALPHANUMERIC-X37.

   MOVE 5000000.10 TO EDITEDNUMERIC-1.
   MOVE 111 TO EDITEDNUMERIC-2.
   MOVE 492 TO EDITEDNUMERIC-3.
   MOVE 07161985 TO EDITEDNUMERIC-4.
   MOVE 01234 TO EDITEDNUMERIC-5.
   MOVE 4087672676 TO EDITEDNUMERIC-6.
   MOVE +32100.01 TO EDITEDNUMERIC-7.
   MOVE -32100.01 TO EDITEDNUMERIC-8.
   MOVE "07161985" TO EDITEDALPHA-1.
   MOVE "654321" TO EDITEDALPHA-2.
   MOVE "654321" TO EDITEDALPHA-3.

   MOVE -60 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   MOVE -5678 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   MOVE 34500 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 555 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 82800 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   MOVE -3 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   MOVE 660 TO COMP-99P OF REC-02-L01.
   MOVE -2341 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 sub-program-one-display-data.

   DISPLAY ALPHA-A.
   DISPLAY ALPHA-A26.
   DISPLAY ALPHANUMERIC-A499.
   DISPLAY ALPHANUMERIC-X.
   DISPLAY ALPHANUMERIC-X37.

   DISPLAY EDITEDNUMERIC-1.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-3.
   DISPLAY EDITEDNUMERIC-4.
   DISPLAY EDITEDNUMERIC-5.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDNUMERIC-7.
   DISPLAY EDITEDNUMERIC-8.
   DISPLAY EDITEDALPHA-1.
   DISPLAY EDITEDALPHA-2.
   DISPLAY EDITEDALPHA-3.

   DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-99P OF REC-02-L01.
   DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 sub-program-one-tp-01.

    DISPLAY "SUB-PROGRAM ONE TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-program-levelOne.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 linkage section.
 01 param-item-03 native-4.

 procedure division using param-item-03.
 begin-nested-sub-levelOne.

   DISPLAY "NESTED-SUB-PROGRAM-LEVELONE: ENTER".

   DISPLAY "NESTED-SUB-PROGRAM-LEVELONE: Calling NESTED-SUB-PROGRAM-LEVELTWO".
   CALL nested-sub-program-levelTwo using param-item-03.
   DISPLAY "NESTED-SUB-PROGRAM-LEVELONE: Returned from NESTED-SUB-PROGRAM-LEVELTWO".

   PERFORM nested-levelOne-tp-01.

   PERFORM nested-levelOne-display-data.

   PERFORM nested-levelOne-set-data.

   PERFORM nested-levelOne-tp-01.

   PERFORM nested-levelOne-display-data.

   DISPLAY "NESTED-SUB-PROGRAM-LEVELONE: EXIT".

   EXIT PROGRAM.

 nested-levelOne-set-data.

   MOVE "z" TO ALPHA-A.
   MOVE "zyxwvutsrqponmlkjihgfedcba" TO ALPHA-A26.
   MOVE "99Mary" TO ALPHANUMERIC-A499.
   MOVE "Q" TO ALPHANUMERIC-X.
   MOVE " 1234567890zyxwvutsrqponmlkjihgfedcba" TO ALPHANUMERIC-X37.

   MOVE 5000.99 TO EDITEDNUMERIC-1.
   MOVE 222 TO EDITEDNUMERIC-2.
   MOVE -77 TO EDITEDNUMERIC-3.
   MOVE 03161991 TO EDITEDNUMERIC-4.
   MOVE 00001 TO EDITEDNUMERIC-5.
   MOVE 4085559876 TO EDITEDNUMERIC-6.
   MOVE 54321.66 TO EDITEDNUMERIC-7.
   MOVE -54321.66 TO EDITEDNUMERIC-8.
   MOVE "03161991" TO EDITEDALPHA-1.
   MOVE "987654" TO EDITEDALPHA-2.
   MOVE "456789" TO EDITEDALPHA-3.

   MOVE -80 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   MOVE -2345 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   MOVE 12300 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 444 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 28200 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   MOVE -1 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   MOVE 880 TO COMP-99P OF REC-02-L01.
   MOVE -4321 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-levelOne-display-data.

   DISPLAY ALPHA-A.
   DISPLAY ALPHA-A26.
   DISPLAY ALPHANUMERIC-A499.
   DISPLAY ALPHANUMERIC-X.
   DISPLAY ALPHANUMERIC-X37.

   DISPLAY EDITEDNUMERIC-1.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-3.
   DISPLAY EDITEDNUMERIC-4.
   DISPLAY EDITEDNUMERIC-5.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDNUMERIC-7.
   DISPLAY EDITEDNUMERIC-8.
   DISPLAY EDITEDALPHA-1.
   DISPLAY EDITEDALPHA-2.
   DISPLAY EDITEDALPHA-3.

   DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-99P OF REC-02-L01.
   DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-levelOne-tp-01.

    DISPLAY "NESTED SUB-PROGRAM LEVEL ONE TEST POINT 01".

*****************************************************************************

 identification division.
 program-id.  nested-sub-program-levelTwo.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 linkage section.
 01 ls-inner-item native-4.

 procedure division using ls-inner-item.
 begin-nested-sub-levelTwo.

   DISPLAY "NESTED-SUB-PROGRAM-LEVELTWO: ENTER".

   PERFORM nested-levelTwo-set-data.

   PERFORM nested-levelTwo-tp-01.

   PERFORM nested-levelTwo-display-data.

   DISPLAY "NESTED-SUB-PROGRAM-LEVELTWO: EXIT".

   EXIT PROGRAM.

 nested-levelTwo-set-data.

   MOVE "z" TO ALPHA-A.
   MOVE "ZYXWVUTSRQPONMLKJIHGFEDCBA" TO ALPHA-A26.
   MOVE "99Mary" TO ALPHANUMERIC-A499.
   MOVE "Q" TO ALPHANUMERIC-X.
   MOVE " 1234567890ZYXWVUTSRQPONMLKJIHGFEDCBA" TO ALPHANUMERIC-X37.

   MOVE 9999.50 TO EDITEDNUMERIC-1.
   MOVE 333 TO EDITEDNUMERIC-2.
   MOVE 677 TO EDITEDNUMERIC-3.
   MOVE 02231994 TO EDITEDNUMERIC-4.
   MOVE 00011 TO EDITEDNUMERIC-5.
   MOVE 8888888888 TO EDITEDNUMERIC-6.
   MOVE 98765.43 TO EDITEDNUMERIC-7.
   MOVE -98765.43 TO EDITEDNUMERIC-8.
   MOVE "02231994" TO EDITEDALPHA-1.
   MOVE "111111" TO EDITEDALPHA-2.
   MOVE "111111" TO EDITEDALPHA-3.

   MOVE -10 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   MOVE -7654 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   MOVE 55500 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 222 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 93900 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   MOVE -9 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   MOVE 110 TO COMP-99P OF REC-02-L01.
   MOVE -6781 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-levelTwo-display-data.

   DISPLAY ALPHA-A.
   DISPLAY ALPHA-A26.
   DISPLAY ALPHANUMERIC-A499.
   DISPLAY ALPHANUMERIC-X.
   DISPLAY ALPHANUMERIC-X37.

   DISPLAY EDITEDNUMERIC-1.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-3.
   DISPLAY EDITEDNUMERIC-4.
   DISPLAY EDITEDNUMERIC-5.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDNUMERIC-7.
   DISPLAY EDITEDNUMERIC-8.
   DISPLAY EDITEDALPHA-1.
   DISPLAY EDITEDALPHA-2.
   DISPLAY EDITEDALPHA-3.

   DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-99P OF REC-02-L01.
   DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 nested-levelTwo-tp-01.

    DISPLAY "NESTED SUB-PROGRAM LEVEL TWO TEST POINT 01".

 end program nested-sub-program-levelTwo.
*****************************************************************************

 end program nested-sub-program-levelOne.
*****************************************************************************

 end program sub-program-one.
*****************************************************************************

 identification division.
 program-id.  sub-program-two.

 data division.
 working-storage section.

 01 ALPHA-A              PIC A EXTERNAL.
 01 ALPHA-A26            PIC A(26) EXTERNAL.

 01 ALPHANUMERIC-A499    PIC A(4)99 EXTERNAL.
 01 ALPHANUMERIC-X       PIC X EXTERNAL.
 01 ALPHANUMERIC-X37     PIC X(37) EXTERNAL.

 01 REC-01-L01 EXTERNAL.
   05 EDITEDNUMERIC-1 PIC ZZZ,ZZZ,ZZZ.99.
   05 EDITEDNUMERIC-2 PIC $999.
   05 EDITEDNUMERIC-3 PIC 999CR.
   05 EDITEDNUMERIC-4 PIC 99/99/9999.
   05 EDITEDNUMERIC-5 PIC ***99.
   05 EDITEDNUMERIC-6 PIC 9(3)B9(3)B9(4).
   05 EDITEDNUMERIC-7 PIC 9(5).99CR.
   05 EDITEDNUMERIC-8 PIC 9(5).99DB.
   05 EDITEDALPHA-1   PIC XX/XX/XXXX.
   05 EDITEDALPHA-2   PIC XBXBXBXBXBX.
   05 EDITEDALPHA-3   PIC X0X0X0X0X0X.

 01 REC-02-L01 EXTERNAL.
   05 REC-02-L02.
     10 DISPLAY-S9999-TS     DISPLAY PIC  S9(4) Trailing Separate.
     10 COMP-S9999           COMP PIC S9(4).
     10 REC-02-L03.
       15 DISPLAY-999PP        DISPLAY PIC 999PP.
       15 DISPLAY-S999-LEPOS   DISPLAY PIC S9(3).
     10 COMP-9999PP          COMP PIC S999PP.
     10 BINARY-S9            BINARY PIC S9.
   05 COMP-99P             COMP PIC 99PP.
   05 COMPUTATIONAL-S9999  COMPUTATIONAL PIC S9(4).

 linkage section.
 01 param-item-05 native-4.

 procedure division using param-item-05.
 begin-sub-program-two.

   DISPLAY "SUB-PROGRAM-TWO: ENTER".

   PERFORM sub-program-two-set-data.

   PERFORM sub-program-two-tp-01.

   PERFORM sub-program-two-display-data.

   DISPLAY "SUB-PROGRAM-TWO: EXIT".

   EXIT PROGRAM.

 sub-program-two-set-data.

   MOVE "G" TO ALPHA-A.
   MOVE "ZyXwVuTsRqPoNmLkJiHgFeDcBa" TO ALPHA-A26.
   MOVE "01JOHN" TO ALPHANUMERIC-A499.
   MOVE "8" TO ALPHANUMERIC-X.
   MOVE " 1234567890ZyXwVuTsRqPoNmLkJiHgFeDcBa" TO ALPHANUMERIC-X37.

   MOVE 6677.88 TO EDITEDNUMERIC-1.
   MOVE 444 TO EDITEDNUMERIC-2.
   MOVE 888 TO EDITEDNUMERIC-3.
   MOVE 10101995 TO EDITEDNUMERIC-4.
   MOVE 00111 TO EDITEDNUMERIC-5.
   MOVE 7777777777 TO EDITEDNUMERIC-6.
   MOVE -12345.67 TO EDITEDNUMERIC-7.
   MOVE +12345.67 TO EDITEDNUMERIC-8.
   MOVE "10101995" TO EDITEDALPHA-1.
   MOVE "777777" TO EDITEDALPHA-2.
   MOVE "777777" TO EDITEDALPHA-3.

   MOVE -30 TO DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   MOVE -3456 TO COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   MOVE 87600 TO DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 666 TO DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   MOVE 39300 TO COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   MOVE -8 TO BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   MOVE 330 TO COMP-99P OF REC-02-L01.
   MOVE -5671 TO COMPUTATIONAL-S9999 OF REC-02-L01.

 sub-program-two-display-data.

   DISPLAY ALPHA-A.
   DISPLAY ALPHA-A26.
   DISPLAY ALPHANUMERIC-A499.
   DISPLAY ALPHANUMERIC-X.
   DISPLAY ALPHANUMERIC-X37.

   DISPLAY EDITEDNUMERIC-1.
   DISPLAY EDITEDNUMERIC-2.
   DISPLAY EDITEDNUMERIC-3.
   DISPLAY EDITEDNUMERIC-4.
   DISPLAY EDITEDNUMERIC-5.
   DISPLAY EDITEDNUMERIC-6.
   DISPLAY EDITEDNUMERIC-7.
   DISPLAY EDITEDNUMERIC-8.
   DISPLAY EDITEDALPHA-1.
   DISPLAY EDITEDALPHA-2.
   DISPLAY EDITEDALPHA-3.

   DISPLAY DISPLAY-S9999-TS OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-S9999 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-999PP OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY DISPLAY-S999-LEPOS OF REC-02-L03 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-9999PP OF REC-02-L02 OF REC-02-L01.
   DISPLAY BINARY-S9 OF REC-02-L02 OF REC-02-L01.
   DISPLAY COMP-99P OF REC-02-L01.
   DISPLAY COMPUTATIONAL-S9999 OF REC-02-L01.

 sub-program-two-tp-01.

    DISPLAY "SUB-PROGRAM TWO TEST POINT 01".

 end program sub-program-two.
*****************************************************************************
