 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXAMPLE.
 AUTHOR. HP.
 DATE-WRITTEN.
 DATE-COMPILED.
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
   SOURCE-COMPUTER. TANDEM.
   OBJECT-COMPUTER. TANDEM.
 PROCEDURE DIVISION.
 MAIN SECTION.
 BEGIN-COBOL.
  PERFORM INITIALI THRU INTIALIE.
  PERFORM INITIALI THRU INTIALIE.
  STOP RUN.

 INITIALI SECTION.
   DISPLAY "PERFORMING...".

  INTIALIE.
   EXIT.
